{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "37687\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "import json\n",
    "from environs import Env\n",
    "from graph_functions import query_to_df,start_graph_session, start_graph_session_crashdown\n",
    "from IPython.display import Image\n",
    "\n",
    "\n",
    "env = Env()\n",
    "session = start_graph_session(env) \n",
    "#session = start_graph_session_crashdown(env) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Get GWAS with available full summary data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (gwas:Gwas) -[gwas_to_variant:GWAS_TO_VARIANT]->(variant:Variant)\n",
      "where toLower(gwas.trait) contains \"breast\"\n",
      "and not(toLower(gwas.trait) contains \"baby\") and not(toLower(gwas.trait) contains \"mother\")\n",
      "return distinct gwas.trait, gwas.id, gwas_to_variant.samplesize as SampleSize,\n",
      "toInteger(gwas.ncase) as N_case, toInteger(gwas.ncontrol) as N_control, gwas.author, gwas.year,\n",
      "count(gwas_to_variant.pval) as signifSNPs\n",
      "order by gwas_to_variant.samplesize desc\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>gwas.trait</th>\n",
       "      <th>gwas.id</th>\n",
       "      <th>SampleSize</th>\n",
       "      <th>N_case</th>\n",
       "      <th>N_control</th>\n",
       "      <th>gwas.author</th>\n",
       "      <th>gwas.year</th>\n",
       "      <th>signifSNPs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>337199</td>\n",
       "      <td>5510</td>\n",
       "      <td>331689</td>\n",
       "      <td>Neale</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Cancer code  self-reported: breast cancer</td>\n",
       "      <td>ukb-a-55</td>\n",
       "      <td>337159</td>\n",
       "      <td>7480</td>\n",
       "      <td>329679</td>\n",
       "      <td>Neale</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Breast cancer (Combined Oncoarray; iCOGS; GWAS...</td>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>228951</td>\n",
       "      <td>122977</td>\n",
       "      <td>105974</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>141</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ER+ Breast cancer (Combined Oncoarray; iCOGS; ...</td>\n",
       "      <td>ieu-a-1127</td>\n",
       "      <td>175475</td>\n",
       "      <td>69501</td>\n",
       "      <td>105974</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>107</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ER- Breast cancer (Combined Oncoarray; iCOGS; ...</td>\n",
       "      <td>ieu-a-1128</td>\n",
       "      <td>127442</td>\n",
       "      <td>21468</td>\n",
       "      <td>105974</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>37</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1129</td>\n",
       "      <td>106776</td>\n",
       "      <td>61282</td>\n",
       "      <td>45494</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>60</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1130</td>\n",
       "      <td>89677</td>\n",
       "      <td>46785</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>47</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ER+ Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1132</td>\n",
       "      <td>83691</td>\n",
       "      <td>38197</td>\n",
       "      <td>45494</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>58</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ER+ Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1133</td>\n",
       "      <td>69970</td>\n",
       "      <td>27078</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>41</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ER- Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1135</td>\n",
       "      <td>55149</td>\n",
       "      <td>9655</td>\n",
       "      <td>45494</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>ER- Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1136</td>\n",
       "      <td>50225</td>\n",
       "      <td>7333</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1131</td>\n",
       "      <td>32498</td>\n",
       "      <td>14910</td>\n",
       "      <td>17588</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ER- Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1137</td>\n",
       "      <td>22068</td>\n",
       "      <td>4480</td>\n",
       "      <td>17588</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>ER+ Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1134</td>\n",
       "      <td>21814</td>\n",
       "      <td>4226</td>\n",
       "      <td>17588</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           gwas.trait     gwas.id  SampleSize  \\\n",
       "0   Diagnoses - main ICD10: C50 Malignant neoplasm...   ukb-a-519      337199   \n",
       "1           Cancer code  self-reported: breast cancer    ukb-a-55      337159   \n",
       "2   Breast cancer (Combined Oncoarray; iCOGS; GWAS...  ieu-a-1126      228951   \n",
       "3   ER+ Breast cancer (Combined Oncoarray; iCOGS; ...  ieu-a-1127      175475   \n",
       "4   ER- Breast cancer (Combined Oncoarray; iCOGS; ...  ieu-a-1128      127442   \n",
       "5                           Breast cancer (Oncoarray)  ieu-a-1129      106776   \n",
       "6                               Breast cancer (iCOGS)  ieu-a-1130       89677   \n",
       "7                       ER+ Breast cancer (Oncoarray)  ieu-a-1132       83691   \n",
       "8                           ER+ Breast cancer (iCOGS)  ieu-a-1133       69970   \n",
       "9                       ER- Breast cancer (Oncoarray)  ieu-a-1135       55149   \n",
       "10                          ER- Breast cancer (iCOGS)  ieu-a-1136       50225   \n",
       "11                               Breast cancer (GWAS)  ieu-a-1131       32498   \n",
       "12                           ER- Breast cancer (GWAS)  ieu-a-1137       22068   \n",
       "13                           ER+ Breast cancer (GWAS)  ieu-a-1134       21814   \n",
       "\n",
       "    N_case  N_control    gwas.author gwas.year  signifSNPs  \n",
       "0     5510     331689          Neale    2017.0           7  \n",
       "1     7480     329679          Neale    2017.0          17  \n",
       "2   122977     105974  Michailidou K    2017.0         141  \n",
       "3    69501     105974  Michailidou K    2017.0         107  \n",
       "4    21468     105974  Michailidou K    2017.0          37  \n",
       "5    61282      45494  Michailidou K    2017.0          60  \n",
       "6    46785      42892  Michailidou K    2017.0          47  \n",
       "7    38197      45494  Michailidou K    2017.0          58  \n",
       "8    27078      42892  Michailidou K    2017.0          41  \n",
       "9     9655      45494  Michailidou K    2017.0          13  \n",
       "10    7333      42892  Michailidou K    2017.0           6  \n",
       "11   14910      17588  Michailidou K    2017.0          17  \n",
       "12    4480      17588  Michailidou K    2017.0           2  \n",
       "13    4226      17588  Michailidou K    2017.0           8  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (gwas:Gwas) -[gwas_to_variant:GWAS_TO_VARIANT]->(variant:Variant)\n",
    "where toLower(gwas.trait) contains \"breast\"\n",
    "and not(toLower(gwas.trait) contains \"baby\") and not(toLower(gwas.trait) contains \"mother\")\n",
    "return distinct gwas.trait, gwas.id, gwas_to_variant.samplesize as SampleSize,\n",
    "toInteger(gwas.ncase) as N_case, toInteger(gwas.ncontrol) as N_control, gwas.author, gwas.year,\n",
    "count(gwas_to_variant.pval) as signifSNPs\n",
    "order by gwas_to_variant.samplesize desc\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "all_bc_gwas = list(df['gwas.id'])\n",
    "df\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## MR data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "WHERE outcome.id = \"ieu-a-1126\"  \n",
      "AND (not (toLower(exposure.trait) contains 'breast')) \n",
      "AND mr.pval < 1e-08\n",
      "RETURN exposure {.id, .trait}, outcome.id, mr {.b, .pval, .method, .selection, .moescore} ORDER BY mr.pval\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>outcome.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.method</th>\n",
       "      <th>mr.selection</th>\n",
       "      <th>mr.pval</th>\n",
       "      <th>mr.moescore</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Non-cancer illness code  self-reported: osteoa...</td>\n",
       "      <td>ukb-a-106</td>\n",
       "      <td>1.778924</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.041688e-298</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Mineral and other dietary supplements: Glucosa...</td>\n",
       "      <td>ukb-a-494</td>\n",
       "      <td>-0.133423</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>5.154322e-35</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Diagnoses - main ICD10: R14 Flatulence and rel...</td>\n",
       "      <td>ukb-a-584</td>\n",
       "      <td>12.411659</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>6.556335e-31</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Average weekly champagne plus white wine intake</td>\n",
       "      <td>ukb-a-27</td>\n",
       "      <td>-0.591364</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.926666e-30</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Non-cancer illness code  self-reported: pernic...</td>\n",
       "      <td>ukb-a-90</td>\n",
       "      <td>5.220976</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.364830e-26</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Reason for glasses/contact lenses: For just re...</td>\n",
       "      <td>ukb-a-421</td>\n",
       "      <td>2.099325</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>9.570221e-16</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Waist circumference</td>\n",
       "      <td>ieu-a-102</td>\n",
       "      <td>-0.642405</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.990503e-14</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Diagnoses - main ICD10: I84 Haemorrhoids</td>\n",
       "      <td>ukb-a-539</td>\n",
       "      <td>6.393298</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.474239e-13</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Body mass index</td>\n",
       "      <td>ieu-a-974</td>\n",
       "      <td>-0.788037</td>\n",
       "      <td>FE Egger</td>\n",
       "      <td>HF</td>\n",
       "      <td>9.788118e-13</td>\n",
       "      <td>0.76</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Non-cancer illness code  self-reported: type 2...</td>\n",
       "      <td>ukb-a-75</td>\n",
       "      <td>14.578263</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.636759e-12</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Waist circumference</td>\n",
       "      <td>ieu-a-103</td>\n",
       "      <td>-0.667426</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.862570e-12</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Non-cancer illness code  self-reported: pulmon...</td>\n",
       "      <td>ukb-a-64</td>\n",
       "      <td>-3.124754</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.552255e-11</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Hip circumference</td>\n",
       "      <td>ieu-a-99</td>\n",
       "      <td>-0.571581</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>6.247788e-11</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Age at menopause</td>\n",
       "      <td>ieu-a-1004</td>\n",
       "      <td>0.042542</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>Tophits</td>\n",
       "      <td>6.909245e-11</td>\n",
       "      <td>0.96</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Types of physical activity in last 4 weeks: No...</td>\n",
       "      <td>ukb-a-483</td>\n",
       "      <td>3.564379</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>HF</td>\n",
       "      <td>4.223489e-09</td>\n",
       "      <td>0.71</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    outcome.id                                     exposure.trait exposure.id  \\\n",
       "0   ieu-a-1126  Non-cancer illness code  self-reported: osteoa...   ukb-a-106   \n",
       "1   ieu-a-1126  Mineral and other dietary supplements: Glucosa...   ukb-a-494   \n",
       "2   ieu-a-1126  Diagnoses - main ICD10: R14 Flatulence and rel...   ukb-a-584   \n",
       "3   ieu-a-1126    Average weekly champagne plus white wine intake    ukb-a-27   \n",
       "4   ieu-a-1126  Non-cancer illness code  self-reported: pernic...    ukb-a-90   \n",
       "5   ieu-a-1126  Reason for glasses/contact lenses: For just re...   ukb-a-421   \n",
       "6   ieu-a-1126                                Waist circumference   ieu-a-102   \n",
       "7   ieu-a-1126           Diagnoses - main ICD10: I84 Haemorrhoids   ukb-a-539   \n",
       "8   ieu-a-1126                                    Body mass index   ieu-a-974   \n",
       "9   ieu-a-1126  Non-cancer illness code  self-reported: type 2...    ukb-a-75   \n",
       "10  ieu-a-1126                                Waist circumference   ieu-a-103   \n",
       "11  ieu-a-1126  Non-cancer illness code  self-reported: pulmon...    ukb-a-64   \n",
       "12  ieu-a-1126                                  Hip circumference    ieu-a-99   \n",
       "13  ieu-a-1126                                   Age at menopause  ieu-a-1004   \n",
       "14  ieu-a-1126  Types of physical activity in last 4 weeks: No...   ukb-a-483   \n",
       "\n",
       "         mr.b mr.method mr.selection        mr.pval mr.moescore  \n",
       "0    1.778924    FE IVW           DF  1.041688e-298           1  \n",
       "1   -0.133423    FE IVW           DF   5.154322e-35           1  \n",
       "2   12.411659    FE IVW           DF   6.556335e-31           1  \n",
       "3   -0.591364    FE IVW           DF   3.926666e-30           1  \n",
       "4    5.220976    FE IVW           DF   3.364830e-26           1  \n",
       "5    2.099325    FE IVW           DF   9.570221e-16           1  \n",
       "6   -0.642405    FE IVW           DF   1.990503e-14           1  \n",
       "7    6.393298    FE IVW           DF   1.474239e-13           1  \n",
       "8   -0.788037  FE Egger           HF   9.788118e-13        0.76  \n",
       "9   14.578263    FE IVW           DF   1.636759e-12           1  \n",
       "10  -0.667426    FE IVW           DF   1.862570e-12           1  \n",
       "11  -3.124754    FE IVW           DF   3.552255e-11           1  \n",
       "12  -0.571581    FE IVW           DF   6.247788e-11           1  \n",
       "13   0.042542    FE IVW      Tophits   6.909245e-11        0.96  \n",
       "14   3.564379    FE IVW           HF   4.223489e-09        0.71  "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# MR\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id = \"ieu-a-1126\"  \n",
    "AND (not (toLower(exposure.trait) contains 'breast')) \n",
    "AND mr.pval < 1e-08\n",
    "RETURN exposure {.id, .trait}, outcome.id, mr {.b, .pval, .method, .selection, .moescore} ORDER BY mr.pval\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.sample_size</th>\n",
       "      <th>outcome_ids</th>\n",
       "      <th>MR_pvals</th>\n",
       "      <th>MR_beta</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ukb-a-479</td>\n",
       "      <td>Types of transport used (excluding work): Walk</td>\n",
       "      <td>335650.0</td>\n",
       "      <td>[ukb-a-519, ieu-a-1133, ieu-a-1130, ieu-a-1127]</td>\n",
       "      <td>[0.0, 0.0, 1.07475737570078e-94, 1.07287985891...</td>\n",
       "      <td>[-0.057670440232475, -3.04315827052595, -2.226...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ukb-a-564</td>\n",
       "      <td>Diagnoses - main ICD10: M20 Acquired deformiti...</td>\n",
       "      <td>337199.0</td>\n",
       "      <td>[ukb-a-519, ieu-a-1128]</td>\n",
       "      <td>[0.0, 2.21581458567691e-47]</td>\n",
       "      <td>[0.108120720828772, 13.955307103413]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ukb-a-141</td>\n",
       "      <td>Treatment/medication code: prednisolone</td>\n",
       "      <td>337159.0</td>\n",
       "      <td>[ieu-a-1127, ieu-a-1129, ieu-a-1131, ieu-a-1126]</td>\n",
       "      <td>[0.0, 3.63681897771967e-08, 1.94394021194942e-...</td>\n",
       "      <td>[-12.9082685230119, -4.68661917520307, -9.9491...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ukb-a-493</td>\n",
       "      <td>Mineral and other dietary supplements: None of...</td>\n",
       "      <td>336314.0</td>\n",
       "      <td>[ieu-a-1136, ieu-a-1131, ieu-a-1137]</td>\n",
       "      <td>[0.0, 0.0, 4.19019391015668e-210]</td>\n",
       "      <td>[-2.5986128974828, 1.38980136065847, 1.7405472...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ieu-a-1073</td>\n",
       "      <td>Copper</td>\n",
       "      <td>2603.0</td>\n",
       "      <td>[ieu-a-1131]</td>\n",
       "      <td>[0.0]</td>\n",
       "      <td>[-0.0866186818986572]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>128</th>\n",
       "      <td>ukb-a-210</td>\n",
       "      <td>Illnesses of mother: Alzheimer's disease/dementia</td>\n",
       "      <td>308780.0</td>\n",
       "      <td>[ieu-a-1126]</td>\n",
       "      <td>[6.57162785000218e-06]</td>\n",
       "      <td>[-0.566625170720048]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>129</th>\n",
       "      <td>ukb-a-436</td>\n",
       "      <td>Vascular/heart problems diagnosed by doctor: A...</td>\n",
       "      <td>336683.0</td>\n",
       "      <td>[ieu-a-1129]</td>\n",
       "      <td>[6.77471595152415e-06]</td>\n",
       "      <td>[-5.96361006896053]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>130</th>\n",
       "      <td>ukb-a-273</td>\n",
       "      <td>Impedance of arm (left)</td>\n",
       "      <td>331292.0</td>\n",
       "      <td>[ieu-a-1127]</td>\n",
       "      <td>[7.02989960407756e-06]</td>\n",
       "      <td>[0.151954240584118]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>131</th>\n",
       "      <td>ieu-a-295</td>\n",
       "      <td>Inflammatory bowel disease</td>\n",
       "      <td>2413.0</td>\n",
       "      <td>[ieu-a-1135]</td>\n",
       "      <td>[7.81207401376598e-06]</td>\n",
       "      <td>[-0.0220616670472059]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>132</th>\n",
       "      <td>ukb-a-344</td>\n",
       "      <td>Difficulty not smoking for 1 day</td>\n",
       "      <td>23332.0</td>\n",
       "      <td>[ukb-a-519]</td>\n",
       "      <td>[8.67851503239084e-06]</td>\n",
       "      <td>[-0.00701223830790363]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>133 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    exposure.id                                     exposure.trait  \\\n",
       "0     ukb-a-479     Types of transport used (excluding work): Walk   \n",
       "1     ukb-a-564  Diagnoses - main ICD10: M20 Acquired deformiti...   \n",
       "2     ukb-a-141            Treatment/medication code: prednisolone   \n",
       "3     ukb-a-493  Mineral and other dietary supplements: None of...   \n",
       "4    ieu-a-1073                                             Copper   \n",
       "..          ...                                                ...   \n",
       "128   ukb-a-210  Illnesses of mother: Alzheimer's disease/dementia   \n",
       "129   ukb-a-436  Vascular/heart problems diagnosed by doctor: A...   \n",
       "130   ukb-a-273                            Impedance of arm (left)   \n",
       "131   ieu-a-295                         Inflammatory bowel disease   \n",
       "132   ukb-a-344                   Difficulty not smoking for 1 day   \n",
       "\n",
       "    exposure.sample_size                                       outcome_ids  \\\n",
       "0               335650.0   [ukb-a-519, ieu-a-1133, ieu-a-1130, ieu-a-1127]   \n",
       "1               337199.0                           [ukb-a-519, ieu-a-1128]   \n",
       "2               337159.0  [ieu-a-1127, ieu-a-1129, ieu-a-1131, ieu-a-1126]   \n",
       "3               336314.0              [ieu-a-1136, ieu-a-1131, ieu-a-1137]   \n",
       "4                 2603.0                                      [ieu-a-1131]   \n",
       "..                   ...                                               ...   \n",
       "128             308780.0                                      [ieu-a-1126]   \n",
       "129             336683.0                                      [ieu-a-1129]   \n",
       "130             331292.0                                      [ieu-a-1127]   \n",
       "131               2413.0                                      [ieu-a-1135]   \n",
       "132              23332.0                                       [ukb-a-519]   \n",
       "\n",
       "                                              MR_pvals  \\\n",
       "0    [0.0, 0.0, 1.07475737570078e-94, 1.07287985891...   \n",
       "1                          [0.0, 2.21581458567691e-47]   \n",
       "2    [0.0, 3.63681897771967e-08, 1.94394021194942e-...   \n",
       "3                    [0.0, 0.0, 4.19019391015668e-210]   \n",
       "4                                                [0.0]   \n",
       "..                                                 ...   \n",
       "128                             [6.57162785000218e-06]   \n",
       "129                             [6.77471595152415e-06]   \n",
       "130                             [7.02989960407756e-06]   \n",
       "131                             [7.81207401376598e-06]   \n",
       "132                             [8.67851503239084e-06]   \n",
       "\n",
       "                                               MR_beta  \n",
       "0    [-0.057670440232475, -3.04315827052595, -2.226...  \n",
       "1                 [0.108120720828772, 13.955307103413]  \n",
       "2    [-12.9082685230119, -4.68661917520307, -9.9491...  \n",
       "3    [-2.5986128974828, 1.38980136065847, 1.7405472...  \n",
       "4                                [-0.0866186818986572]  \n",
       "..                                                 ...  \n",
       "128                               [-0.566625170720048]  \n",
       "129                                [-5.96361006896053]  \n",
       "130                                [0.151954240584118]  \n",
       "131                              [-0.0220616670472059]  \n",
       "132                             [-0.00701223830790363]  \n",
       "\n",
       "[133 rows x 6 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# MR\n",
    "# get traits that have pval < 1e-05\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id in {gwas_list} \n",
    "AND  not exposure.id  in {gwas_list}\n",
    "//AND (not (toLower(exposure.trait) contains 'breast')) \n",
    "AND mr.pval < 1e-05\n",
    "with mr, exposure, outcome\n",
    "ORDER BY mr.pval \n",
    "RETURN exposure.id, exposure.trait, exposure.sample_size,\n",
    "        collect(outcome.id) as outcome_ids, \n",
    "        collect(mr.pval) as MR_pvals, collect(mr.b) as MR_beta\n",
    "        \n",
    "\"\"\".format(gwas_list = all_bc_gwas)\n",
    "df = query_to_df(session, query, False)\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "WHERE outcome.id in ['ukb-a-519', 'ukb-a-55', 'ieu-a-1126', 'ieu-a-1127', 'ieu-a-1128', 'ieu-a-1129', 'ieu-a-1130', 'ieu-a-1132', 'ieu-a-1133', 'ieu-a-1135', 'ieu-a-1136', 'ieu-a-1131', 'ieu-a-1137', 'ieu-a-1134'] \n",
      "AND  exposure.id  in ['ukb-a-543', 'ukb-a-103', 'ieu-a-1051', 'ukb-a-494', 'ukb-a-197', 'ukb-a-178', 'ukb-a-537', 'ukb-a-30', 'ukb-a-260', 'ieu-a-92', 'ukb-a-204', 'ieu-a-1017', 'ukb-a-14', 'ieu-a-101', 'ieu-a-89', 'ukb-a-495', 'ukb-a-354', 'ukb-a-344', 'ukb-a-532', 'ukb-a-531', 'ukb-a-288', 'ukb-a-213', 'ieu-a-785', 'ieu-a-974', 'ukb-a-585', 'ukb-a-416', 'ukb-a-472', 'ukb-a-7', 'ieu-a-68', 'ukb-a-184', 'ieu-a-103', 'ukb-a-11', 'ukb-a-214', 'ukb-a-552', 'ieu-a-792', 'ieu-a-102', 'ukb-a-186', 'ukb-a-555', 'ukb-a-512', 'ukb-a-173', 'ukb-a-487', 'ukb-a-584', 'ukb-a-180', 'ukb-a-323', 'ukb-a-421', 'ukb-a-27', 'ukb-a-91', 'ukb-a-109', 'ukb-a-578', 'ukb-a-420', 'ukb-a-492', 'ieu-a-965', 'ukb-a-479', 'ukb-a-78', 'ukb-a-520', 'ukb-a-304', 'ukb-a-493', 'ukb-a-393', 'ukb-a-149', 'ukb-a-102', 'ieu-a-93', 'ukb-a-64', 'ukb-a-486', 'ukb-a-122', 'ieu-a-295', 'ukb-a-307', 'ukb-a-217', 'ieu-a-803', 'ukb-a-522', 'ukb-a-481', 'ukb-a-414', 'ukb-a-553', 'ieu-a-55', 'ukb-a-401', 'ieu-a-1004', 'ukb-a-364', 'ukb-a-210', 'ukb-a-60', 'ukb-a-564', 'ukb-a-314', 'ukb-a-378', 'ukb-a-426', 'ukb-a-75', 'ukb-a-328', 'ukb-a-195', 'ukb-a-151', 'ieu-a-970', 'ukb-a-72', 'ukb-a-320', 'ukb-a-464', 'ukb-a-206', 'ukb-a-106', 'ukb-a-529', 'ukb-a-110', 'ieu-a-1073', 'ukb-a-273', 'ukb-a-365', 'ieu-a-794', 'ukb-a-138', 'ukb-a-4', 'ieu-a-91', 'ukb-a-90', 'ieu-a-1049', 'ieu-a-99', 'ukb-a-36', 'ieu-a-87', 'ukb-a-436', 'ieu-a-1088', 'ukb-a-34', 'ukb-a-141', 'ukb-a-211', 'ukb-a-152', 'ukb-a-339', 'ieu-a-29', 'ukb-a-342', 'ukb-a-574', 'ukb-a-483', 'ieu-a-1034', 'ukb-a-418', 'ukb-a-357', 'ukb-a-565', 'ukb-a-175', 'ukb-a-167', 'ieu-a-1015', 'ukb-a-563', 'ukb-a-343', 'ukb-a-155', 'ukb-a-539', 'ukb-a-117', 'ieu-a-85', 'ukb-a-148', 'ieu-a-100', 'ukb-a-459']\n",
      "with mr, exposure, outcome\n",
      "ORDER BY exposure.trait\n",
      "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, \n",
      "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
      "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, mr.pval, mr.b, mr.se\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.sample_size</th>\n",
       "      <th>exposure.sex</th>\n",
       "      <th>year</th>\n",
       "      <th>author</th>\n",
       "      <th>consortium</th>\n",
       "      <th>outcome.id</th>\n",
       "      <th>outcome.sample_size</th>\n",
       "      <th>N_case</th>\n",
       "      <th>mr.pval</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.se</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ukb-a-320</td>\n",
       "      <td>Age at last live birth</td>\n",
       "      <td>123676.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>2017</td>\n",
       "      <td>Neale</td>\n",
       "      <td>Neale Lab</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>337199.0</td>\n",
       "      <td>5510</td>\n",
       "      <td>2.171147e-01</td>\n",
       "      <td>-0.004151</td>\n",
       "      <td>0.003363</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ukb-a-320</td>\n",
       "      <td>Age at last live birth</td>\n",
       "      <td>123676.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>2017</td>\n",
       "      <td>Neale</td>\n",
       "      <td>Neale Lab</td>\n",
       "      <td>ukb-a-55</td>\n",
       "      <td>337159.0</td>\n",
       "      <td>7480</td>\n",
       "      <td>5.719176e-06</td>\n",
       "      <td>-0.013066</td>\n",
       "      <td>0.002880</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ukb-a-320</td>\n",
       "      <td>Age at last live birth</td>\n",
       "      <td>123676.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>2017</td>\n",
       "      <td>Neale</td>\n",
       "      <td>Neale Lab</td>\n",
       "      <td>ieu-a-1127</td>\n",
       "      <td>175475.0</td>\n",
       "      <td>69501</td>\n",
       "      <td>1.401091e-02</td>\n",
       "      <td>-0.390523</td>\n",
       "      <td>0.158944</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ukb-a-320</td>\n",
       "      <td>Age at last live birth</td>\n",
       "      <td>123676.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>2017</td>\n",
       "      <td>Neale</td>\n",
       "      <td>Neale Lab</td>\n",
       "      <td>ieu-a-1132</td>\n",
       "      <td>83691.0</td>\n",
       "      <td>38197</td>\n",
       "      <td>1.002960e-02</td>\n",
       "      <td>-0.550637</td>\n",
       "      <td>0.213856</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ukb-a-320</td>\n",
       "      <td>Age at last live birth</td>\n",
       "      <td>123676.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>2017</td>\n",
       "      <td>Neale</td>\n",
       "      <td>Neale Lab</td>\n",
       "      <td>ieu-a-1133</td>\n",
       "      <td>69970.0</td>\n",
       "      <td>27078</td>\n",
       "      <td>3.159866e-01</td>\n",
       "      <td>-0.248122</td>\n",
       "      <td>0.247444</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1837</th>\n",
       "      <td>ieu-a-68</td>\n",
       "      <td>Waist circumference</td>\n",
       "      <td>134038.0</td>\n",
       "      <td>Females</td>\n",
       "      <td>2015</td>\n",
       "      <td>Shungin D</td>\n",
       "      <td>None</td>\n",
       "      <td>ukb-a-55</td>\n",
       "      <td>337159.0</td>\n",
       "      <td>7480</td>\n",
       "      <td>7.833466e-01</td>\n",
       "      <td>0.000920</td>\n",
       "      <td>0.003345</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1838</th>\n",
       "      <td>ieu-a-102</td>\n",
       "      <td>Waist circumference</td>\n",
       "      <td>60586.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>2013</td>\n",
       "      <td>Randall JC</td>\n",
       "      <td>None</td>\n",
       "      <td>ukb-a-55</td>\n",
       "      <td>337159.0</td>\n",
       "      <td>7480</td>\n",
       "      <td>1.080044e-07</td>\n",
       "      <td>-0.022054</td>\n",
       "      <td>0.004151</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1839</th>\n",
       "      <td>ieu-a-68</td>\n",
       "      <td>Waist circumference</td>\n",
       "      <td>134038.0</td>\n",
       "      <td>Females</td>\n",
       "      <td>2015</td>\n",
       "      <td>Shungin D</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1131</td>\n",
       "      <td>32498.0</td>\n",
       "      <td>14910</td>\n",
       "      <td>2.952982e-01</td>\n",
       "      <td>0.177187</td>\n",
       "      <td>0.169303</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1840</th>\n",
       "      <td>ieu-a-103</td>\n",
       "      <td>Waist circumference</td>\n",
       "      <td>73137.0</td>\n",
       "      <td>Females</td>\n",
       "      <td>2013</td>\n",
       "      <td>Randall JC</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1131</td>\n",
       "      <td>32498.0</td>\n",
       "      <td>14910</td>\n",
       "      <td>6.832442e-10</td>\n",
       "      <td>-0.699319</td>\n",
       "      <td>0.113343</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1841</th>\n",
       "      <td>ieu-a-102</td>\n",
       "      <td>Waist circumference</td>\n",
       "      <td>60586.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>2013</td>\n",
       "      <td>Randall JC</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1131</td>\n",
       "      <td>32498.0</td>\n",
       "      <td>14910</td>\n",
       "      <td>2.013655e-05</td>\n",
       "      <td>-0.612456</td>\n",
       "      <td>0.143655</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1842 rows × 13 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     exposure.id          exposure.trait exposure.sample_size  \\\n",
       "0      ukb-a-320  Age at last live birth             123676.0   \n",
       "1      ukb-a-320  Age at last live birth             123676.0   \n",
       "2      ukb-a-320  Age at last live birth             123676.0   \n",
       "3      ukb-a-320  Age at last live birth             123676.0   \n",
       "4      ukb-a-320  Age at last live birth             123676.0   \n",
       "...          ...                     ...                  ...   \n",
       "1837    ieu-a-68     Waist circumference             134038.0   \n",
       "1838   ieu-a-102     Waist circumference              60586.0   \n",
       "1839    ieu-a-68     Waist circumference             134038.0   \n",
       "1840   ieu-a-103     Waist circumference              73137.0   \n",
       "1841   ieu-a-102     Waist circumference              60586.0   \n",
       "\n",
       "           exposure.sex  year      author consortium  outcome.id  \\\n",
       "0     Males and Females  2017       Neale  Neale Lab   ukb-a-519   \n",
       "1     Males and Females  2017       Neale  Neale Lab    ukb-a-55   \n",
       "2     Males and Females  2017       Neale  Neale Lab  ieu-a-1127   \n",
       "3     Males and Females  2017       Neale  Neale Lab  ieu-a-1132   \n",
       "4     Males and Females  2017       Neale  Neale Lab  ieu-a-1133   \n",
       "...                 ...   ...         ...        ...         ...   \n",
       "1837            Females  2015   Shungin D       None    ukb-a-55   \n",
       "1838              Males  2013  Randall JC       None    ukb-a-55   \n",
       "1839            Females  2015   Shungin D       None  ieu-a-1131   \n",
       "1840            Females  2013  Randall JC       None  ieu-a-1131   \n",
       "1841              Males  2013  Randall JC       None  ieu-a-1131   \n",
       "\n",
       "     outcome.sample_size  N_case       mr.pval      mr.b     mr.se  \n",
       "0               337199.0    5510  2.171147e-01 -0.004151  0.003363  \n",
       "1               337159.0    7480  5.719176e-06 -0.013066  0.002880  \n",
       "2               175475.0   69501  1.401091e-02 -0.390523  0.158944  \n",
       "3                83691.0   38197  1.002960e-02 -0.550637  0.213856  \n",
       "4                69970.0   27078  3.159866e-01 -0.248122  0.247444  \n",
       "...                  ...     ...           ...       ...       ...  \n",
       "1837            337159.0    7480  7.833466e-01  0.000920  0.003345  \n",
       "1838            337159.0    7480  1.080044e-07 -0.022054  0.004151  \n",
       "1839             32498.0   14910  2.952982e-01  0.177187  0.169303  \n",
       "1840             32498.0   14910  6.832442e-10 -0.699319  0.113343  \n",
       "1841             32498.0   14910  2.013655e-05 -0.612456  0.143655  \n",
       "\n",
       "[1842 rows x 13 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# now those traits that appered at least once in something at <1e05, \n",
    "# get MR results for those traits with all BC datasets\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id in {gwas_list} \n",
    "AND  exposure.id  in {exposure_list}\n",
    "with mr, exposure, outcome\n",
    "ORDER BY exposure.trait\n",
    "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, \n",
    "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
    "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, mr.pval, mr.b, mr.se\n",
    "\"\"\".format(gwas_list = all_bc_gwas,\n",
    "           exposure_list = list(set(df['exposure.id'])))\n",
    "df = query_to_df(session, query, True)\n",
    "\n",
    "\n",
    "#df.to_csv(\"query_results/bc_all_mr.tsv\", sep=\"\\t\", index=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Extract MR results for a list of exposure GWAS\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "WHERE outcome.id in ['ukb-a-519', 'ukb-a-55', 'ieu-a-1126', 'ieu-a-1127', 'ieu-a-1128', 'ieu-a-1129', 'ieu-a-1130', 'ieu-a-1132', 'ieu-a-1133', 'ieu-a-1135', 'ieu-a-1136', 'ieu-a-1131', 'ieu-a-1137', 'ieu-a-1134'] \n",
      "AND  exposure.id  in ['ukb-b-8764', 'ukb-b-7663', 'ukb-a-485', 'ukb-b-2115', 'ukb-b-13932', 'ukb-b-13184', 'ukb-a-483', 'ukb-a-482', 'ukb-a-487', 'ukb-a-512', 'ukb-b-15869', 'ukb-b-11495', 'ukb-b-8865', 'ukb-a-509', 'ukb-a-486', 'ukb-b-2346', 'ukb-b-7337', 'ukb-a-484', 'ukb-b-13702', 'ieu-a-1095', 'ieu-a-1004', 'ukb-b-4206', 'ukb-a-320', 'ukb-b-18541', 'ukb-a-317', 'ukb-b-1209', 'ukb-b-18105', 'ukb-b-17422', 'ukb-a-315', 'ukb-b-9547', 'ukb-b-12405', 'ukb-a-451', 'ukb-b-8727', 'ukb-b-4564', 'ukb-b-8080', 'ukb-a-322', 'ukb-b-9433', 'ukb-a-324', 'ukb-b-4193', 'ukb-b-3768', 'ukb-a-319', 'ukb-a-316', 'ukb-a-323', 'ukb-b-9509', 'ukb-b-16927', 'ukb-b-9487', 'ieu-a-29', 'ieu-a-27', 'ukb-b-13378', 'ieu-b-40', 'ieu-a-974', 'ukb-b-19953', 'ieu-a-1096', 'ukb-a-34', 'ukb-b-4650', 'ukb-a-35', 'ieu-a-1038', 'ieu-a-1035', 'ieu-a-87', 'ieu-a-97', 'ieu-a-1032', 'ieu-a-51', 'ieu-a-99', 'ukb-b-15590', 'ieu-a-57', 'ieu-a-101', 'ieu-a-90', 'ieu-a-91', 'ieu-a-92', 'ukb-b-16881', 'ukb-b-10787', 'ieu-a-103', 'ieu-a-63', 'ukb-b-9405', 'ieu-a-69', 'ieu-a-105', 'ieu-a-109', 'ieu-a-75', 'ieu-a-81', 'ieu-a-111', 'ukb-a-265', 'ukb-b-19393', 'ukb-a-266', 'ukb-b-13354']\n",
      "//AND mr.pval < 1e-05\n",
      "with mr, exposure, outcome\n",
      "ORDER BY exposure.trait\n",
      "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex,\n",
      "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, mr.pval, mr.b, mr.se\n",
      "        \n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.sample_size</th>\n",
       "      <th>exposure.sex</th>\n",
       "      <th>outcome.id</th>\n",
       "      <th>outcome.sample_size</th>\n",
       "      <th>N_case</th>\n",
       "      <th>mr.pval</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.se</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ukb-a-319</td>\n",
       "      <td>Age at first live birth</td>\n",
       "      <td>123846.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>337199.0</td>\n",
       "      <td>5510</td>\n",
       "      <td>0.558758</td>\n",
       "      <td>0.001719</td>\n",
       "      <td>0.002879</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ukb-a-319</td>\n",
       "      <td>Age at first live birth</td>\n",
       "      <td>123846.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ukb-a-55</td>\n",
       "      <td>337159.0</td>\n",
       "      <td>7480</td>\n",
       "      <td>0.816717</td>\n",
       "      <td>0.001187</td>\n",
       "      <td>0.005120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ukb-a-319</td>\n",
       "      <td>Age at first live birth</td>\n",
       "      <td>123846.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>228951.0</td>\n",
       "      <td>122977</td>\n",
       "      <td>0.013006</td>\n",
       "      <td>-0.262657</td>\n",
       "      <td>0.105756</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ukb-a-319</td>\n",
       "      <td>Age at first live birth</td>\n",
       "      <td>123846.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1127</td>\n",
       "      <td>175475.0</td>\n",
       "      <td>69501</td>\n",
       "      <td>0.789003</td>\n",
       "      <td>-0.034011</td>\n",
       "      <td>0.124982</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ukb-a-319</td>\n",
       "      <td>Age at first live birth</td>\n",
       "      <td>123846.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1128</td>\n",
       "      <td>127442.0</td>\n",
       "      <td>21468</td>\n",
       "      <td>0.618318</td>\n",
       "      <td>-0.171930</td>\n",
       "      <td>0.337429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>596</th>\n",
       "      <td>ukb-a-266</td>\n",
       "      <td>Whole body fat-free mass</td>\n",
       "      <td>331291.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1136</td>\n",
       "      <td>50225.0</td>\n",
       "      <td>7333</td>\n",
       "      <td>0.000697</td>\n",
       "      <td>-0.342825</td>\n",
       "      <td>0.100251</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>597</th>\n",
       "      <td>ukb-a-266</td>\n",
       "      <td>Whole body fat-free mass</td>\n",
       "      <td>331291.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1131</td>\n",
       "      <td>32498.0</td>\n",
       "      <td>14910</td>\n",
       "      <td>0.042964</td>\n",
       "      <td>-0.177672</td>\n",
       "      <td>0.087480</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>598</th>\n",
       "      <td>ukb-a-266</td>\n",
       "      <td>Whole body fat-free mass</td>\n",
       "      <td>331291.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1130</td>\n",
       "      <td>89677.0</td>\n",
       "      <td>46785</td>\n",
       "      <td>0.582227</td>\n",
       "      <td>0.038816</td>\n",
       "      <td>0.070557</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>599</th>\n",
       "      <td>ukb-a-266</td>\n",
       "      <td>Whole body fat-free mass</td>\n",
       "      <td>331291.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1132</td>\n",
       "      <td>83691.0</td>\n",
       "      <td>38197</td>\n",
       "      <td>0.862899</td>\n",
       "      <td>0.007952</td>\n",
       "      <td>0.046012</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>600</th>\n",
       "      <td>ukb-a-266</td>\n",
       "      <td>Whole body fat-free mass</td>\n",
       "      <td>331291.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1133</td>\n",
       "      <td>69970.0</td>\n",
       "      <td>27078</td>\n",
       "      <td>0.763215</td>\n",
       "      <td>-0.014564</td>\n",
       "      <td>0.048345</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>601 rows × 10 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    exposure.id            exposure.trait exposure.sample_size  \\\n",
       "0     ukb-a-319   Age at first live birth             123846.0   \n",
       "1     ukb-a-319   Age at first live birth             123846.0   \n",
       "2     ukb-a-319   Age at first live birth             123846.0   \n",
       "3     ukb-a-319   Age at first live birth             123846.0   \n",
       "4     ukb-a-319   Age at first live birth             123846.0   \n",
       "..          ...                       ...                  ...   \n",
       "596   ukb-a-266  Whole body fat-free mass             331291.0   \n",
       "597   ukb-a-266  Whole body fat-free mass             331291.0   \n",
       "598   ukb-a-266  Whole body fat-free mass             331291.0   \n",
       "599   ukb-a-266  Whole body fat-free mass             331291.0   \n",
       "600   ukb-a-266  Whole body fat-free mass             331291.0   \n",
       "\n",
       "          exposure.sex  outcome.id outcome.sample_size  N_case   mr.pval  \\\n",
       "0    Males and Females   ukb-a-519            337199.0    5510  0.558758   \n",
       "1    Males and Females    ukb-a-55            337159.0    7480  0.816717   \n",
       "2    Males and Females  ieu-a-1126            228951.0  122977  0.013006   \n",
       "3    Males and Females  ieu-a-1127            175475.0   69501  0.789003   \n",
       "4    Males and Females  ieu-a-1128            127442.0   21468  0.618318   \n",
       "..                 ...         ...                 ...     ...       ...   \n",
       "596  Males and Females  ieu-a-1136             50225.0    7333  0.000697   \n",
       "597  Males and Females  ieu-a-1131             32498.0   14910  0.042964   \n",
       "598  Males and Females  ieu-a-1130             89677.0   46785  0.582227   \n",
       "599  Males and Females  ieu-a-1132             83691.0   38197  0.862899   \n",
       "600  Males and Females  ieu-a-1133             69970.0   27078  0.763215   \n",
       "\n",
       "         mr.b     mr.se  \n",
       "0    0.001719  0.002879  \n",
       "1    0.001187  0.005120  \n",
       "2   -0.262657  0.105756  \n",
       "3   -0.034011  0.124982  \n",
       "4   -0.171930  0.337429  \n",
       "..        ...       ...  \n",
       "596 -0.342825  0.100251  \n",
       "597 -0.177672  0.087480  \n",
       "598  0.038816  0.070557  \n",
       "599  0.007952  0.046012  \n",
       "600 -0.014564  0.048345  \n",
       "\n",
       "[601 rows x 10 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# read list of exp gwas (EXTRACTED IN R)\n",
    "risk_factors = list(pd.read_csv(\"query_results/gwas_rf_list.txt\", sep = '\\t')['id'])\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id in {gwas_list_outcome} \n",
    "AND  exposure.id  in {gwas_list_exposure}\n",
    "//AND mr.pval < 1e-05\n",
    "with mr, exposure, outcome\n",
    "ORDER BY exposure.trait\n",
    "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex,\n",
    "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, mr.pval, mr.b, mr.se\n",
    "        \n",
    "\"\"\".format(gwas_list_outcome = all_bc_gwas,\n",
    "           gwas_list_exposure = risk_factors )\n",
    "df = query_to_df(session, query, True)\n",
    "\n",
    "\n",
    "df.to_csv(\"query_results/gwas_rf_bc_all_mr.tsv\", sep=\"\\t\", index=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Correlation "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (trait:Gwas)-[gen_cor:GEN_COR]-(assoc_trait:Gwas)\n",
      "where assoc_trait.id in ['ukb-a-519']\n",
      "match (trait:Gwas)-[mr:MR_EVE_MR]->(assoc_trait:Gwas)\n",
      "//where mr.pval < 1e-03\n",
      "return distinct trait.trait, trait.id, gen_cor.rg, assoc_trait.trait, assoc_trait.id, mr.b, mr.pval\n",
      "order by gen_cor.rg desc\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>trait.trait</th>\n",
       "      <th>trait.id</th>\n",
       "      <th>gen_cor.rg</th>\n",
       "      <th>assoc_trait.trait</th>\n",
       "      <th>assoc_trait.id</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.pval</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Number of self-reported cancers</td>\n",
       "      <td>ukb-a-21</td>\n",
       "      <td>0.8279</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>0.077594</td>\n",
       "      <td>1.850559e-02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Had other major operations</td>\n",
       "      <td>ukb-a-326</td>\n",
       "      <td>0.2660</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>0.026946</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Breastfed as a baby</td>\n",
       "      <td>ukb-a-33</td>\n",
       "      <td>0.2471</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.012162</td>\n",
       "      <td>5.060810e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Headaches for 3+ months</td>\n",
       "      <td>ukb-a-354</td>\n",
       "      <td>0.1980</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.017729</td>\n",
       "      <td>3.182665e-29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Qualifications: NVQ or HND or HNC or equivalent</td>\n",
       "      <td>ukb-a-402</td>\n",
       "      <td>0.1885</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>0.026366</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>260</th>\n",
       "      <td>Reason for glasses/contact lenses: For 'astigm...</td>\n",
       "      <td>ukb-a-422</td>\n",
       "      <td>-0.1279</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.077385</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>261</th>\n",
       "      <td>Diagnoses - main ICD10: I21 Acute myocardial i...</td>\n",
       "      <td>ukb-a-533</td>\n",
       "      <td>-0.1304</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.057651</td>\n",
       "      <td>5.647018e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>262</th>\n",
       "      <td>Number of days/week of vigorous physical activ...</td>\n",
       "      <td>ukb-a-511</td>\n",
       "      <td>-0.1306</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.006864</td>\n",
       "      <td>3.821609e-02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263</th>\n",
       "      <td>Mineral and other dietary supplements: None of...</td>\n",
       "      <td>ukb-a-493</td>\n",
       "      <td>-0.1405</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.014608</td>\n",
       "      <td>6.539805e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>264</th>\n",
       "      <td>Types of transport used (excluding work): Car/...</td>\n",
       "      <td>ukb-a-478</td>\n",
       "      <td>-0.1570</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.033081</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>265 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           trait.trait   trait.id  gen_cor.rg  \\\n",
       "0                      Number of self-reported cancers   ukb-a-21      0.8279   \n",
       "1                           Had other major operations  ukb-a-326      0.2660   \n",
       "2                                  Breastfed as a baby   ukb-a-33      0.2471   \n",
       "3                              Headaches for 3+ months  ukb-a-354      0.1980   \n",
       "4      Qualifications: NVQ or HND or HNC or equivalent  ukb-a-402      0.1885   \n",
       "..                                                 ...        ...         ...   \n",
       "260  Reason for glasses/contact lenses: For 'astigm...  ukb-a-422     -0.1279   \n",
       "261  Diagnoses - main ICD10: I21 Acute myocardial i...  ukb-a-533     -0.1304   \n",
       "262  Number of days/week of vigorous physical activ...  ukb-a-511     -0.1306   \n",
       "263  Mineral and other dietary supplements: None of...  ukb-a-493     -0.1405   \n",
       "264  Types of transport used (excluding work): Car/...  ukb-a-478     -0.1570   \n",
       "\n",
       "                                     assoc_trait.trait assoc_trait.id  \\\n",
       "0    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "1    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "2    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "3    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "4    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "..                                                 ...            ...   \n",
       "260  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "261  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "262  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "263  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "264  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "\n",
       "         mr.b       mr.pval  \n",
       "0    0.077594  1.850559e-02  \n",
       "1    0.026946  5.000000e-01  \n",
       "2   -0.012162  5.060810e-01  \n",
       "3   -0.017729  3.182665e-29  \n",
       "4    0.026366  5.000000e-01  \n",
       "..        ...           ...  \n",
       "260 -0.077385  5.000000e-01  \n",
       "261 -0.057651  5.647018e-01  \n",
       "262 -0.006864  3.821609e-02  \n",
       "263 -0.014608  6.539805e-01  \n",
       "264 -0.033081  5.000000e-01  \n",
       "\n",
       "[265 rows x 7 columns]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find which traits are highly correlated with UKB cancers\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (trait:Gwas)-[gen_cor:GEN_COR]-(assoc_trait:Gwas)\n",
    "where assoc_trait.id in ['ukb-a-519']\n",
    "match (trait:Gwas)-[mr:MR_EVE_MR]->(assoc_trait:Gwas)\n",
    "//where mr.pval < 1e-03\n",
    "return distinct trait.trait, trait.id, gen_cor.rg, assoc_trait.trait, assoc_trait.id, mr.b, mr.pval\n",
    "order by gen_cor.rg desc\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "df\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
