{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "14196\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "import json\n",
    "from environs import Env\n",
    "from graph_functions import query_to_df,start_graph_session, start_graph_session_crashdown\n",
    "from IPython.display import Image\n",
    "\n",
    "\n",
    "env = Env()\n",
    "#session = start_graph_session(env) \n",
    "session = start_graph_session_crashdown(env) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "### List of all breast-related GWAS"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (gwas:Gwas)\n",
      "where toLower(gwas.trait) contains \"breast\"\n",
      "and not(toLower(gwas.trait) contains \"baby\") \n",
      "and not(toLower(gwas.trait) contains \"mother\")\n",
      "and not(toLower(gwas.trait) contains \"sibling\")\n",
      "and not(toLower(gwas.trait) contains \"mammogram\")\n",
      "return distinct gwas.trait, gwas.id, gwas.sample_size as SampleSize,\n",
      "toInteger(gwas.ncase) as N_case, toInteger(gwas.ncontrol) as N_control, gwas.author, gwas.year, gwas.consortium\n",
      "order by SampleSize desc\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>gwas.trait</th>\n",
       "      <th>gwas.id</th>\n",
       "      <th>SampleSize</th>\n",
       "      <th>N_case</th>\n",
       "      <th>N_control</th>\n",
       "      <th>gwas.author</th>\n",
       "      <th>gwas.year</th>\n",
       "      <th>gwas.consortium</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Carcinoma in situ of breast</td>\n",
       "      <td>finn-a-CD2_INSITU_BREAST</td>\n",
       "      <td>None</td>\n",
       "      <td>377.0</td>\n",
       "      <td>96122.0</td>\n",
       "      <td>None</td>\n",
       "      <td>2020.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Benign neoplasm of breast (ICD C excluded)</td>\n",
       "      <td>finn-a-CD2_BENIGN_BREAST_EXALLC</td>\n",
       "      <td>None</td>\n",
       "      <td>941.0</td>\n",
       "      <td>86350.0</td>\n",
       "      <td>None</td>\n",
       "      <td>2020.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Carcinoma in situ of breast, intraductal</td>\n",
       "      <td>finn-a-CD2_INSITU_BREAST_INTRADUCTAL</td>\n",
       "      <td>None</td>\n",
       "      <td>334.0</td>\n",
       "      <td>53928.0</td>\n",
       "      <td>None</td>\n",
       "      <td>2020.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Carcinoma in situ of breast (ICD C excluded)</td>\n",
       "      <td>finn-a-CD2_INSITU_BREAST_EXALLC</td>\n",
       "      <td>None</td>\n",
       "      <td>377.0</td>\n",
       "      <td>87024.0</td>\n",
       "      <td>None</td>\n",
       "      <td>2020.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Benign neoplasm of breast</td>\n",
       "      <td>finn-a-CD2_BENIGN_BREAST</td>\n",
       "      <td>None</td>\n",
       "      <td>941.0</td>\n",
       "      <td>95558.0</td>\n",
       "      <td>None</td>\n",
       "      <td>2020.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60</th>\n",
       "      <td>ER- Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1166</td>\n",
       "      <td>21695.0</td>\n",
       "      <td>3611.0</td>\n",
       "      <td>18084.0</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>61</th>\n",
       "      <td>ER+ Breast cancer (Combined Oncoarray; iCOGS; ...</td>\n",
       "      <td>ieu-a-1127</td>\n",
       "      <td>175475.0</td>\n",
       "      <td>69501.0</td>\n",
       "      <td>105974.0</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>Breast cancer</td>\n",
       "      <td>ebi-a-GCST004988</td>\n",
       "      <td>139274.0</td>\n",
       "      <td>76192.0</td>\n",
       "      <td>63082.0</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>ER- Breast cancer (Combined Oncoarray; iCOGS; ...</td>\n",
       "      <td>ieu-a-1128</td>\n",
       "      <td>127442.0</td>\n",
       "      <td>21468.0</td>\n",
       "      <td>105974.0</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1129</td>\n",
       "      <td>106776.0</td>\n",
       "      <td>61282.0</td>\n",
       "      <td>45494.0</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>65 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           gwas.trait  \\\n",
       "0                         Carcinoma in situ of breast   \n",
       "1          Benign neoplasm of breast (ICD C excluded)   \n",
       "2            Carcinoma in situ of breast, intraductal   \n",
       "3        Carcinoma in situ of breast (ICD C excluded)   \n",
       "4                           Benign neoplasm of breast   \n",
       "..                                                ...   \n",
       "60                           ER- Breast cancer (GWAS)   \n",
       "61  ER+ Breast cancer (Combined Oncoarray; iCOGS; ...   \n",
       "62                                      Breast cancer   \n",
       "63  ER- Breast cancer (Combined Oncoarray; iCOGS; ...   \n",
       "64                          Breast cancer (Oncoarray)   \n",
       "\n",
       "                                 gwas.id SampleSize   N_case  N_control  \\\n",
       "0               finn-a-CD2_INSITU_BREAST       None    377.0    96122.0   \n",
       "1        finn-a-CD2_BENIGN_BREAST_EXALLC       None    941.0    86350.0   \n",
       "2   finn-a-CD2_INSITU_BREAST_INTRADUCTAL       None    334.0    53928.0   \n",
       "3        finn-a-CD2_INSITU_BREAST_EXALLC       None    377.0    87024.0   \n",
       "4               finn-a-CD2_BENIGN_BREAST       None    941.0    95558.0   \n",
       "..                                   ...        ...      ...        ...   \n",
       "60                            ieu-a-1166    21695.0   3611.0    18084.0   \n",
       "61                            ieu-a-1127   175475.0  69501.0   105974.0   \n",
       "62                      ebi-a-GCST004988   139274.0  76192.0    63082.0   \n",
       "63                            ieu-a-1128   127442.0  21468.0   105974.0   \n",
       "64                            ieu-a-1129   106776.0  61282.0    45494.0   \n",
       "\n",
       "      gwas.author gwas.year gwas.consortium  \n",
       "0            None    2020.0            None  \n",
       "1            None    2020.0            None  \n",
       "2            None    2020.0            None  \n",
       "3            None    2020.0            None  \n",
       "4            None    2020.0            None  \n",
       "..            ...       ...             ...  \n",
       "60  Michailidou K    2015.0            None  \n",
       "61  Michailidou K    2017.0            None  \n",
       "62  Michailidou K    2017.0            None  \n",
       "63  Michailidou K    2017.0            None  \n",
       "64  Michailidou K    2017.0            None  \n",
       "\n",
       "[65 rows x 8 columns]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (gwas:Gwas)\n",
    "where toLower(gwas.trait) contains \"breast\"\n",
    "and not(toLower(gwas.trait) contains \"baby\") \n",
    "and not(toLower(gwas.trait) contains \"mother\")\n",
    "and not(toLower(gwas.trait) contains \"sibling\")\n",
    "and not(toLower(gwas.trait) contains \"mammogram\")\n",
    "return distinct gwas.trait, gwas.id, gwas.sample_size as SampleSize,\n",
    "toInteger(gwas.ncase) as N_case, toInteger(gwas.ncontrol) as N_control, gwas.author, gwas.year, gwas.consortium\n",
    "order by SampleSize desc\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "#df.to_csv(\"query_results/bc_all_related_gwas.tsv\", sep=\"\\t\", index=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Get BC GWAS that have MR results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (gwas:Gwas)<-[mr:MR_EVE_MR]-(othergwas:Gwas)\n",
      "where toLower(gwas.trait) contains \"breast\"\n",
      "and not(toLower(gwas.trait) contains \"baby\") \n",
      "and not(toLower(gwas.trait) contains \"mother\")\n",
      "and not(toLower(gwas.trait) contains \"sibling\")\n",
      "and not(toLower(gwas.trait) contains \"mammogram\")\n",
      "and not(toLower(gwas.trait) contains \"protein\")\n",
      "return distinct gwas.trait, gwas.id, toInteger(gwas.sample_size) as SampleSize,\n",
      "toInteger(gwas.ncase) as N_case, toInteger(gwas.ncontrol) as N_control, gwas.author, gwas.year, gwas.consortium\n",
      "order by gwas.id,  gwas.author, N_case desc\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>gwas.trait</th>\n",
       "      <th>gwas.id</th>\n",
       "      <th>SampleSize</th>\n",
       "      <th>N_case</th>\n",
       "      <th>N_control</th>\n",
       "      <th>gwas.author</th>\n",
       "      <th>gwas.year</th>\n",
       "      <th>gwas.consortium</th>\n",
       "      <th>case_percent</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Breast cancer</td>\n",
       "      <td>ebi-a-GCST004988</td>\n",
       "      <td>139274</td>\n",
       "      <td>76192</td>\n",
       "      <td>63082</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>54.706550</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Breast cancer</td>\n",
       "      <td>ebi-a-GCST007236</td>\n",
       "      <td>89677</td>\n",
       "      <td>46785</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>52.170568</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Breast cancer (Combined Oncoarray; iCOGS; GWAS...</td>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>228951</td>\n",
       "      <td>122977</td>\n",
       "      <td>105974</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>53.713240</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ER+ Breast cancer (Combined Oncoarray; iCOGS; ...</td>\n",
       "      <td>ieu-a-1127</td>\n",
       "      <td>175475</td>\n",
       "      <td>69501</td>\n",
       "      <td>105974</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>39.607351</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ER- Breast cancer (Combined Oncoarray; iCOGS; ...</td>\n",
       "      <td>ieu-a-1128</td>\n",
       "      <td>127442</td>\n",
       "      <td>21468</td>\n",
       "      <td>105974</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>16.845310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1129</td>\n",
       "      <td>106776</td>\n",
       "      <td>61282</td>\n",
       "      <td>45494</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>57.393047</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1130</td>\n",
       "      <td>89677</td>\n",
       "      <td>46785</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>52.170568</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1131</td>\n",
       "      <td>32498</td>\n",
       "      <td>14910</td>\n",
       "      <td>17588</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>45.879746</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ER+ Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1132</td>\n",
       "      <td>83691</td>\n",
       "      <td>38197</td>\n",
       "      <td>45494</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>45.640511</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ER+ Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1133</td>\n",
       "      <td>69970</td>\n",
       "      <td>27078</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>38.699443</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>ER+ Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1134</td>\n",
       "      <td>21814</td>\n",
       "      <td>4226</td>\n",
       "      <td>17588</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>19.372880</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>ER- Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1135</td>\n",
       "      <td>55149</td>\n",
       "      <td>9655</td>\n",
       "      <td>45494</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>17.507117</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ER- Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1136</td>\n",
       "      <td>50225</td>\n",
       "      <td>7333</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>14.600299</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>ER- Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1137</td>\n",
       "      <td>22068</td>\n",
       "      <td>4480</td>\n",
       "      <td>17588</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>20.300888</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>ER- Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1160</td>\n",
       "      <td>50225</td>\n",
       "      <td>7333</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>14.600299</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>ER+ Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1161</td>\n",
       "      <td>69970</td>\n",
       "      <td>27078</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>38.699443</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1162</td>\n",
       "      <td>89677</td>\n",
       "      <td>46785</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>52.170568</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>ER- Breast cancer (Survival)</td>\n",
       "      <td>ieu-a-1163</td>\n",
       "      <td>6881</td>\n",
       "      <td>920</td>\n",
       "      <td>5961</td>\n",
       "      <td>Guo Q</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>13.370150</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>ER+ Breast cancer (Survival)</td>\n",
       "      <td>ieu-a-1164</td>\n",
       "      <td>23059</td>\n",
       "      <td>1333</td>\n",
       "      <td>21726</td>\n",
       "      <td>Guo Q</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>5.780823</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Breast cancer (Survival)</td>\n",
       "      <td>ieu-a-1165</td>\n",
       "      <td>37954</td>\n",
       "      <td>2900</td>\n",
       "      <td>35054</td>\n",
       "      <td>Guo Q</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>7.640828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>ER- Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1166</td>\n",
       "      <td>21695</td>\n",
       "      <td>3611</td>\n",
       "      <td>18084</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>16.644388</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>ER+ Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1167</td>\n",
       "      <td>22286</td>\n",
       "      <td>4202</td>\n",
       "      <td>18084</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>18.854886</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1168</td>\n",
       "      <td>33832</td>\n",
       "      <td>15748</td>\n",
       "      <td>18084</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>46.547647</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Cancer code  self-reported: breast cancer</td>\n",
       "      <td>ukb-a-55</td>\n",
       "      <td>337159</td>\n",
       "      <td>7480</td>\n",
       "      <td>329679</td>\n",
       "      <td>Neale</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>Neale Lab</td>\n",
       "      <td>2.218538</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Cancer code, self-reported: breast cancer</td>\n",
       "      <td>ukb-b-16890</td>\n",
       "      <td>462933</td>\n",
       "      <td>10303</td>\n",
       "      <td>452630</td>\n",
       "      <td>Ben Elsworth</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>MRC-IEU</td>\n",
       "      <td>2.225592</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>Malignant neoplasm of breast</td>\n",
       "      <td>ukb-d-C3_BREAST_3</td>\n",
       "      <td>361194</td>\n",
       "      <td>9721</td>\n",
       "      <td>351473</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>None</td>\n",
       "      <td>2.691351</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           gwas.trait            gwas.id  \\\n",
       "0                                       Breast cancer   ebi-a-GCST004988   \n",
       "1                                       Breast cancer   ebi-a-GCST007236   \n",
       "2   Breast cancer (Combined Oncoarray; iCOGS; GWAS...         ieu-a-1126   \n",
       "3   ER+ Breast cancer (Combined Oncoarray; iCOGS; ...         ieu-a-1127   \n",
       "4   ER- Breast cancer (Combined Oncoarray; iCOGS; ...         ieu-a-1128   \n",
       "5                           Breast cancer (Oncoarray)         ieu-a-1129   \n",
       "6                               Breast cancer (iCOGS)         ieu-a-1130   \n",
       "7                                Breast cancer (GWAS)         ieu-a-1131   \n",
       "8                       ER+ Breast cancer (Oncoarray)         ieu-a-1132   \n",
       "9                           ER+ Breast cancer (iCOGS)         ieu-a-1133   \n",
       "10                           ER+ Breast cancer (GWAS)         ieu-a-1134   \n",
       "11                      ER- Breast cancer (Oncoarray)         ieu-a-1135   \n",
       "12                          ER- Breast cancer (iCOGS)         ieu-a-1136   \n",
       "13                           ER- Breast cancer (GWAS)         ieu-a-1137   \n",
       "14                          ER- Breast cancer (iCOGS)         ieu-a-1160   \n",
       "15                          ER+ Breast cancer (iCOGS)         ieu-a-1161   \n",
       "16                              Breast cancer (iCOGS)         ieu-a-1162   \n",
       "17                       ER- Breast cancer (Survival)         ieu-a-1163   \n",
       "18                       ER+ Breast cancer (Survival)         ieu-a-1164   \n",
       "19                           Breast cancer (Survival)         ieu-a-1165   \n",
       "20                           ER- Breast cancer (GWAS)         ieu-a-1166   \n",
       "21                           ER+ Breast cancer (GWAS)         ieu-a-1167   \n",
       "22                               Breast cancer (GWAS)         ieu-a-1168   \n",
       "24          Cancer code  self-reported: breast cancer           ukb-a-55   \n",
       "30          Cancer code, self-reported: breast cancer        ukb-b-16890   \n",
       "47                       Malignant neoplasm of breast  ukb-d-C3_BREAST_3   \n",
       "\n",
       "    SampleSize  N_case  N_control    gwas.author gwas.year gwas.consortium  \\\n",
       "0       139274   76192      63082  Michailidou K    2017.0            None   \n",
       "1        89677   46785      42892  Michailidou K    2015.0            None   \n",
       "2       228951  122977     105974  Michailidou K    2017.0            None   \n",
       "3       175475   69501     105974  Michailidou K    2017.0            None   \n",
       "4       127442   21468     105974  Michailidou K    2017.0            None   \n",
       "5       106776   61282      45494  Michailidou K    2017.0            None   \n",
       "6        89677   46785      42892  Michailidou K    2017.0            None   \n",
       "7        32498   14910      17588  Michailidou K    2017.0            None   \n",
       "8        83691   38197      45494  Michailidou K    2017.0            None   \n",
       "9        69970   27078      42892  Michailidou K    2017.0            None   \n",
       "10       21814    4226      17588  Michailidou K    2017.0            None   \n",
       "11       55149    9655      45494  Michailidou K    2017.0            None   \n",
       "12       50225    7333      42892  Michailidou K    2017.0            None   \n",
       "13       22068    4480      17588  Michailidou K    2017.0            None   \n",
       "14       50225    7333      42892  Michailidou K    2015.0            None   \n",
       "15       69970   27078      42892  Michailidou K    2015.0            None   \n",
       "16       89677   46785      42892  Michailidou K    2015.0            None   \n",
       "17        6881     920       5961          Guo Q    2015.0            None   \n",
       "18       23059    1333      21726          Guo Q    2015.0            None   \n",
       "19       37954    2900      35054          Guo Q    2015.0            None   \n",
       "20       21695    3611      18084  Michailidou K    2015.0            None   \n",
       "21       22286    4202      18084  Michailidou K    2015.0            None   \n",
       "22       33832   15748      18084  Michailidou K    2015.0            None   \n",
       "24      337159    7480     329679          Neale    2017.0       Neale Lab   \n",
       "30      462933   10303     452630   Ben Elsworth    2018.0         MRC-IEU   \n",
       "47      361194    9721     351473      Neale lab    2018.0            None   \n",
       "\n",
       "    case_percent  \n",
       "0      54.706550  \n",
       "1      52.170568  \n",
       "2      53.713240  \n",
       "3      39.607351  \n",
       "4      16.845310  \n",
       "5      57.393047  \n",
       "6      52.170568  \n",
       "7      45.879746  \n",
       "8      45.640511  \n",
       "9      38.699443  \n",
       "10     19.372880  \n",
       "11     17.507117  \n",
       "12     14.600299  \n",
       "13     20.300888  \n",
       "14     14.600299  \n",
       "15     38.699443  \n",
       "16     52.170568  \n",
       "17     13.370150  \n",
       "18      5.780823  \n",
       "19      7.640828  \n",
       "20     16.644388  \n",
       "21     18.854886  \n",
       "22     46.547647  \n",
       "24      2.218538  \n",
       "30      2.225592  \n",
       "47      2.691351  "
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (gwas:Gwas)<-[mr:MR_EVE_MR]-(othergwas:Gwas)\n",
    "where toLower(gwas.trait) contains \"breast\"\n",
    "and not(toLower(gwas.trait) contains \"baby\") \n",
    "and not(toLower(gwas.trait) contains \"mother\")\n",
    "and not(toLower(gwas.trait) contains \"sibling\")\n",
    "and not(toLower(gwas.trait) contains \"mammogram\")\n",
    "and not(toLower(gwas.trait) contains \"protein\")\n",
    "return distinct gwas.trait, gwas.id, toInteger(gwas.sample_size) as SampleSize,\n",
    "toInteger(gwas.ncase) as N_case, toInteger(gwas.ncontrol) as N_control, gwas.author, gwas.year, gwas.consortium\n",
    "order by gwas.id,  gwas.author, N_case desc\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "#df.to_csv(\"query_results/bc_gwas_with_mr.tsv\", sep=\"\\t\", index=False)\n",
    "\n",
    "# calulate cases % in the dataset and only keep those >2%\n",
    "df['case_percent'] = df['N_case']/df['SampleSize']*100\n",
    "df = df[df['case_percent'] > 2]\n",
    "\n",
    "\n",
    "df.to_csv(\"query_results/bc_gwas_with_mr_keep.tsv\", sep=\"\\t\", index=False)\n",
    "all_bc_gwas = list(df['gwas.id'])\n",
    "df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['ebi-a-GCST004988',\n",
       " 'ieu-a-1126',\n",
       " 'ieu-a-1127',\n",
       " 'ieu-a-1128',\n",
       " 'ieu-a-1129',\n",
       " 'ieu-a-1130',\n",
       " 'ieu-a-1131',\n",
       " 'ieu-a-1132',\n",
       " 'ieu-a-1133',\n",
       " 'ieu-a-1134',\n",
       " 'ieu-a-1135',\n",
       " 'ieu-a-1136',\n",
       " 'ieu-a-1137',\n",
       " 'ieu-a-1160',\n",
       " 'ieu-a-1161',\n",
       " 'ieu-a-1162',\n",
       " 'ieu-a-1163',\n",
       " 'ieu-a-1164',\n",
       " 'ieu-a-1165',\n",
       " 'ieu-a-1166',\n",
       " 'ieu-a-1167',\n",
       " 'ieu-a-1168',\n",
       " 'ukb-a-55',\n",
       " 'ukb-b-16890',\n",
       " 'ukb-d-C3_BREAST_3']"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "all_bc_gwas \n",
    "# ebi-a-GCST007236 data is messed - exclude\n",
    "all_bc_gwas = all_bc_gwas.remove('ebi-a-GCST007236')\n",
    "all_bc_gwas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## MR data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "WHERE outcome.id = \"ieu-a-1126\"  \n",
      "AND (not (toLower(exposure.trait) contains 'breast')) \n",
      "AND mr.pval < 1e-08\n",
      "RETURN exposure {.id, .trait}, outcome.id, mr {.b, .pval, .method, .selection, .moescore} ORDER BY mr.pval\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>outcome.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.method</th>\n",
       "      <th>mr.selection</th>\n",
       "      <th>mr.pval</th>\n",
       "      <th>mr.moescore</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Ever addicted to alcohol</td>\n",
       "      <td>ukb-d-20406</td>\n",
       "      <td>-0.054825</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>0.000000e+00</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Diagnoses - secondary ICD10: K44.9 Diaphragmat...</td>\n",
       "      <td>ukb-b-3672</td>\n",
       "      <td>-1.542995</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>4.514856e-242</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Killer cell immunoglobulin-like receptor 2DL5A</td>\n",
       "      <td>prot-a-1644</td>\n",
       "      <td>0.016679</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>4.770365e-106</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Ever had hysterectomy (womb removed)</td>\n",
       "      <td>ukb-b-6445</td>\n",
       "      <td>-1.562231</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>9.686474e-86</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Operation code: bunion/hallus valgus surgery</td>\n",
       "      <td>ukb-b-9190</td>\n",
       "      <td>1.109370</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.334299e-85</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Vascular endothelial growth factor A, isoform 121</td>\n",
       "      <td>prot-a-3197</td>\n",
       "      <td>0.013410</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>7.992747e-83</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>fatty acid binding protein 4</td>\n",
       "      <td>prot-b-71</td>\n",
       "      <td>0.019159</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.571455e-58</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Diagnoses - secondary ICD10: Z92.1 Personal hi...</td>\n",
       "      <td>ukb-b-7352</td>\n",
       "      <td>-0.973106</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.267170e-57</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>CUB and zona pellucida-like domain-containing ...</td>\n",
       "      <td>prot-a-735</td>\n",
       "      <td>0.021479</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.941390e-37</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Filamin-A</td>\n",
       "      <td>prot-a-1117</td>\n",
       "      <td>-0.054938</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>9.719336e-26</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Alpha-L-iduronidase</td>\n",
       "      <td>prot-a-1411</td>\n",
       "      <td>0.022690</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>4.120827e-25</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Secretory phospholipase A2 receptor</td>\n",
       "      <td>prot-a-2291</td>\n",
       "      <td>0.014897</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>8.347529e-25</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>HDL cholesterol</td>\n",
       "      <td>ebi-a-GCST005058</td>\n",
       "      <td>0.058877</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.163784e-19</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>X-11440</td>\n",
       "      <td>met-a-513</td>\n",
       "      <td>-0.113873</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.321509e-19</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Childhood obesity</td>\n",
       "      <td>ieu-a-1096</td>\n",
       "      <td>-0.199101</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.726210e-18</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Falls in the last year</td>\n",
       "      <td>ukb-b-2535</td>\n",
       "      <td>1.278313</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.494507e-16</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Delta-like protein 1</td>\n",
       "      <td>prot-a-831</td>\n",
       "      <td>0.053920</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>6.557481e-16</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Cadherin-related family member 3</td>\n",
       "      <td>prot-a-488</td>\n",
       "      <td>-0.088639</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.358433e-15</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Completion status of test: Heart rate reached ...</td>\n",
       "      <td>ukb-d-6020_33</td>\n",
       "      <td>-0.653432</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.380744e-15</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Non-cancer illness code, self-reported: ankylo...</td>\n",
       "      <td>ukb-b-18194</td>\n",
       "      <td>1.662842</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.066378e-14</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Body mass index</td>\n",
       "      <td>ieu-a-974</td>\n",
       "      <td>-0.788037</td>\n",
       "      <td>FE Egger</td>\n",
       "      <td>HF</td>\n",
       "      <td>9.788118e-13</td>\n",
       "      <td>0.76</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Added milk to espresso</td>\n",
       "      <td>ukb-b-1004</td>\n",
       "      <td>0.867059</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.788631e-12</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Parental longevity (combined parental age at d...</td>\n",
       "      <td>ebi-a-GCST006702</td>\n",
       "      <td>0.526232</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>HF</td>\n",
       "      <td>2.541637e-11</td>\n",
       "      <td>0.73</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Tyrosine-protein kinase receptor Tie-1, soluble</td>\n",
       "      <td>prot-a-2978</td>\n",
       "      <td>-0.031356</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.783312e-11</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Xyloside xylosyltransferase 1</td>\n",
       "      <td>prot-a-3243</td>\n",
       "      <td>0.050365</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>5.800064e-11</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Hip circumference</td>\n",
       "      <td>ieu-a-99</td>\n",
       "      <td>-0.571581</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>6.247788e-11</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Maspardin</td>\n",
       "      <td>prot-a-2815</td>\n",
       "      <td>-0.016165</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.624044e-10</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>IDP dMRI TBSS ICVF Anterior limb of internal c...</td>\n",
       "      <td>ubm-a-501</td>\n",
       "      <td>0.058488</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.048454e-09</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>IDP dMRI ProbtrackX ISOVF slf r</td>\n",
       "      <td>ubm-a-866</td>\n",
       "      <td>-0.050763</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.597902e-09</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Calpastatin</td>\n",
       "      <td>prot-a-366</td>\n",
       "      <td>0.054911</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.406328e-09</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Types of physical activity in last 4 weeks: No...</td>\n",
       "      <td>ukb-a-483</td>\n",
       "      <td>3.564379</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>HF</td>\n",
       "      <td>4.223489e-09</td>\n",
       "      <td>0.71</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    outcome.id                                     exposure.trait  \\\n",
       "0   ieu-a-1126                           Ever addicted to alcohol   \n",
       "1   ieu-a-1126  Diagnoses - secondary ICD10: K44.9 Diaphragmat...   \n",
       "2   ieu-a-1126     Killer cell immunoglobulin-like receptor 2DL5A   \n",
       "3   ieu-a-1126               Ever had hysterectomy (womb removed)   \n",
       "4   ieu-a-1126       Operation code: bunion/hallus valgus surgery   \n",
       "5   ieu-a-1126  Vascular endothelial growth factor A, isoform 121   \n",
       "6   ieu-a-1126                       fatty acid binding protein 4   \n",
       "7   ieu-a-1126  Diagnoses - secondary ICD10: Z92.1 Personal hi...   \n",
       "8   ieu-a-1126  CUB and zona pellucida-like domain-containing ...   \n",
       "9   ieu-a-1126                                          Filamin-A   \n",
       "10  ieu-a-1126                                Alpha-L-iduronidase   \n",
       "11  ieu-a-1126                Secretory phospholipase A2 receptor   \n",
       "12  ieu-a-1126                                    HDL cholesterol   \n",
       "13  ieu-a-1126                                            X-11440   \n",
       "14  ieu-a-1126                                  Childhood obesity   \n",
       "15  ieu-a-1126                             Falls in the last year   \n",
       "16  ieu-a-1126                               Delta-like protein 1   \n",
       "17  ieu-a-1126                   Cadherin-related family member 3   \n",
       "18  ieu-a-1126  Completion status of test: Heart rate reached ...   \n",
       "19  ieu-a-1126  Non-cancer illness code, self-reported: ankylo...   \n",
       "20  ieu-a-1126                                    Body mass index   \n",
       "21  ieu-a-1126                             Added milk to espresso   \n",
       "22  ieu-a-1126  Parental longevity (combined parental age at d...   \n",
       "23  ieu-a-1126    Tyrosine-protein kinase receptor Tie-1, soluble   \n",
       "24  ieu-a-1126                      Xyloside xylosyltransferase 1   \n",
       "25  ieu-a-1126                                  Hip circumference   \n",
       "26  ieu-a-1126                                          Maspardin   \n",
       "27  ieu-a-1126  IDP dMRI TBSS ICVF Anterior limb of internal c...   \n",
       "28  ieu-a-1126                    IDP dMRI ProbtrackX ISOVF slf r   \n",
       "29  ieu-a-1126                                        Calpastatin   \n",
       "30  ieu-a-1126  Types of physical activity in last 4 weeks: No...   \n",
       "\n",
       "         exposure.id      mr.b mr.method mr.selection        mr.pval  \\\n",
       "0        ukb-d-20406 -0.054825    FE IVW           DF   0.000000e+00   \n",
       "1         ukb-b-3672 -1.542995    FE IVW           DF  4.514856e-242   \n",
       "2        prot-a-1644  0.016679    FE IVW           DF  4.770365e-106   \n",
       "3         ukb-b-6445 -1.562231    FE IVW           DF   9.686474e-86   \n",
       "4         ukb-b-9190  1.109370    FE IVW           DF   3.334299e-85   \n",
       "5        prot-a-3197  0.013410    FE IVW           DF   7.992747e-83   \n",
       "6          prot-b-71  0.019159    FE IVW           DF   1.571455e-58   \n",
       "7         ukb-b-7352 -0.973106    FE IVW           DF   1.267170e-57   \n",
       "8         prot-a-735  0.021479    FE IVW           DF   2.941390e-37   \n",
       "9        prot-a-1117 -0.054938    FE IVW           DF   9.719336e-26   \n",
       "10       prot-a-1411  0.022690    FE IVW           DF   4.120827e-25   \n",
       "11       prot-a-2291  0.014897    FE IVW           DF   8.347529e-25   \n",
       "12  ebi-a-GCST005058  0.058877    FE IVW           DF   1.163784e-19   \n",
       "13         met-a-513 -0.113873    FE IVW           DF   1.321509e-19   \n",
       "14        ieu-a-1096 -0.199101    FE IVW           DF   1.726210e-18   \n",
       "15        ukb-b-2535  1.278313    FE IVW           DF   3.494507e-16   \n",
       "16        prot-a-831  0.053920    FE IVW           DF   6.557481e-16   \n",
       "17        prot-a-488 -0.088639    FE IVW           DF   1.358433e-15   \n",
       "18     ukb-d-6020_33 -0.653432    FE IVW           DF   2.380744e-15   \n",
       "19       ukb-b-18194  1.662842    FE IVW           DF   2.066378e-14   \n",
       "20         ieu-a-974 -0.788037  FE Egger           HF   9.788118e-13   \n",
       "21        ukb-b-1004  0.867059    FE IVW           DF   3.788631e-12   \n",
       "22  ebi-a-GCST006702  0.526232    FE IVW           HF   2.541637e-11   \n",
       "23       prot-a-2978 -0.031356    FE IVW           DF   2.783312e-11   \n",
       "24       prot-a-3243  0.050365    FE IVW           DF   5.800064e-11   \n",
       "25          ieu-a-99 -0.571581    FE IVW           DF   6.247788e-11   \n",
       "26       prot-a-2815 -0.016165    FE IVW           DF   3.624044e-10   \n",
       "27         ubm-a-501  0.058488    FE IVW           DF   1.048454e-09   \n",
       "28         ubm-a-866 -0.050763    FE IVW           DF   2.597902e-09   \n",
       "29        prot-a-366  0.054911    FE IVW           DF   3.406328e-09   \n",
       "30         ukb-a-483  3.564379    FE IVW           HF   4.223489e-09   \n",
       "\n",
       "    mr.moescore  \n",
       "0          1.00  \n",
       "1          1.00  \n",
       "2          1.00  \n",
       "3          1.00  \n",
       "4          1.00  \n",
       "5          1.00  \n",
       "6          1.00  \n",
       "7          1.00  \n",
       "8          1.00  \n",
       "9          1.00  \n",
       "10         1.00  \n",
       "11         1.00  \n",
       "12         1.00  \n",
       "13         1.00  \n",
       "14         1.00  \n",
       "15         1.00  \n",
       "16         1.00  \n",
       "17         1.00  \n",
       "18         1.00  \n",
       "19         1.00  \n",
       "20         0.76  \n",
       "21         1.00  \n",
       "22         0.73  \n",
       "23         1.00  \n",
       "24         1.00  \n",
       "25         1.00  \n",
       "26         1.00  \n",
       "27         1.00  \n",
       "28         1.00  \n",
       "29         1.00  \n",
       "30         0.71  "
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# MR test\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id = \"ieu-a-1126\"  \n",
    "AND (not (toLower(exposure.trait) contains 'breast')) \n",
    "AND mr.pval < 1e-08\n",
    "RETURN exposure {.id, .trait}, outcome.id, mr {.b, .pval, .method, .selection, .moescore} ORDER BY mr.pval\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.sample_size</th>\n",
       "      <th>outcome_ids</th>\n",
       "      <th>MR_pvals</th>\n",
       "      <th>MR_beta</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ukb-b-323</td>\n",
       "      <td>Illnesses of father: Alzheimer's disease/dementia</td>\n",
       "      <td>399793.0</td>\n",
       "      <td>[ebi-a-GCST004988, ieu-a-1134, ieu-a-1132, ieu...</td>\n",
       "      <td>[0.0, 8.299326114712149e-72, 6.21025571093903e...</td>\n",
       "      <td>[-0.930140957122164, 1.69433355372966, -1.5471...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>prot-a-408</td>\n",
       "      <td>C-C motif chemokine 3-like 1</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>[ebi-a-GCST004988, ieu-a-1131, ieu-a-1132, ieu...</td>\n",
       "      <td>[0.0, 3.2070884984982397e-40, 3.42469470229177...</td>\n",
       "      <td>[0.0172084678909587, 0.0799171724311676, 0.032...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ukb-d-20406</td>\n",
       "      <td>Ever addicted to alcohol</td>\n",
       "      <td>6514.0</td>\n",
       "      <td>[ieu-a-1126, ieu-a-1129, ieu-a-1135, ieu-a-1128]</td>\n",
       "      <td>[0.0, 0.0, 1.6223370528108e-24, 1.258609479112...</td>\n",
       "      <td>[-0.0548245160306779, -0.113871869555218, -0.2...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ukb-b-9127</td>\n",
       "      <td>Illnesses of father: Chronic bronchitis/emphysema</td>\n",
       "      <td>402389.0</td>\n",
       "      <td>[ieu-a-1127, ukb-a-55]</td>\n",
       "      <td>[0.0, 1.7926793340262798e-06]</td>\n",
       "      <td>[0.972930597371652, -0.10197190771738099]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ukb-b-3672</td>\n",
       "      <td>Diagnoses - secondary ICD10: K44.9 Diaphragmat...</td>\n",
       "      <td>463010.0</td>\n",
       "      <td>[ieu-a-1127, ebi-a-GCST004988, ieu-a-1126]</td>\n",
       "      <td>[0.0, 4.5148556216074876e-242, 4.5148556216074...</td>\n",
       "      <td>[-0.295757932022385, -1.54299503737595, -1.542...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>751</th>\n",
       "      <td>met-a-359</td>\n",
       "      <td>Gamma-glutamylglutamine</td>\n",
       "      <td>7662.0</td>\n",
       "      <td>[ieu-a-1167]</td>\n",
       "      <td>[7.44948187880931e-06]</td>\n",
       "      <td>[-1.7471772915958101]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>752</th>\n",
       "      <td>ukb-b-19809</td>\n",
       "      <td>Fed-up feelings</td>\n",
       "      <td>453071.0</td>\n",
       "      <td>[ieu-a-1161]</td>\n",
       "      <td>[7.94247770454966e-06]</td>\n",
       "      <td>[1.2684340568579098]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>753</th>\n",
       "      <td>prot-a-821</td>\n",
       "      <td>Dickkopf-related protein 1</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>[ieu-a-1136]</td>\n",
       "      <td>[8.24099097862065e-06]</td>\n",
       "      <td>[0.0339189126254016]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>754</th>\n",
       "      <td>ukb-b-15782</td>\n",
       "      <td>logMAR, final (right)</td>\n",
       "      <td>101023.0</td>\n",
       "      <td>[ukb-a-55]</td>\n",
       "      <td>[8.52893962249346e-06]</td>\n",
       "      <td>[0.00588635442005368]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>755</th>\n",
       "      <td>ieu-a-812</td>\n",
       "      <td>Parkinson's disease</td>\n",
       "      <td>5691.0</td>\n",
       "      <td>[ebi-a-GCST004988, ieu-a-1126]</td>\n",
       "      <td>[8.649386368302789e-06, 8.649386368302789e-06]</td>\n",
       "      <td>[0.0588601942842277, 0.0588601942842277]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>756 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     exposure.id                                     exposure.trait  \\\n",
       "0      ukb-b-323  Illnesses of father: Alzheimer's disease/dementia   \n",
       "1     prot-a-408                       C-C motif chemokine 3-like 1   \n",
       "2    ukb-d-20406                           Ever addicted to alcohol   \n",
       "3     ukb-b-9127  Illnesses of father: Chronic bronchitis/emphysema   \n",
       "4     ukb-b-3672  Diagnoses - secondary ICD10: K44.9 Diaphragmat...   \n",
       "..           ...                                                ...   \n",
       "751    met-a-359                            Gamma-glutamylglutamine   \n",
       "752  ukb-b-19809                                    Fed-up feelings   \n",
       "753   prot-a-821                         Dickkopf-related protein 1   \n",
       "754  ukb-b-15782                              logMAR, final (right)   \n",
       "755    ieu-a-812                                Parkinson's disease   \n",
       "\n",
       "    exposure.sample_size                                        outcome_ids  \\\n",
       "0               399793.0  [ebi-a-GCST004988, ieu-a-1134, ieu-a-1132, ieu...   \n",
       "1                 3301.0  [ebi-a-GCST004988, ieu-a-1131, ieu-a-1132, ieu...   \n",
       "2                 6514.0   [ieu-a-1126, ieu-a-1129, ieu-a-1135, ieu-a-1128]   \n",
       "3               402389.0                             [ieu-a-1127, ukb-a-55]   \n",
       "4               463010.0         [ieu-a-1127, ebi-a-GCST004988, ieu-a-1126]   \n",
       "..                   ...                                                ...   \n",
       "751               7662.0                                       [ieu-a-1167]   \n",
       "752             453071.0                                       [ieu-a-1161]   \n",
       "753               3301.0                                       [ieu-a-1136]   \n",
       "754             101023.0                                         [ukb-a-55]   \n",
       "755               5691.0                     [ebi-a-GCST004988, ieu-a-1126]   \n",
       "\n",
       "                                              MR_pvals  \\\n",
       "0    [0.0, 8.299326114712149e-72, 6.21025571093903e...   \n",
       "1    [0.0, 3.2070884984982397e-40, 3.42469470229177...   \n",
       "2    [0.0, 0.0, 1.6223370528108e-24, 1.258609479112...   \n",
       "3                        [0.0, 1.7926793340262798e-06]   \n",
       "4    [0.0, 4.5148556216074876e-242, 4.5148556216074...   \n",
       "..                                                 ...   \n",
       "751                             [7.44948187880931e-06]   \n",
       "752                             [7.94247770454966e-06]   \n",
       "753                             [8.24099097862065e-06]   \n",
       "754                             [8.52893962249346e-06]   \n",
       "755     [8.649386368302789e-06, 8.649386368302789e-06]   \n",
       "\n",
       "                                               MR_beta  \n",
       "0    [-0.930140957122164, 1.69433355372966, -1.5471...  \n",
       "1    [0.0172084678909587, 0.0799171724311676, 0.032...  \n",
       "2    [-0.0548245160306779, -0.113871869555218, -0.2...  \n",
       "3            [0.972930597371652, -0.10197190771738099]  \n",
       "4    [-0.295757932022385, -1.54299503737595, -1.542...  \n",
       "..                                                 ...  \n",
       "751                              [-1.7471772915958101]  \n",
       "752                               [1.2684340568579098]  \n",
       "753                               [0.0339189126254016]  \n",
       "754                              [0.00588635442005368]  \n",
       "755           [0.0588601942842277, 0.0588601942842277]  \n",
       "\n",
       "[756 rows x 6 columns]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# MR\n",
    "# get traits that have pval < 1e-05\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id in {gwas_list} \n",
    "AND  not exposure.id  in {gwas_list}\n",
    "//AND (not (toLower(exposure.trait) contains 'breast')) \n",
    "AND mr.pval < 1e-05\n",
    "with mr, exposure, outcome\n",
    "ORDER BY mr.pval \n",
    "RETURN exposure.id, exposure.trait, exposure.sample_size,\n",
    "        collect(outcome.id) as outcome_ids, \n",
    "        collect(mr.pval) as MR_pvals, collect(mr.b) as MR_beta\n",
    "        \n",
    "\"\"\".format(gwas_list = all_bc_gwas)\n",
    "df = query_to_df(session, query, False)\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "WHERE outcome.id in ['ebi-a-GCST004988', 'ieu-a-1126', 'ieu-a-1127', 'ieu-a-1128', 'ieu-a-1129', 'ieu-a-1130', 'ieu-a-1131', 'ieu-a-1132', 'ieu-a-1133', 'ieu-a-1134', 'ieu-a-1135', 'ieu-a-1136', 'ieu-a-1137', 'ieu-a-1160', 'ieu-a-1161', 'ieu-a-1162', 'ieu-a-1163', 'ieu-a-1164', 'ieu-a-1165', 'ieu-a-1166', 'ieu-a-1167', 'ieu-a-1168', 'ukb-a-55', 'ukb-b-16890', 'ukb-d-C3_BREAST_3'] \n",
      "AND  exposure.id  in ['ukb-b-11158', 'prot-a-1713', 'prot-a-1537', 'prot-a-37', 'prot-a-1117', 'ubm-a-2737', 'prot-a-821', 'ukb-d-M13_POLYARTHROPATHIES', 'ebi-a-GCST004634', 'ebi-a-GCST004618', 'prot-a-1842', 'prot-a-1378', 'prot-a-2820', 'prot-a-1049', 'met-a-636', 'ukb-d-5012', 'prot-a-1576', 'ukb-b-17616', 'prot-a-1305', 'ebi-a-GCST005058', 'ubm-a-285', 'ubm-a-499', 'prot-a-1332', 'prot-a-3243', 'prot-a-521', 'ukb-b-4522', 'prot-a-627', 'prot-a-1395', 'ukb-a-459', 'prot-a-402', 'prot-a-1835', 'prot-a-1779', 'prot-a-545', 'ieu-a-974', 'ubm-a-496', 'ieu-a-812', 'ebi-a-GCST004939', 'prot-a-2025', 'met-c-840', 'ebi-a-GCST005569', 'met-c-855', 'ubm-a-2649', 'ukb-b-7137', 'ieu-a-1034', 'prot-a-2875', 'ukb-d-ULCERNAS', 'ieu-a-1283', 'ukb-b-5213', 'prot-a-2930', 'ieu-a-298', 'ieu-a-55', 'met-c-874', 'prot-a-1276', 'ukb-b-10827', 'ebi-a-GCST004623', 'ukb-b-1004', 'met-a-667', 'prot-a-2685', 'ieu-a-980', 'ukb-d-C_PRIMARY_LYMPHOID_HEMATOPOIETIC', 'prot-a-1298', 'prot-a-1833', 'prot-a-613', 'prot-a-2944', 'prot-a-488', 'ieu-a-1049', 'ukb-a-485', 'prot-a-543', 'ukb-a-269', 'ebi-a-GCST006702', 'met-a-383', 'ubm-a-913', 'prot-a-674', 'ukb-b-469', 'met-a-500', 'prot-a-953', 'prot-a-390', 'ukb-a-24', 'prot-a-3258', 'prot-a-3216', 'ukb-b-17918', 'prot-a-518', 'ukb-b-19732', 'ukb-b-4943', 'prot-a-2629', 'ukb-a-342', 'prot-a-1126', 'prot-a-1443', 'ieu-a-91', 'prot-a-2087', 'prot-a-1486', 'ukb-b-3376', 'ukb-b-589', 'ukb-a-91', 'ukb-b-7910', 'ukb-b-6445', 'met-a-616', 'ukb-b-15782', 'ieu-a-1051', 'ubm-a-840', 'ukb-b-4643', 'prot-a-1389', 'prot-a-2427', 'ubm-a-495', 'met-a-485', 'prot-a-408', 'ukb-b-12039', 'ukb-b-16027', 'ieu-a-976', 'ukb-b-698', 'ebi-a-GCST004075', 'ukb-b-8755', 'met-c-898', 'ukb-b-16886', 'ukb-a-357', 'prot-a-1045', 'ukb-a-585', 'ieu-a-792', 'ubm-a-135', 'ubm-a-866', 'ubm-a-511', 'ubm-a-470', 'ebi-a-GCST005180', 'prot-a-1046', 'ubm-a-711', 'ukb-a-75', 'ukb-b-11856', 'ubm-a-408', 'met-c-901', 'prot-a-1258', 'prot-a-1005', 'ebi-a-GCST004439', 'prot-a-570', 'ukb-d-6020_33', 'prot-a-977', 'ukb-d-G6_NERPLEX', 'ieu-a-833', 'prot-a-486', 'ukb-b-3599', 'ukb-a-426', 'ukb-b-6811', 'ukb-a-132', 'ukb-d-II_NEOPLASM', 'ukb-b-703', 'ukb-a-574', 'ukb-b-16858', 'ukb-b-11064', 'prot-a-67', 'ukb-a-52', 'ebi-a-GCST005522', 'prot-a-1995', 'ukb-b-323', 'ukb-b-18377', 'met-c-890', 'ukb-b-282', 'prot-a-2902', 'prot-a-1644', 'ubm-a-643', 'prot-a-3137', 'prot-a-1038', 'ieu-a-1007', 'ubm-a-561', 'ukb-a-401', 'ubm-a-424', 'ukb-b-18240', 'ukb-b-10415', 'ukb-b-5476', 'ukb-b-16866', 'ukb-a-423', 'prot-a-2247', 'prot-a-1207', 'ebi-a-GCST005840', 'ukb-a-452', 'met-a-513', 'prot-a-2205', 'ukb-a-427', 'prot-a-2071', 'ukb-b-19520', 'prot-a-3076', 'ukb-b-17868', 'prot-a-831', 'ukb-b-16019', 'ukb-b-12493', 'prot-a-2440', 'ukb-b-13500', 'prot-b-38', 'prot-a-2245', 'ubm-a-148', 'prot-a-3267', 'prot-a-3109', 'ukb-d-20500', 'ieu-a-836', 'ieu-a-99', 'prot-a-2978', 'prot-a-2357', 'ukb-b-9038', 'met-a-542', 'ubm-a-669', 'prot-a-982', 'ukb-a-11', 'met-c-944', 'ukb-b-14360', 'prot-a-305', 'met-c-947', 'ubm-a-373', 'prot-a-714', 'ukb-b-16855', 'prot-a-1530', 'prot-a-1606', 'prot-a-10', 'ukb-b-10559', 'ukb-d-1418_3', 'prot-a-1386', 'ieu-a-68', 'ebi-a-GCST006941', 'prot-a-398', 'ieu-a-1013', 'ukb-d-XI_DIGESTIVE', 'ukb-b-2953', 'met-a-558', 'ukb-d-30730_irnt', 'prot-a-1659', 'ukb-b-8072', 'prot-a-2720', 'ebi-a-GCST004422', 'prot-a-2043', 'ubm-a-476', 'ubm-a-791', 'prot-a-2269', 'met-a-661', 'ukb-b-3666', 'ukb-a-373', 'prot-a-3254', 'prot-a-648', 'ukb-b-19579', 'ukb-b-3793', 'ukb-b-18162', 'ukb-d-D17', 'ubm-a-2644', 'ebi-a-GCST001969', 'ubm-a-800', 'ubm-a-165', 'ukb-a-217', 'ieu-a-1050', 'ieu-a-76', 'prot-a-2291', 'prot-a-878', 'ukb-b-18799', 'prot-a-1950', 'prot-a-181', 'prot-a-2189', 'prot-a-2215', 'prot-a-2008', 'ukb-d-H40', 'ubm-a-413', 'ukb-b-14521', 'prot-a-655', 'ukb-b-14080', 'prot-a-1898', 'ukb-b-4650', 'ukb-a-421', 'prot-a-550', 'prot-a-135', 'ukb-d-20553_5', 'ukb-b-2535', 'prot-a-2396', 'prot-a-2392', 'ukb-a-483', 'ubm-a-660', 'prot-a-2082', 'ukb-d-VII_EYE_ADNEXA', 'ukb-b-7043', 'ubm-a-670', 'ukb-b-12018', 'prot-a-3028', 'ukb-a-210', 'prot-a-99', 'prot-a-2337', 'ukb-a-94', 'prot-a-2350', 'ukb-b-4077', 'ebi-a-GCST005920', 'ukb-b-7859', 'prot-a-334', 'prot-a-2926', 'prot-a-2039', 'prot-a-524', 'ukb-b-5445', 'prot-a-2729', 'prot-b-50', 'ukb-a-6', 'ubm-a-327', 'ukb-b-4711', 'prot-a-96', 'ukb-b-9592', 'ieu-a-1088', 'ukb-b-3672', 'prot-a-2211', 'prot-a-366', 'prot-a-540', 'ukb-b-8668', 'ukb-b-9093', 'ukb-a-236', 'ieu-a-1123', 'ieu-a-1052', 'ukb-b-10505', 'ubm-a-613', 'prot-a-1741', 'prot-a-1075', 'prot-a-612', 'prot-a-867', 'ukb-b-17422', 'prot-a-2891', 'ukb-a-204', 'prot-a-2575', 'prot-a-586', 'prot-a-1397', 'ieu-a-803', 'ukb-b-11075', 'ubm-a-2667', 'prot-a-2795', 'ubm-a-916', 'prot-a-280', 'ukb-a-14', 'ieu-a-783', 'prot-a-532', 'prot-a-392', 'ubm-a-809', 'ieu-a-1228', 'ubm-a-215', 'met-c-911', 'ukb-b-6848', 'ukb-b-14147', 'met-c-887', 'ukb-d-5540_0', 'prot-a-1695', 'ukb-a-428', 'ukb-b-10181', 'prot-a-314', 'prot-a-706', 'ukb-b-8846', 'ieu-a-111', 'ebi-a-GCST005528', 'ukb-d-30760_irnt', 'ukb-b-1572', 'prot-a-2824', 'ukb-b-16399', 'prot-a-1074', 'ukb-b-16881', 'prot-a-1867', 'prot-a-1879', 'ukb-b-17788', 'ukb-a-213', 'ieu-a-1015', 'ukb-a-223', 'prot-a-3197', 'ukb-b-5593', 'ukb-b-5421', 'ukb-a-528', 'prot-a-83', 'prot-a-2351', 'prot-a-988', 'ukb-b-998', 'ukb-d-H33', 'prot-a-2900', 'ukb-b-11535', 'prot-a-2665', 'ubm-a-144', 'ubm-a-510', 'ebi-a-GCST002318', 'ieu-a-1024', 'ebi-a-GCST002223', 'prot-a-1792', 'ubm-a-514', 'ukb-b-18366', 'prot-a-1153', 'prot-a-2991', 'met-c-919', 'prot-b-55', 'prot-a-1414', 'ukb-d-1418_1', 'prot-a-197', 'prot-a-2493', 'prot-a-971', 'prot-a-381', 'prot-a-1724', 'met-a-316', 'prot-a-2301', 'prot-a-2701', 'prot-a-2324', 'ukb-b-15748', 'ubm-a-3143', 'prot-a-690', 'ukb-a-72', 'met-a-444', 'ukb-a-325', 'ukb-a-150', 'ubm-a-668', 'prot-a-1586', 'ukb-b-15555', 'ubm-a-500', 'prot-a-1051', 'prot-a-2748', 'prot-a-1639', 'prot-a-420', 'ukb-b-15592', 'prot-a-1991', 'ukb-b-4801', 'ieu-a-64', 'prot-a-1657', 'ukb-a-418', 'ukb-b-15787', 'ukb-b-4955', 'prot-a-2733', 'ebi-a-GCST006698', 'ubm-a-29', 'ukb-d-XVIII_MISCFINDINGS', 'ukb-a-211', 'prot-a-1403', 'ukb-b-8133', 'prot-a-892', 'ukb-b-13251', 'prot-a-2222', 'prot-a-2470', 'ukb-b-660', 'ukb-a-487', 'ubm-a-735', 'ubm-a-11', 'prot-a-2878', 'ieu-a-90', 'prot-a-1411', 'ubm-a-723', 'ubm-a-200', 'prot-a-3009', 'ukb-b-6500', 'prot-a-805', 'ebi-a-GCST003839', 'ukb-a-34', 'met-c-864', 'ukb-d-C67', 'prot-a-983', 'ukb-d-20117_2', 'ukb-b-1744', 'prot-a-1782', 'prot-a-2341', 'ukb-b-143', 'ukb-d-22617_9149', 'ukb-b-19060', 'ukb-d-1468_5', 'ukb-b-14310', 'ubm-a-667', 'ukb-a-176', 'ukb-a-117', 'ubm-a-271', 'met-a-578', 'prot-a-1129', 'met-c-900', 'ukb-d-5327_0', 'prot-a-1800', 'met-a-618', 'ukb-a-222', 'ukb-a-343', 'ukb-b-20379', 'ukb-a-552', 'ukb-b-7352', 'met-a-519', 'ubm-a-410', 'prot-a-1154', 'ukb-b-10454', 'ubm-a-790', 'prot-a-399', 'prot-a-608', 'ukb-a-475', 'ukb-d-1508_2', 'met-a-629', 'prot-a-1930', 'prot-a-1347', 'prot-a-1746', 'ukb-b-15169', 'ukb-d-K11_OTHDIG', 'ukb-b-7872', 'prot-a-629', 'ukb-a-60', 'ubm-a-3142', 'ukb-b-9125', 'prot-a-1906', 'ubm-a-412', 'ukb-b-1511', 'ukb-b-17601', 'ukb-b-748', 'ebi-a-GCST005838', 'ukb-b-10003', 'prot-a-609', 'prot-a-2743', 'ieu-a-970', 'ebi-a-GCST006366', 'met-a-682', 'prot-a-1885', 'prot-a-354', 'met-a-683', 'ukb-b-9508', 'prot-a-599', 'prot-a-322', 'ukb-b-11207', 'prot-a-972', 'prot-a-475', 'prot-a-1317', 'prot-a-2362', 'ubm-a-550', 'prot-a-1166', 'ukb-b-8865', 'prot-a-1250', 'ieu-a-755', 'prot-a-1511', 'prot-a-888', 'prot-a-216', 'ukb-d-30630_irnt', 'ukb-b-16698', 'prot-a-2166', 'prot-a-3205', 'prot-a-1921', 'ukb-b-9207', 'met-c-923', 'ukb-a-320', 'met-c-912', 'ukb-a-23', 'prot-a-643', 'prot-a-1917', 'ukb-b-10859', 'prot-a-1202', 'ubm-a-651', 'prot-a-1500', 'ieu-a-1096', 'ukb-a-103', 'prot-a-3090', 'prot-a-3214', 'prot-a-2892', 'ukb-a-46', 'ubm-a-278', 'met-c-866', 'ukb-b-9190', 'ukb-b-13348', 'ukb-b-9961', 'prot-a-500', 'ieu-a-93', 'ukb-a-30', 'ukb-a-254', 'ukb-b-14067', 'prot-a-2739', 'prot-a-3180', 'ebi-a-GCST005843', 'ukb-d-20406', 'prot-a-2561', 'ebi-a-GCST005067', 'prot-a-1445', 'ukb-b-15445', 'met-c-914', 'ubm-a-533', 'ebi-a-GCST006906', 'prot-a-1863', 'ukb-b-8778', 'ukb-b-15590', 'ieu-a-101', 'prot-a-995', 'prot-a-1288', 'ukb-a-313', 'ukb-b-16606', 'ukb-b-4414', 'ukb-d-J45', 'ukb-b-7376', 'prot-a-527', 'prot-a-2557', 'prot-a-1739', 'ukb-b-19809', 'prot-a-2398', 'prot-a-220', 'prot-a-654', 'prot-a-310', 'ubm-a-481', 'ukb-b-1553', 'met-a-652', 'prot-a-1313', 'ebi-a-GCST004631', 'prot-a-1645', 'ieu-a-85', 'ubm-a-659', 'prot-a-2308', 'ieu-a-837', 'ukb-a-328', 'ubm-a-724', 'ubm-a-248', 'ubm-a-501', 'ebi-a-GCST003770', 'met-a-517', 'ukb-b-2732', 'prot-a-2573', 'ukb-a-195', 'prot-a-710', 'ebi-a-GCST000679', 'ukb-b-2221', 'ukb-d-30630_raw', 'prot-a-2889', 'ukb-a-449', 'prot-a-1148', 'prot-a-1097', 'ubm-a-131', 'ukb-b-9127', 'prot-a-412', 'ukb-b-16217', 'ubm-a-798', 'prot-a-2432', 'ubm-a-2656', 'ieu-a-1056', 'prot-a-857', 'prot-a-2007', 'ukb-b-12209', 'ukb-b-17241', 'prot-a-1506', 'ieu-a-999', 'ukb-b-19379', 'prot-a-2464', 'ubm-a-130', 'prot-b-71', 'prot-a-932', 'met-a-427', 'prot-a-3000', 'ukb-a-572', 'prot-a-213', 'ebi-a-GCST006368', 'prot-a-2139', 'ieu-a-44', 'prot-a-419', 'ukb-a-324', 'ukb-d-C3_PRIMARY_LYMPHOID_HEMATOPOIETIC', 'ukb-d-680_1', 'ukb-b-13354', 'prot-a-1006', 'met-c-876', 'ubm-a-415', 'ukb-b-16812', 'met-c-957', 'prot-a-1707', 'ukb-b-1707', 'ukb-b-13978', 'ukb-b-2183', 'ubm-a-806', 'ebi-a-GCST004575', 'ukb-a-491', 'prot-a-2920', 'ukb-b-6306', 'prot-a-2815', 'ukb-b-15491', 'ukb-b-3304', 'met-a-573', 'ieu-a-62', 'ukb-d-22601_35423237', 'ukb-a-393', 'ukb-b-14713', 'prot-a-426', 'met-a-304', 'prot-a-2361', 'ukb-a-273', 'ukb-b-5237', 'ubm-a-516', 'prot-a-3200', 'ubm-a-929', 'ebi-a-GCST004604', 'ebi-a-GCST003435', 'prot-a-3193', 'ukb-a-295', 'met-a-359', 'prot-a-2329', 'ukb-b-13392', 'ukb-a-243', 'ukb-b-9571', 'met-c-897', 'prot-a-1858', 'met-c-946', 'prot-a-2666', 'ukb-b-17885', 'ukb-d-K63', 'ukb-d-IV_ENDOCRIN_NUTRIT', 'ukb-b-15784', 'prot-a-2129', 'ukb-b-6218', 'ukb-b-18336', 'prot-a-1369', 'ukb-d-30760_raw', 'ebi-a-GCST004296', 'prot-a-2101', 'ukb-a-205', 'prot-a-836', 'prot-a-201', 'ukb-a-316', 'ukb-b-15695', 'met-c-902', 'prot-a-1610', 'ukb-d-1538_2', 'prot-a-2018', 'met-c-932', 'ubm-a-392', 'prot-a-346', 'ukb-d-30500_irnt', 'prot-a-456', 'ukb-b-11189', 'ubm-a-466', 'ubm-a-517', 'ukb-d-R79', 'prot-a-2760', 'ukb-a-58', 'prot-a-2356', 'met-c-953', 'ubm-a-498', 'ukb-b-8297', 'ukb-a-153', 'ukb-b-16677', 'prot-a-2462', 'ukb-b-12722', 'ukb-b-5716', 'ubm-a-230', 'ukb-a-454', 'prot-a-212', 'prot-a-2813', 'prot-a-1655', 'prot-a-1696', 'ebi-a-GCST004901', 'prot-a-566', 'ukb-b-18436', 'prot-a-1541', 'prot-b-21', 'ebi-a-GCST005327', 'ubm-a-751', 'prot-a-2030', 'ukb-b-13932', 'ukb-b-18194', 'prot-a-32', 'ukb-b-11971', 'ieu-a-834', 'prot-a-319', 'met-a-656', 'prot-a-2690', 'ukb-b-15918', 'ukb-d-22506_114', 'ukb-b-8909', 'ukb-d-41231_1', 'ebi-a-GCST001198', 'prot-a-1072', 'ukb-a-521', 'prot-a-1742', 'ebi-a-GCST004430', 'prot-a-989', 'prot-a-1299', 'met-a-362', 'met-a-495', 'prot-a-735', 'ukb-b-18994']\n",
      "with mr, exposure, outcome\n",
      "ORDER BY exposure.trait\n",
      "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, exposure.note,\n",
      "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
      "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, outcome.year, outcome.nsnp,\n",
      "        mr.pval, mr.b, mr.se, mr.method, mr.moescore\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.sample_size</th>\n",
       "      <th>exposure.sex</th>\n",
       "      <th>exposure.note</th>\n",
       "      <th>year</th>\n",
       "      <th>author</th>\n",
       "      <th>consortium</th>\n",
       "      <th>outcome.id</th>\n",
       "      <th>outcome.sample_size</th>\n",
       "      <th>N_case</th>\n",
       "      <th>outcome.year</th>\n",
       "      <th>outcome.nsnp</th>\n",
       "      <th>mr.pval</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.se</th>\n",
       "      <th>mr.method</th>\n",
       "      <th>mr.moescore</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1165</td>\n",
       "      <td>37954.0</td>\n",
       "      <td>2900</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>12940150</td>\n",
       "      <td>5.000000e-01</td>\n",
       "      <td>0.124119</td>\n",
       "      <td>0.124119</td>\n",
       "      <td>Wald ratio</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1127</td>\n",
       "      <td>175475.0</td>\n",
       "      <td>69501</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>1.276179e-02</td>\n",
       "      <td>-4.294414</td>\n",
       "      <td>1.724423</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1128</td>\n",
       "      <td>127442.0</td>\n",
       "      <td>21468</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>7.809079e-01</td>\n",
       "      <td>0.885429</td>\n",
       "      <td>3.183436</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ukb-a-55</td>\n",
       "      <td>337159.0</td>\n",
       "      <td>7480</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10894596</td>\n",
       "      <td>5.696885e-01</td>\n",
       "      <td>-0.030093</td>\n",
       "      <td>0.052933</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>228951.0</td>\n",
       "      <td>122977</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>1.922541e-01</td>\n",
       "      <td>-2.230371</td>\n",
       "      <td>1.710487</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17242</th>\n",
       "      <td>ubm-a-2656</td>\n",
       "      <td>volume Left-Lateral-Ventricle</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1131</td>\n",
       "      <td>32498.0</td>\n",
       "      <td>14910</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>7.068205e-01</td>\n",
       "      <td>-0.059728</td>\n",
       "      <td>0.158796</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17243</th>\n",
       "      <td>ubm-a-2656</td>\n",
       "      <td>volume Left-Lateral-Ventricle</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1136</td>\n",
       "      <td>50225.0</td>\n",
       "      <td>7333</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>7.062982e-02</td>\n",
       "      <td>0.379227</td>\n",
       "      <td>0.209767</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17244</th>\n",
       "      <td>ubm-a-2656</td>\n",
       "      <td>volume Left-Lateral-Ventricle</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1129</td>\n",
       "      <td>106776.0</td>\n",
       "      <td>61282</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>1.285261e-90</td>\n",
       "      <td>-0.158745</td>\n",
       "      <td>0.007864</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17245</th>\n",
       "      <td>ubm-a-2656</td>\n",
       "      <td>volume Left-Lateral-Ventricle</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1130</td>\n",
       "      <td>89677.0</td>\n",
       "      <td>46785</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>1.543810e-02</td>\n",
       "      <td>0.108434</td>\n",
       "      <td>0.044772</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17246</th>\n",
       "      <td>ubm-a-2656</td>\n",
       "      <td>volume Left-Lateral-Ventricle</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1137</td>\n",
       "      <td>22068.0</td>\n",
       "      <td>4480</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>9.580698e-01</td>\n",
       "      <td>-0.012862</td>\n",
       "      <td>0.244630</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>17247 rows × 18 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                       exposure.id                 exposure.trait  \\\n",
       "0      ukb-d-M13_POLYARTHROPATHIES             #Polyarthropathies   \n",
       "1      ukb-d-M13_POLYARTHROPATHIES             #Polyarthropathies   \n",
       "2      ukb-d-M13_POLYARTHROPATHIES             #Polyarthropathies   \n",
       "3      ukb-d-M13_POLYARTHROPATHIES             #Polyarthropathies   \n",
       "4      ukb-d-M13_POLYARTHROPATHIES             #Polyarthropathies   \n",
       "...                            ...                            ...   \n",
       "17242                   ubm-a-2656  volume Left-Lateral-Ventricle   \n",
       "17243                   ubm-a-2656  volume Left-Lateral-Ventricle   \n",
       "17244                   ubm-a-2656  volume Left-Lateral-Ventricle   \n",
       "17245                   ubm-a-2656  volume Left-Lateral-Ventricle   \n",
       "17246                   ubm-a-2656  volume Left-Lateral-Ventricle   \n",
       "\n",
       "      exposure.sample_size       exposure.sex exposure.note  year      author  \\\n",
       "0                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "1                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "2                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "3                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "4                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "...                    ...                ...           ...   ...         ...   \n",
       "17242               8411.0              Males          None  2018  Elliott LT   \n",
       "17243               8411.0              Males          None  2018  Elliott LT   \n",
       "17244               8411.0              Males          None  2018  Elliott LT   \n",
       "17245               8411.0              Males          None  2018  Elliott LT   \n",
       "17246               8411.0              Males          None  2018  Elliott LT   \n",
       "\n",
       "      consortium  outcome.id outcome.sample_size  N_case outcome.year  \\\n",
       "0           None  ieu-a-1165             37954.0    2900       2015.0   \n",
       "1           None  ieu-a-1127            175475.0   69501       2017.0   \n",
       "2           None  ieu-a-1128            127442.0   21468       2017.0   \n",
       "3           None    ukb-a-55            337159.0    7480       2017.0   \n",
       "4           None  ieu-a-1126            228951.0  122977       2017.0   \n",
       "...          ...         ...                 ...     ...          ...   \n",
       "17242       None  ieu-a-1131             32498.0   14910       2017.0   \n",
       "17243       None  ieu-a-1136             50225.0    7333       2017.0   \n",
       "17244       None  ieu-a-1129            106776.0   61282       2017.0   \n",
       "17245       None  ieu-a-1130             89677.0   46785       2017.0   \n",
       "17246       None  ieu-a-1137             22068.0    4480       2017.0   \n",
       "\n",
       "      outcome.nsnp       mr.pval      mr.b     mr.se   mr.method  mr.moescore  \n",
       "0         12940150  5.000000e-01  0.124119  0.124119  Wald ratio          1.0  \n",
       "1         10680257  1.276179e-02 -4.294414  1.724423      FE IVW          1.0  \n",
       "2         10680257  7.809079e-01  0.885429  3.183436      FE IVW          1.0  \n",
       "3         10894596  5.696885e-01 -0.030093  0.052933      FE IVW          1.0  \n",
       "4         10680257  1.922541e-01 -2.230371  1.710487      FE IVW          1.0  \n",
       "...            ...           ...       ...       ...         ...          ...  \n",
       "17242     10680257  7.068205e-01 -0.059728  0.158796      FE IVW          1.0  \n",
       "17243     10680257  7.062982e-02  0.379227  0.209767      FE IVW          1.0  \n",
       "17244     10680257  1.285261e-90 -0.158745  0.007864      FE IVW          1.0  \n",
       "17245     10680257  1.543810e-02  0.108434  0.044772      FE IVW          1.0  \n",
       "17246     10680257  9.580698e-01 -0.012862  0.244630      FE IVW          1.0  \n",
       "\n",
       "[17247 rows x 18 columns]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# now those traits that appered at least once in something at <1e05, \n",
    "# get MR results for those traits with all BC datasets\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id in {gwas_list} \n",
    "AND  exposure.id  in {exposure_list}\n",
    "with mr, exposure, outcome\n",
    "ORDER BY exposure.trait\n",
    "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, exposure.note,\n",
    "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
    "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, outcome.year, outcome.nsnp,\n",
    "        mr.pval, mr.b, mr.se, mr.method, mr.moescore\n",
    "\"\"\".format(gwas_list = all_bc_gwas,\n",
    "           exposure_list = list(set(df['exposure.id'])))\n",
    "df = query_to_df(session, query, True)\n",
    "\n",
    "\n",
    "df.to_csv(\"query_results/bc_all_mr.tsv\", sep=\"\\t\", index=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Extract MR results for a list of exposure GWAS\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "WHERE outcome.id in ['ebi-a-GCST004988', 'ieu-a-1126', 'ieu-a-1127', 'ieu-a-1128', 'ieu-a-1129', 'ieu-a-1130', 'ieu-a-1131', 'ieu-a-1132', 'ieu-a-1133', 'ieu-a-1134', 'ieu-a-1135', 'ieu-a-1136', 'ieu-a-1137', 'ieu-a-1160', 'ieu-a-1161', 'ieu-a-1162', 'ieu-a-1163', 'ieu-a-1164', 'ieu-a-1165', 'ieu-a-1166', 'ieu-a-1167', 'ieu-a-1168', 'ukb-a-55', 'ukb-b-16890', 'ukb-d-C3_BREAST_3'] \n",
      "AND  exposure.id  in ['ebi-a-GCST90000026', 'ebi-a-GCST90000027', 'ebi-a-GCST90000025', 'ieu-a-1083', 'ukb-b-13378', 'ukb-a-198', 'ebi-a-GCST007557', 'ieu-a-27', 'ebi-a-GCST003435', 'ukb-b-8909', 'ukb-a-264', 'ieu-b-40', 'ieu-a-974', 'ebi-a-GCST006802', 'ieu-a-1089', 'ieu-a-835', 'ebi-a-GCST002783', 'ebi-a-GCST006368', 'ieu-a-95', 'ukb-a-248', 'ukb-b-2303', 'ukb-b-19953', 'ieu-a-1096', 'ukb-a-34', 'ukb-b-4650', 'ukb-a-35', 'ukb-d-R22', 'ukb-b-13845', 'ieu-a-1038', 'ieu-a-1040', 'ieu-a-1035', 'ieu-a-1037', 'ieu-a-85', 'ieu-a-86', 'ieu-a-87', 'ukb-d-4979', 'ukb-b-13330', 'prot-a-18', 'ukb-d-20544_5', 'ieu-a-90', 'ieu-a-91', 'ieu-a-92', 'ebi-a-GCST005314', 'ieu-a-93', 'ukb-b-16881', 'ukb-a-195', 'ieu-a-1070', 'ieu-a-1071', 'ukb-a-389', 'ukb-b-10787', 'ukb-b-20044', 'ukb-a-291', 'ukb-a-290', 'ukb-b-16407', 'ukb-b-17409', 'ukb-a-292', 'ukb-a-293', 'ukb-b-9685', 'ieu-a-109', 'ieu-a-73', 'ieu-a-75', 'ieu-a-81', 'ieu-a-79', 'ieu-a-111', 'ukb-a-265', 'ukb-b-19393', 'ukb-b-13354', 'ukb-a-266', 'ukb-a-267', 'ukb-b-14540']\n",
      "//AND mr.pval < 1e-05\n",
      "with mr, exposure, outcome\n",
      "ORDER BY exposure.trait\n",
      "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, exposure.note,\n",
      "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
      "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, outcome.year, outcome.nsnp,\n",
      "        mr.pval, mr.b, mr.se, mr.method, mr.moescore\n",
      "        \n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.sample_size</th>\n",
       "      <th>exposure.sex</th>\n",
       "      <th>exposure.note</th>\n",
       "      <th>year</th>\n",
       "      <th>author</th>\n",
       "      <th>consortium</th>\n",
       "      <th>outcome.id</th>\n",
       "      <th>outcome.sample_size</th>\n",
       "      <th>N_case</th>\n",
       "      <th>outcome.year</th>\n",
       "      <th>outcome.nsnp</th>\n",
       "      <th>mr.pval</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.se</th>\n",
       "      <th>mr.method</th>\n",
       "      <th>mr.moescore</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ukb-b-13378</td>\n",
       "      <td>Birth weight</td>\n",
       "      <td>261932.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>20022: Output from GWAS pipeline using Phesant...</td>\n",
       "      <td>2018</td>\n",
       "      <td>Ben Elsworth</td>\n",
       "      <td>MRC-IEU</td>\n",
       "      <td>ieu-a-1165</td>\n",
       "      <td>37954.0</td>\n",
       "      <td>2900</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>12940150</td>\n",
       "      <td>0.851908</td>\n",
       "      <td>0.035462</td>\n",
       "      <td>0.189955</td>\n",
       "      <td>Penalised median</td>\n",
       "      <td>0.72</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ukb-b-13378</td>\n",
       "      <td>Birth weight</td>\n",
       "      <td>261932.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>20022: Output from GWAS pipeline using Phesant...</td>\n",
       "      <td>2018</td>\n",
       "      <td>Ben Elsworth</td>\n",
       "      <td>MRC-IEU</td>\n",
       "      <td>ieu-a-1127</td>\n",
       "      <td>175475.0</td>\n",
       "      <td>69501</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>0.277998</td>\n",
       "      <td>-0.035867</td>\n",
       "      <td>0.032886</td>\n",
       "      <td>Simple mean</td>\n",
       "      <td>0.75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ukb-b-13378</td>\n",
       "      <td>Birth weight</td>\n",
       "      <td>261932.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>20022: Output from GWAS pipeline using Phesant...</td>\n",
       "      <td>2018</td>\n",
       "      <td>Ben Elsworth</td>\n",
       "      <td>MRC-IEU</td>\n",
       "      <td>ieu-a-1128</td>\n",
       "      <td>127442.0</td>\n",
       "      <td>21468</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>0.631796</td>\n",
       "      <td>0.039524</td>\n",
       "      <td>0.082479</td>\n",
       "      <td>Simple median</td>\n",
       "      <td>0.81</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ukb-b-13378</td>\n",
       "      <td>Birth weight</td>\n",
       "      <td>261932.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>20022: Output from GWAS pipeline using Phesant...</td>\n",
       "      <td>2018</td>\n",
       "      <td>Ben Elsworth</td>\n",
       "      <td>MRC-IEU</td>\n",
       "      <td>ukb-a-55</td>\n",
       "      <td>337159.0</td>\n",
       "      <td>7480</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10894596</td>\n",
       "      <td>0.501197</td>\n",
       "      <td>-0.001604</td>\n",
       "      <td>0.002385</td>\n",
       "      <td>Penalised median</td>\n",
       "      <td>0.77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ukb-b-13378</td>\n",
       "      <td>Birth weight</td>\n",
       "      <td>261932.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>20022: Output from GWAS pipeline using Phesant...</td>\n",
       "      <td>2018</td>\n",
       "      <td>Ben Elsworth</td>\n",
       "      <td>MRC-IEU</td>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>228951.0</td>\n",
       "      <td>122977</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>0.180349</td>\n",
       "      <td>0.076728</td>\n",
       "      <td>0.056968</td>\n",
       "      <td>RE IVW</td>\n",
       "      <td>0.81</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1236</th>\n",
       "      <td>ukb-b-14540</td>\n",
       "      <td>Whole body water mass</td>\n",
       "      <td>454888.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>23102: Output from GWAS pipeline using Phesant...</td>\n",
       "      <td>2018</td>\n",
       "      <td>Ben Elsworth</td>\n",
       "      <td>MRC-IEU</td>\n",
       "      <td>ieu-a-1136</td>\n",
       "      <td>50225.0</td>\n",
       "      <td>7333</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>0.375618</td>\n",
       "      <td>-0.252099</td>\n",
       "      <td>0.284261</td>\n",
       "      <td>Weighted mode</td>\n",
       "      <td>0.64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1237</th>\n",
       "      <td>ukb-b-14540</td>\n",
       "      <td>Whole body water mass</td>\n",
       "      <td>454888.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>23102: Output from GWAS pipeline using Phesant...</td>\n",
       "      <td>2018</td>\n",
       "      <td>Ben Elsworth</td>\n",
       "      <td>MRC-IEU</td>\n",
       "      <td>ieu-a-1129</td>\n",
       "      <td>106776.0</td>\n",
       "      <td>61282</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>0.509237</td>\n",
       "      <td>0.023696</td>\n",
       "      <td>0.035902</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>0.63</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1238</th>\n",
       "      <td>ukb-b-14540</td>\n",
       "      <td>Whole body water mass</td>\n",
       "      <td>454888.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>23102: Output from GWAS pipeline using Phesant...</td>\n",
       "      <td>2018</td>\n",
       "      <td>Ben Elsworth</td>\n",
       "      <td>MRC-IEU</td>\n",
       "      <td>ieu-a-1130</td>\n",
       "      <td>89677.0</td>\n",
       "      <td>46785</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>0.852613</td>\n",
       "      <td>-0.013496</td>\n",
       "      <td>0.072643</td>\n",
       "      <td>Simple median</td>\n",
       "      <td>0.70</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1239</th>\n",
       "      <td>ukb-b-14540</td>\n",
       "      <td>Whole body water mass</td>\n",
       "      <td>454888.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>23102: Output from GWAS pipeline using Phesant...</td>\n",
       "      <td>2018</td>\n",
       "      <td>Ben Elsworth</td>\n",
       "      <td>MRC-IEU</td>\n",
       "      <td>ieu-a-1161</td>\n",
       "      <td>69970.0</td>\n",
       "      <td>27078</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>195514</td>\n",
       "      <td>0.571277</td>\n",
       "      <td>-0.183671</td>\n",
       "      <td>0.324408</td>\n",
       "      <td>Simple median</td>\n",
       "      <td>0.82</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1240</th>\n",
       "      <td>ukb-b-14540</td>\n",
       "      <td>Whole body water mass</td>\n",
       "      <td>454888.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>23102: Output from GWAS pipeline using Phesant...</td>\n",
       "      <td>2018</td>\n",
       "      <td>Ben Elsworth</td>\n",
       "      <td>MRC-IEU</td>\n",
       "      <td>ieu-a-1137</td>\n",
       "      <td>22068.0</td>\n",
       "      <td>4480</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257</td>\n",
       "      <td>0.002698</td>\n",
       "      <td>-0.333015</td>\n",
       "      <td>0.110998</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>0.68</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1241 rows × 18 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      exposure.id         exposure.trait exposure.sample_size  \\\n",
       "0     ukb-b-13378           Birth weight             261932.0   \n",
       "1     ukb-b-13378           Birth weight             261932.0   \n",
       "2     ukb-b-13378           Birth weight             261932.0   \n",
       "3     ukb-b-13378           Birth weight             261932.0   \n",
       "4     ukb-b-13378           Birth weight             261932.0   \n",
       "...           ...                    ...                  ...   \n",
       "1236  ukb-b-14540  Whole body water mass             454888.0   \n",
       "1237  ukb-b-14540  Whole body water mass             454888.0   \n",
       "1238  ukb-b-14540  Whole body water mass             454888.0   \n",
       "1239  ukb-b-14540  Whole body water mass             454888.0   \n",
       "1240  ukb-b-14540  Whole body water mass             454888.0   \n",
       "\n",
       "           exposure.sex                                      exposure.note  \\\n",
       "0     Males and Females  20022: Output from GWAS pipeline using Phesant...   \n",
       "1     Males and Females  20022: Output from GWAS pipeline using Phesant...   \n",
       "2     Males and Females  20022: Output from GWAS pipeline using Phesant...   \n",
       "3     Males and Females  20022: Output from GWAS pipeline using Phesant...   \n",
       "4     Males and Females  20022: Output from GWAS pipeline using Phesant...   \n",
       "...                 ...                                                ...   \n",
       "1236  Males and Females  23102: Output from GWAS pipeline using Phesant...   \n",
       "1237  Males and Females  23102: Output from GWAS pipeline using Phesant...   \n",
       "1238  Males and Females  23102: Output from GWAS pipeline using Phesant...   \n",
       "1239  Males and Females  23102: Output from GWAS pipeline using Phesant...   \n",
       "1240  Males and Females  23102: Output from GWAS pipeline using Phesant...   \n",
       "\n",
       "      year        author consortium  outcome.id outcome.sample_size  N_case  \\\n",
       "0     2018  Ben Elsworth    MRC-IEU  ieu-a-1165             37954.0    2900   \n",
       "1     2018  Ben Elsworth    MRC-IEU  ieu-a-1127            175475.0   69501   \n",
       "2     2018  Ben Elsworth    MRC-IEU  ieu-a-1128            127442.0   21468   \n",
       "3     2018  Ben Elsworth    MRC-IEU    ukb-a-55            337159.0    7480   \n",
       "4     2018  Ben Elsworth    MRC-IEU  ieu-a-1126            228951.0  122977   \n",
       "...    ...           ...        ...         ...                 ...     ...   \n",
       "1236  2018  Ben Elsworth    MRC-IEU  ieu-a-1136             50225.0    7333   \n",
       "1237  2018  Ben Elsworth    MRC-IEU  ieu-a-1129            106776.0   61282   \n",
       "1238  2018  Ben Elsworth    MRC-IEU  ieu-a-1130             89677.0   46785   \n",
       "1239  2018  Ben Elsworth    MRC-IEU  ieu-a-1161             69970.0   27078   \n",
       "1240  2018  Ben Elsworth    MRC-IEU  ieu-a-1137             22068.0    4480   \n",
       "\n",
       "     outcome.year outcome.nsnp   mr.pval      mr.b     mr.se  \\\n",
       "0          2015.0     12940150  0.851908  0.035462  0.189955   \n",
       "1          2017.0     10680257  0.277998 -0.035867  0.032886   \n",
       "2          2017.0     10680257  0.631796  0.039524  0.082479   \n",
       "3          2017.0     10894596  0.501197 -0.001604  0.002385   \n",
       "4          2017.0     10680257  0.180349  0.076728  0.056968   \n",
       "...           ...          ...       ...       ...       ...   \n",
       "1236       2017.0     10680257  0.375618 -0.252099  0.284261   \n",
       "1237       2017.0     10680257  0.509237  0.023696  0.035902   \n",
       "1238       2017.0     10680257  0.852613 -0.013496  0.072643   \n",
       "1239       2015.0       195514  0.571277 -0.183671  0.324408   \n",
       "1240       2017.0     10680257  0.002698 -0.333015  0.110998   \n",
       "\n",
       "             mr.method  mr.moescore  \n",
       "0     Penalised median         0.72  \n",
       "1          Simple mean         0.75  \n",
       "2        Simple median         0.81  \n",
       "3     Penalised median         0.77  \n",
       "4               RE IVW         0.81  \n",
       "...                ...          ...  \n",
       "1236     Weighted mode         0.64  \n",
       "1237            FE IVW         0.63  \n",
       "1238     Simple median         0.70  \n",
       "1239     Simple median         0.82  \n",
       "1240            FE IVW         0.68  \n",
       "\n",
       "[1241 rows x 18 columns]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# read list of exp gwas (EXTRACTED IN R)\n",
    "risk_factors = list(pd.read_csv(\"query_results/gwas_rf_list.txt\", sep = '\\t')['id'])\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id in {gwas_list_outcome} \n",
    "AND  exposure.id  in {gwas_list_exposure}\n",
    "//AND mr.pval < 1e-05\n",
    "with mr, exposure, outcome\n",
    "ORDER BY exposure.trait\n",
    "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, exposure.note,\n",
    "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
    "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, outcome.year, outcome.nsnp,\n",
    "        mr.pval, mr.b, mr.se, mr.method, mr.moescore\n",
    "        \n",
    "\"\"\".format(gwas_list_outcome = all_bc_gwas,\n",
    "           gwas_list_exposure = risk_factors )\n",
    "df = query_to_df(session, query, True)\n",
    "\n",
    "\n",
    "df.to_csv(\"query_results/gwas_rf_bc_all_mr.tsv\", sep=\"\\t\", index=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Correlation "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (trait:Gwas)-[gen_cor:GEN_COR]-(assoc_trait:Gwas)\n",
      "where assoc_trait.id in ['ukb-a-519']\n",
      "match (trait:Gwas)-[mr:MR_EVE_MR]->(assoc_trait:Gwas)\n",
      "//where mr.pval < 1e-03\n",
      "return distinct trait.trait, trait.id, gen_cor.rg, assoc_trait.trait, assoc_trait.id, mr.b, mr.pval\n",
      "order by gen_cor.rg desc\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>trait.trait</th>\n",
       "      <th>trait.id</th>\n",
       "      <th>gen_cor.rg</th>\n",
       "      <th>assoc_trait.trait</th>\n",
       "      <th>assoc_trait.id</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.pval</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Number of self-reported cancers</td>\n",
       "      <td>ukb-a-21</td>\n",
       "      <td>0.8279</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>0.077594</td>\n",
       "      <td>1.850559e-02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Had other major operations</td>\n",
       "      <td>ukb-a-326</td>\n",
       "      <td>0.2660</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>0.026946</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Breastfed as a baby</td>\n",
       "      <td>ukb-a-33</td>\n",
       "      <td>0.2471</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.012162</td>\n",
       "      <td>5.060810e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Headaches for 3+ months</td>\n",
       "      <td>ukb-a-354</td>\n",
       "      <td>0.1980</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.017729</td>\n",
       "      <td>3.182665e-29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Qualifications: NVQ or HND or HNC or equivalent</td>\n",
       "      <td>ukb-a-402</td>\n",
       "      <td>0.1885</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>0.026366</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>260</th>\n",
       "      <td>Reason for glasses/contact lenses: For 'astigm...</td>\n",
       "      <td>ukb-a-422</td>\n",
       "      <td>-0.1279</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.077385</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>261</th>\n",
       "      <td>Diagnoses - main ICD10: I21 Acute myocardial i...</td>\n",
       "      <td>ukb-a-533</td>\n",
       "      <td>-0.1304</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.057651</td>\n",
       "      <td>5.647018e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>262</th>\n",
       "      <td>Number of days/week of vigorous physical activ...</td>\n",
       "      <td>ukb-a-511</td>\n",
       "      <td>-0.1306</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.006864</td>\n",
       "      <td>3.821609e-02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263</th>\n",
       "      <td>Mineral and other dietary supplements: None of...</td>\n",
       "      <td>ukb-a-493</td>\n",
       "      <td>-0.1405</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.014608</td>\n",
       "      <td>6.539805e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>264</th>\n",
       "      <td>Types of transport used (excluding work): Car/...</td>\n",
       "      <td>ukb-a-478</td>\n",
       "      <td>-0.1570</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.033081</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>265 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           trait.trait   trait.id  gen_cor.rg  \\\n",
       "0                      Number of self-reported cancers   ukb-a-21      0.8279   \n",
       "1                           Had other major operations  ukb-a-326      0.2660   \n",
       "2                                  Breastfed as a baby   ukb-a-33      0.2471   \n",
       "3                              Headaches for 3+ months  ukb-a-354      0.1980   \n",
       "4      Qualifications: NVQ or HND or HNC or equivalent  ukb-a-402      0.1885   \n",
       "..                                                 ...        ...         ...   \n",
       "260  Reason for glasses/contact lenses: For 'astigm...  ukb-a-422     -0.1279   \n",
       "261  Diagnoses - main ICD10: I21 Acute myocardial i...  ukb-a-533     -0.1304   \n",
       "262  Number of days/week of vigorous physical activ...  ukb-a-511     -0.1306   \n",
       "263  Mineral and other dietary supplements: None of...  ukb-a-493     -0.1405   \n",
       "264  Types of transport used (excluding work): Car/...  ukb-a-478     -0.1570   \n",
       "\n",
       "                                     assoc_trait.trait assoc_trait.id  \\\n",
       "0    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "1    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "2    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "3    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "4    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "..                                                 ...            ...   \n",
       "260  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "261  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "262  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "263  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "264  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "\n",
       "         mr.b       mr.pval  \n",
       "0    0.077594  1.850559e-02  \n",
       "1    0.026946  5.000000e-01  \n",
       "2   -0.012162  5.060810e-01  \n",
       "3   -0.017729  3.182665e-29  \n",
       "4    0.026366  5.000000e-01  \n",
       "..        ...           ...  \n",
       "260 -0.077385  5.000000e-01  \n",
       "261 -0.057651  5.647018e-01  \n",
       "262 -0.006864  3.821609e-02  \n",
       "263 -0.014608  6.539805e-01  \n",
       "264 -0.033081  5.000000e-01  \n",
       "\n",
       "[265 rows x 7 columns]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find which traits are highly correlated with UKB cancers\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (trait:Gwas)-[gen_cor:GEN_COR]-(assoc_trait:Gwas)\n",
    "where assoc_trait.id in ['ukb-a-519']\n",
    "match (trait:Gwas)-[mr:MR_EVE_MR]->(assoc_trait:Gwas)\n",
    "//where mr.pval < 1e-03\n",
    "return distinct trait.trait, trait.id, gen_cor.rg, assoc_trait.trait, assoc_trait.id, mr.b, mr.pval\n",
    "order by gen_cor.rg desc\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "df\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
