{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "14196\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "import json\n",
    "from environs import Env\n",
    "from graph_functions import query_to_df,start_graph_session, start_graph_session_crashdown\n",
    "from IPython.display import Image\n",
    "\n",
    "\n",
    "env = Env()\n",
    "#session = start_graph_session(env) \n",
    "session = start_graph_session_crashdown(env) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "### List of all breast-related GWAS"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query=\"\"\"\n",
    "MATCH (gwas:Gwas)\n",
    "where toLower(gwas.trait) contains \"breast\"\n",
    "and not(toLower(gwas.trait) contains \"baby\") \n",
    "and not(toLower(gwas.trait) contains \"mother\")\n",
    "and not(toLower(gwas.trait) contains \"sibling\")\n",
    "and not(toLower(gwas.trait) contains \"mammogram\")\n",
    "return distinct gwas.trait, gwas.id, gwas.sample_size as SampleSize,\n",
    "toInteger(gwas.ncase) as N_case, toInteger(gwas.ncontrol) as N_control, gwas.author, gwas.year, gwas.consortium\n",
    "order by SampleSize desc\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "#df.to_csv(\"query_results/bc_all_related_gwas.tsv\", sep=\"\\t\", index=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Get BC GWAS that have MR results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (gwas:Gwas)<-[mr:MR_EVE_MR]-(othergwas:Gwas)\n",
      "where toLower(gwas.trait) contains \"breast\"\n",
      "and not(toLower(gwas.trait) contains \"baby\") \n",
      "and not(toLower(gwas.trait) contains \"mother\")\n",
      "and not(toLower(gwas.trait) contains \"sibling\")\n",
      "and not(toLower(gwas.trait) contains \"mammogram\")\n",
      "and not(toLower(gwas.trait) contains \"protein\")\n",
      "return distinct gwas.trait, gwas.id, toInteger(gwas.sample_size) as SampleSize,\n",
      "toInteger(gwas.ncase) as N_case, toInteger(gwas.ncontrol) as N_control, gwas.author, gwas.year, gwas.consortium\n",
      "order by gwas.id,  gwas.author, N_case desc\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>gwas.trait</th>\n",
       "      <th>gwas.id</th>\n",
       "      <th>SampleSize</th>\n",
       "      <th>N_case</th>\n",
       "      <th>N_control</th>\n",
       "      <th>gwas.author</th>\n",
       "      <th>gwas.year</th>\n",
       "      <th>gwas.consortium</th>\n",
       "      <th>case_percent</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Breast cancer</td>\n",
       "      <td>ebi-a-GCST004988</td>\n",
       "      <td>139274</td>\n",
       "      <td>76192</td>\n",
       "      <td>63082</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>54.706550</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Breast cancer</td>\n",
       "      <td>ebi-a-GCST007236</td>\n",
       "      <td>89677</td>\n",
       "      <td>46785</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>52.170568</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Breast cancer (Combined Oncoarray; iCOGS; GWAS...</td>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>228951</td>\n",
       "      <td>122977</td>\n",
       "      <td>105974</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>53.713240</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ER+ Breast cancer (Combined Oncoarray; iCOGS; ...</td>\n",
       "      <td>ieu-a-1127</td>\n",
       "      <td>175475</td>\n",
       "      <td>69501</td>\n",
       "      <td>105974</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>39.607351</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ER- Breast cancer (Combined Oncoarray; iCOGS; ...</td>\n",
       "      <td>ieu-a-1128</td>\n",
       "      <td>127442</td>\n",
       "      <td>21468</td>\n",
       "      <td>105974</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>16.845310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1129</td>\n",
       "      <td>106776</td>\n",
       "      <td>61282</td>\n",
       "      <td>45494</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>57.393047</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1130</td>\n",
       "      <td>89677</td>\n",
       "      <td>46785</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>52.170568</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1131</td>\n",
       "      <td>32498</td>\n",
       "      <td>14910</td>\n",
       "      <td>17588</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>45.879746</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ER+ Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1132</td>\n",
       "      <td>83691</td>\n",
       "      <td>38197</td>\n",
       "      <td>45494</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>45.640511</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ER+ Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1133</td>\n",
       "      <td>69970</td>\n",
       "      <td>27078</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>38.699443</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>ER+ Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1134</td>\n",
       "      <td>21814</td>\n",
       "      <td>4226</td>\n",
       "      <td>17588</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>19.372880</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>ER- Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1135</td>\n",
       "      <td>55149</td>\n",
       "      <td>9655</td>\n",
       "      <td>45494</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>17.507117</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ER- Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1136</td>\n",
       "      <td>50225</td>\n",
       "      <td>7333</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>14.600299</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>ER- Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1137</td>\n",
       "      <td>22068</td>\n",
       "      <td>4480</td>\n",
       "      <td>17588</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>20.300888</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>ER- Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1160</td>\n",
       "      <td>50225</td>\n",
       "      <td>7333</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>14.600299</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>ER+ Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1161</td>\n",
       "      <td>69970</td>\n",
       "      <td>27078</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>38.699443</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1162</td>\n",
       "      <td>89677</td>\n",
       "      <td>46785</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>52.170568</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>ER- Breast cancer (Survival)</td>\n",
       "      <td>ieu-a-1163</td>\n",
       "      <td>6881</td>\n",
       "      <td>920</td>\n",
       "      <td>5961</td>\n",
       "      <td>Guo Q</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>13.370150</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>ER+ Breast cancer (Survival)</td>\n",
       "      <td>ieu-a-1164</td>\n",
       "      <td>23059</td>\n",
       "      <td>1333</td>\n",
       "      <td>21726</td>\n",
       "      <td>Guo Q</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>5.780823</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Breast cancer (Survival)</td>\n",
       "      <td>ieu-a-1165</td>\n",
       "      <td>37954</td>\n",
       "      <td>2900</td>\n",
       "      <td>35054</td>\n",
       "      <td>Guo Q</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>7.640828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>ER- Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1166</td>\n",
       "      <td>21695</td>\n",
       "      <td>3611</td>\n",
       "      <td>18084</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>16.644388</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>ER+ Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1167</td>\n",
       "      <td>22286</td>\n",
       "      <td>4202</td>\n",
       "      <td>18084</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>18.854886</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1168</td>\n",
       "      <td>33832</td>\n",
       "      <td>15748</td>\n",
       "      <td>18084</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>46.547647</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Cancer code  self-reported: breast cancer</td>\n",
       "      <td>ukb-a-55</td>\n",
       "      <td>337159</td>\n",
       "      <td>7480</td>\n",
       "      <td>329679</td>\n",
       "      <td>Neale</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>Neale Lab</td>\n",
       "      <td>2.218538</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Cancer code, self-reported: breast cancer</td>\n",
       "      <td>ukb-b-16890</td>\n",
       "      <td>462933</td>\n",
       "      <td>10303</td>\n",
       "      <td>452630</td>\n",
       "      <td>Ben Elsworth</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>MRC-IEU</td>\n",
       "      <td>2.225592</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>Malignant neoplasm of breast</td>\n",
       "      <td>ukb-d-C3_BREAST_3</td>\n",
       "      <td>361194</td>\n",
       "      <td>9721</td>\n",
       "      <td>351473</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>None</td>\n",
       "      <td>2.691351</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           gwas.trait            gwas.id  \\\n",
       "0                                       Breast cancer   ebi-a-GCST004988   \n",
       "1                                       Breast cancer   ebi-a-GCST007236   \n",
       "2   Breast cancer (Combined Oncoarray; iCOGS; GWAS...         ieu-a-1126   \n",
       "3   ER+ Breast cancer (Combined Oncoarray; iCOGS; ...         ieu-a-1127   \n",
       "4   ER- Breast cancer (Combined Oncoarray; iCOGS; ...         ieu-a-1128   \n",
       "5                           Breast cancer (Oncoarray)         ieu-a-1129   \n",
       "6                               Breast cancer (iCOGS)         ieu-a-1130   \n",
       "7                                Breast cancer (GWAS)         ieu-a-1131   \n",
       "8                       ER+ Breast cancer (Oncoarray)         ieu-a-1132   \n",
       "9                           ER+ Breast cancer (iCOGS)         ieu-a-1133   \n",
       "10                           ER+ Breast cancer (GWAS)         ieu-a-1134   \n",
       "11                      ER- Breast cancer (Oncoarray)         ieu-a-1135   \n",
       "12                          ER- Breast cancer (iCOGS)         ieu-a-1136   \n",
       "13                           ER- Breast cancer (GWAS)         ieu-a-1137   \n",
       "14                          ER- Breast cancer (iCOGS)         ieu-a-1160   \n",
       "15                          ER+ Breast cancer (iCOGS)         ieu-a-1161   \n",
       "16                              Breast cancer (iCOGS)         ieu-a-1162   \n",
       "17                       ER- Breast cancer (Survival)         ieu-a-1163   \n",
       "18                       ER+ Breast cancer (Survival)         ieu-a-1164   \n",
       "19                           Breast cancer (Survival)         ieu-a-1165   \n",
       "20                           ER- Breast cancer (GWAS)         ieu-a-1166   \n",
       "21                           ER+ Breast cancer (GWAS)         ieu-a-1167   \n",
       "22                               Breast cancer (GWAS)         ieu-a-1168   \n",
       "24          Cancer code  self-reported: breast cancer           ukb-a-55   \n",
       "30          Cancer code, self-reported: breast cancer        ukb-b-16890   \n",
       "47                       Malignant neoplasm of breast  ukb-d-C3_BREAST_3   \n",
       "\n",
       "    SampleSize  N_case  N_control    gwas.author gwas.year gwas.consortium  \\\n",
       "0       139274   76192      63082  Michailidou K    2017.0            None   \n",
       "1        89677   46785      42892  Michailidou K    2015.0            None   \n",
       "2       228951  122977     105974  Michailidou K    2017.0            None   \n",
       "3       175475   69501     105974  Michailidou K    2017.0            None   \n",
       "4       127442   21468     105974  Michailidou K    2017.0            None   \n",
       "5       106776   61282      45494  Michailidou K    2017.0            None   \n",
       "6        89677   46785      42892  Michailidou K    2017.0            None   \n",
       "7        32498   14910      17588  Michailidou K    2017.0            None   \n",
       "8        83691   38197      45494  Michailidou K    2017.0            None   \n",
       "9        69970   27078      42892  Michailidou K    2017.0            None   \n",
       "10       21814    4226      17588  Michailidou K    2017.0            None   \n",
       "11       55149    9655      45494  Michailidou K    2017.0            None   \n",
       "12       50225    7333      42892  Michailidou K    2017.0            None   \n",
       "13       22068    4480      17588  Michailidou K    2017.0            None   \n",
       "14       50225    7333      42892  Michailidou K    2015.0            None   \n",
       "15       69970   27078      42892  Michailidou K    2015.0            None   \n",
       "16       89677   46785      42892  Michailidou K    2015.0            None   \n",
       "17        6881     920       5961          Guo Q    2015.0            None   \n",
       "18       23059    1333      21726          Guo Q    2015.0            None   \n",
       "19       37954    2900      35054          Guo Q    2015.0            None   \n",
       "20       21695    3611      18084  Michailidou K    2015.0            None   \n",
       "21       22286    4202      18084  Michailidou K    2015.0            None   \n",
       "22       33832   15748      18084  Michailidou K    2015.0            None   \n",
       "24      337159    7480     329679          Neale    2017.0       Neale Lab   \n",
       "30      462933   10303     452630   Ben Elsworth    2018.0         MRC-IEU   \n",
       "47      361194    9721     351473      Neale lab    2018.0            None   \n",
       "\n",
       "    case_percent  \n",
       "0      54.706550  \n",
       "1      52.170568  \n",
       "2      53.713240  \n",
       "3      39.607351  \n",
       "4      16.845310  \n",
       "5      57.393047  \n",
       "6      52.170568  \n",
       "7      45.879746  \n",
       "8      45.640511  \n",
       "9      38.699443  \n",
       "10     19.372880  \n",
       "11     17.507117  \n",
       "12     14.600299  \n",
       "13     20.300888  \n",
       "14     14.600299  \n",
       "15     38.699443  \n",
       "16     52.170568  \n",
       "17     13.370150  \n",
       "18      5.780823  \n",
       "19      7.640828  \n",
       "20     16.644388  \n",
       "21     18.854886  \n",
       "22     46.547647  \n",
       "24      2.218538  \n",
       "30      2.225592  \n",
       "47      2.691351  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (gwas:Gwas)<-[mr:MR_EVE_MR]-(othergwas:Gwas)\n",
    "where toLower(gwas.trait) contains \"breast\"\n",
    "and not(toLower(gwas.trait) contains \"baby\") \n",
    "and not(toLower(gwas.trait) contains \"mother\")\n",
    "and not(toLower(gwas.trait) contains \"sibling\")\n",
    "and not(toLower(gwas.trait) contains \"mammogram\")\n",
    "and not(toLower(gwas.trait) contains \"protein\")\n",
    "return distinct gwas.trait, gwas.id, toInteger(gwas.sample_size) as SampleSize,\n",
    "toInteger(gwas.ncase) as N_case, toInteger(gwas.ncontrol) as N_control, gwas.author, gwas.year, gwas.consortium\n",
    "order by gwas.id,  gwas.author, N_case desc\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "#df.to_csv(\"query_results/bc_gwas_with_mr.tsv\", sep=\"\\t\", index=False)\n",
    "\n",
    "# calulate cases % in the dataset and only keep those >2%\n",
    "df['case_percent'] = df['N_case']/df['SampleSize']*100\n",
    "df = df[df['case_percent'] > 2]\n",
    "\n",
    "\n",
    "df.to_csv(\"query_results/bc_gwas_with_mr_keep.tsv\", sep=\"\\t\", index=False)\n",
    "all_bc_gwas = list(df['gwas.id'])\n",
    "df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['ebi-a-GCST004988',\n",
       " 'ebi-a-GCST007236',\n",
       " 'ieu-a-1126',\n",
       " 'ieu-a-1127',\n",
       " 'ieu-a-1128',\n",
       " 'ieu-a-1129',\n",
       " 'ieu-a-1130',\n",
       " 'ieu-a-1131',\n",
       " 'ieu-a-1132',\n",
       " 'ieu-a-1133',\n",
       " 'ieu-a-1134',\n",
       " 'ieu-a-1135',\n",
       " 'ieu-a-1136',\n",
       " 'ieu-a-1137',\n",
       " 'ieu-a-1160',\n",
       " 'ieu-a-1161',\n",
       " 'ieu-a-1162',\n",
       " 'ieu-a-1163',\n",
       " 'ieu-a-1164',\n",
       " 'ieu-a-1165',\n",
       " 'ieu-a-1166',\n",
       " 'ieu-a-1167',\n",
       " 'ieu-a-1168',\n",
       " 'ukb-a-55',\n",
       " 'ukb-b-16890',\n",
       " 'ukb-d-C3_BREAST_3']"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "all_bc_gwas"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## MR data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "WHERE outcome.id = \"ieu-a-1126\"  \n",
      "AND (not (toLower(exposure.trait) contains 'breast')) \n",
      "AND mr.pval < 1e-08\n",
      "RETURN exposure {.id, .trait}, outcome.id, mr {.b, .pval, .method, .selection, .moescore} ORDER BY mr.pval\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>outcome.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.method</th>\n",
       "      <th>mr.selection</th>\n",
       "      <th>mr.pval</th>\n",
       "      <th>mr.moescore</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Ever addicted to alcohol</td>\n",
       "      <td>ukb-d-20406</td>\n",
       "      <td>-0.054825</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>0.000000e+00</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Diagnoses - secondary ICD10: K44.9 Diaphragmat...</td>\n",
       "      <td>ukb-b-3672</td>\n",
       "      <td>-1.542995</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>4.514856e-242</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Killer cell immunoglobulin-like receptor 2DL5A</td>\n",
       "      <td>prot-a-1644</td>\n",
       "      <td>0.016679</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>4.770365e-106</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Ever had hysterectomy (womb removed)</td>\n",
       "      <td>ukb-b-6445</td>\n",
       "      <td>-1.562231</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>9.686474e-86</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Operation code: bunion/hallus valgus surgery</td>\n",
       "      <td>ukb-b-9190</td>\n",
       "      <td>1.109370</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.334299e-85</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Vascular endothelial growth factor A, isoform 121</td>\n",
       "      <td>prot-a-3197</td>\n",
       "      <td>0.013410</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>7.992747e-83</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>fatty acid binding protein 4</td>\n",
       "      <td>prot-b-71</td>\n",
       "      <td>0.019159</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.571455e-58</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Diagnoses - secondary ICD10: Z92.1 Personal hi...</td>\n",
       "      <td>ukb-b-7352</td>\n",
       "      <td>-0.973106</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.267170e-57</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>CUB and zona pellucida-like domain-containing ...</td>\n",
       "      <td>prot-a-735</td>\n",
       "      <td>0.021479</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.941390e-37</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Filamin-A</td>\n",
       "      <td>prot-a-1117</td>\n",
       "      <td>-0.054938</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>9.719336e-26</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Alpha-L-iduronidase</td>\n",
       "      <td>prot-a-1411</td>\n",
       "      <td>0.022690</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>4.120827e-25</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Secretory phospholipase A2 receptor</td>\n",
       "      <td>prot-a-2291</td>\n",
       "      <td>0.014897</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>8.347529e-25</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>HDL cholesterol</td>\n",
       "      <td>ebi-a-GCST005058</td>\n",
       "      <td>0.058877</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.163784e-19</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>X-11440</td>\n",
       "      <td>met-a-513</td>\n",
       "      <td>-0.113873</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.321509e-19</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Childhood obesity</td>\n",
       "      <td>ieu-a-1096</td>\n",
       "      <td>-0.199101</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.726210e-18</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Falls in the last year</td>\n",
       "      <td>ukb-b-2535</td>\n",
       "      <td>1.278313</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.494507e-16</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Delta-like protein 1</td>\n",
       "      <td>prot-a-831</td>\n",
       "      <td>0.053920</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>6.557481e-16</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Cadherin-related family member 3</td>\n",
       "      <td>prot-a-488</td>\n",
       "      <td>-0.088639</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.358433e-15</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Completion status of test: Heart rate reached ...</td>\n",
       "      <td>ukb-d-6020_33</td>\n",
       "      <td>-0.653432</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.380744e-15</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Non-cancer illness code, self-reported: ankylo...</td>\n",
       "      <td>ukb-b-18194</td>\n",
       "      <td>1.662842</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.066378e-14</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Body mass index</td>\n",
       "      <td>ieu-a-974</td>\n",
       "      <td>-0.788037</td>\n",
       "      <td>FE Egger</td>\n",
       "      <td>HF</td>\n",
       "      <td>9.788118e-13</td>\n",
       "      <td>0.76</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Added milk to espresso</td>\n",
       "      <td>ukb-b-1004</td>\n",
       "      <td>0.867059</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.788631e-12</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Parental longevity (combined parental age at d...</td>\n",
       "      <td>ebi-a-GCST006702</td>\n",
       "      <td>0.526232</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>HF</td>\n",
       "      <td>2.541637e-11</td>\n",
       "      <td>0.73</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Tyrosine-protein kinase receptor Tie-1, soluble</td>\n",
       "      <td>prot-a-2978</td>\n",
       "      <td>-0.031356</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.783312e-11</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Xyloside xylosyltransferase 1</td>\n",
       "      <td>prot-a-3243</td>\n",
       "      <td>0.050365</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>5.800064e-11</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Hip circumference</td>\n",
       "      <td>ieu-a-99</td>\n",
       "      <td>-0.571581</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>6.247788e-11</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Maspardin</td>\n",
       "      <td>prot-a-2815</td>\n",
       "      <td>-0.016165</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.624044e-10</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>IDP dMRI TBSS ICVF Anterior limb of internal c...</td>\n",
       "      <td>ubm-a-501</td>\n",
       "      <td>0.058488</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.048454e-09</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>IDP dMRI ProbtrackX ISOVF slf r</td>\n",
       "      <td>ubm-a-866</td>\n",
       "      <td>-0.050763</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.597902e-09</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Calpastatin</td>\n",
       "      <td>prot-a-366</td>\n",
       "      <td>0.054911</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.406328e-09</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Types of physical activity in last 4 weeks: No...</td>\n",
       "      <td>ukb-a-483</td>\n",
       "      <td>3.564379</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>HF</td>\n",
       "      <td>4.223489e-09</td>\n",
       "      <td>0.71</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    outcome.id                                     exposure.trait  \\\n",
       "0   ieu-a-1126                           Ever addicted to alcohol   \n",
       "1   ieu-a-1126  Diagnoses - secondary ICD10: K44.9 Diaphragmat...   \n",
       "2   ieu-a-1126     Killer cell immunoglobulin-like receptor 2DL5A   \n",
       "3   ieu-a-1126               Ever had hysterectomy (womb removed)   \n",
       "4   ieu-a-1126       Operation code: bunion/hallus valgus surgery   \n",
       "5   ieu-a-1126  Vascular endothelial growth factor A, isoform 121   \n",
       "6   ieu-a-1126                       fatty acid binding protein 4   \n",
       "7   ieu-a-1126  Diagnoses - secondary ICD10: Z92.1 Personal hi...   \n",
       "8   ieu-a-1126  CUB and zona pellucida-like domain-containing ...   \n",
       "9   ieu-a-1126                                          Filamin-A   \n",
       "10  ieu-a-1126                                Alpha-L-iduronidase   \n",
       "11  ieu-a-1126                Secretory phospholipase A2 receptor   \n",
       "12  ieu-a-1126                                    HDL cholesterol   \n",
       "13  ieu-a-1126                                            X-11440   \n",
       "14  ieu-a-1126                                  Childhood obesity   \n",
       "15  ieu-a-1126                             Falls in the last year   \n",
       "16  ieu-a-1126                               Delta-like protein 1   \n",
       "17  ieu-a-1126                   Cadherin-related family member 3   \n",
       "18  ieu-a-1126  Completion status of test: Heart rate reached ...   \n",
       "19  ieu-a-1126  Non-cancer illness code, self-reported: ankylo...   \n",
       "20  ieu-a-1126                                    Body mass index   \n",
       "21  ieu-a-1126                             Added milk to espresso   \n",
       "22  ieu-a-1126  Parental longevity (combined parental age at d...   \n",
       "23  ieu-a-1126    Tyrosine-protein kinase receptor Tie-1, soluble   \n",
       "24  ieu-a-1126                      Xyloside xylosyltransferase 1   \n",
       "25  ieu-a-1126                                  Hip circumference   \n",
       "26  ieu-a-1126                                          Maspardin   \n",
       "27  ieu-a-1126  IDP dMRI TBSS ICVF Anterior limb of internal c...   \n",
       "28  ieu-a-1126                    IDP dMRI ProbtrackX ISOVF slf r   \n",
       "29  ieu-a-1126                                        Calpastatin   \n",
       "30  ieu-a-1126  Types of physical activity in last 4 weeks: No...   \n",
       "\n",
       "         exposure.id      mr.b mr.method mr.selection        mr.pval  \\\n",
       "0        ukb-d-20406 -0.054825    FE IVW           DF   0.000000e+00   \n",
       "1         ukb-b-3672 -1.542995    FE IVW           DF  4.514856e-242   \n",
       "2        prot-a-1644  0.016679    FE IVW           DF  4.770365e-106   \n",
       "3         ukb-b-6445 -1.562231    FE IVW           DF   9.686474e-86   \n",
       "4         ukb-b-9190  1.109370    FE IVW           DF   3.334299e-85   \n",
       "5        prot-a-3197  0.013410    FE IVW           DF   7.992747e-83   \n",
       "6          prot-b-71  0.019159    FE IVW           DF   1.571455e-58   \n",
       "7         ukb-b-7352 -0.973106    FE IVW           DF   1.267170e-57   \n",
       "8         prot-a-735  0.021479    FE IVW           DF   2.941390e-37   \n",
       "9        prot-a-1117 -0.054938    FE IVW           DF   9.719336e-26   \n",
       "10       prot-a-1411  0.022690    FE IVW           DF   4.120827e-25   \n",
       "11       prot-a-2291  0.014897    FE IVW           DF   8.347529e-25   \n",
       "12  ebi-a-GCST005058  0.058877    FE IVW           DF   1.163784e-19   \n",
       "13         met-a-513 -0.113873    FE IVW           DF   1.321509e-19   \n",
       "14        ieu-a-1096 -0.199101    FE IVW           DF   1.726210e-18   \n",
       "15        ukb-b-2535  1.278313    FE IVW           DF   3.494507e-16   \n",
       "16        prot-a-831  0.053920    FE IVW           DF   6.557481e-16   \n",
       "17        prot-a-488 -0.088639    FE IVW           DF   1.358433e-15   \n",
       "18     ukb-d-6020_33 -0.653432    FE IVW           DF   2.380744e-15   \n",
       "19       ukb-b-18194  1.662842    FE IVW           DF   2.066378e-14   \n",
       "20         ieu-a-974 -0.788037  FE Egger           HF   9.788118e-13   \n",
       "21        ukb-b-1004  0.867059    FE IVW           DF   3.788631e-12   \n",
       "22  ebi-a-GCST006702  0.526232    FE IVW           HF   2.541637e-11   \n",
       "23       prot-a-2978 -0.031356    FE IVW           DF   2.783312e-11   \n",
       "24       prot-a-3243  0.050365    FE IVW           DF   5.800064e-11   \n",
       "25          ieu-a-99 -0.571581    FE IVW           DF   6.247788e-11   \n",
       "26       prot-a-2815 -0.016165    FE IVW           DF   3.624044e-10   \n",
       "27         ubm-a-501  0.058488    FE IVW           DF   1.048454e-09   \n",
       "28         ubm-a-866 -0.050763    FE IVW           DF   2.597902e-09   \n",
       "29        prot-a-366  0.054911    FE IVW           DF   3.406328e-09   \n",
       "30         ukb-a-483  3.564379    FE IVW           HF   4.223489e-09   \n",
       "\n",
       "    mr.moescore  \n",
       "0          1.00  \n",
       "1          1.00  \n",
       "2          1.00  \n",
       "3          1.00  \n",
       "4          1.00  \n",
       "5          1.00  \n",
       "6          1.00  \n",
       "7          1.00  \n",
       "8          1.00  \n",
       "9          1.00  \n",
       "10         1.00  \n",
       "11         1.00  \n",
       "12         1.00  \n",
       "13         1.00  \n",
       "14         1.00  \n",
       "15         1.00  \n",
       "16         1.00  \n",
       "17         1.00  \n",
       "18         1.00  \n",
       "19         1.00  \n",
       "20         0.76  \n",
       "21         1.00  \n",
       "22         0.73  \n",
       "23         1.00  \n",
       "24         1.00  \n",
       "25         1.00  \n",
       "26         1.00  \n",
       "27         1.00  \n",
       "28         1.00  \n",
       "29         1.00  \n",
       "30         0.71  "
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# MR test\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id = \"ieu-a-1126\"  \n",
    "AND (not (toLower(exposure.trait) contains 'breast')) \n",
    "AND mr.pval < 1e-08\n",
    "RETURN exposure {.id, .trait}, outcome.id, mr {.b, .pval, .method, .selection, .moescore} ORDER BY mr.pval\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.sample_size</th>\n",
       "      <th>outcome_ids</th>\n",
       "      <th>MR_pvals</th>\n",
       "      <th>MR_beta</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ukb-b-323</td>\n",
       "      <td>Illnesses of father: Alzheimer's disease/dementia</td>\n",
       "      <td>399793.0</td>\n",
       "      <td>[ebi-a-GCST004988, ieu-a-1134, ieu-a-1132, ieu...</td>\n",
       "      <td>[0.0, 8.299326114712149e-72, 6.21025571093903e...</td>\n",
       "      <td>[-0.930140957122164, 1.69433355372966, -1.5471...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>prot-a-408</td>\n",
       "      <td>C-C motif chemokine 3-like 1</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>[ebi-a-GCST004988, ebi-a-GCST007236, ieu-a-113...</td>\n",
       "      <td>[0.0, 5.37437935276178e-45, 3.2070884984982397...</td>\n",
       "      <td>[0.0172084678909587, 1.39602294061095, 0.07991...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ukb-d-H40</td>\n",
       "      <td>Diagnoses - main ICD10: H40 Glaucoma</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>[ebi-a-GCST007236, ieu-a-1137]</td>\n",
       "      <td>[0.0, 4.4397636534247396e-11]</td>\n",
       "      <td>[-726.001285117886, 24.913334445577696]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ukb-d-30270_irnt</td>\n",
       "      <td>Mean sphered cell volume</td>\n",
       "      <td>344729.0</td>\n",
       "      <td>[ebi-a-GCST007236]</td>\n",
       "      <td>[0.0]</td>\n",
       "      <td>[7.490779645720821]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ukb-b-2732</td>\n",
       "      <td>Time from waking to first cigarette</td>\n",
       "      <td>33304.0</td>\n",
       "      <td>[ebi-a-GCST007236, ukb-a-55]</td>\n",
       "      <td>[0.0, 1.0627484509411099e-09]</td>\n",
       "      <td>[-11.1357984372859, 0.00667248437247834]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1449</th>\n",
       "      <td>met-a-359</td>\n",
       "      <td>Gamma-glutamylglutamine</td>\n",
       "      <td>7662.0</td>\n",
       "      <td>[ieu-a-1167]</td>\n",
       "      <td>[7.44948187880931e-06]</td>\n",
       "      <td>[-1.7471772915958101]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1450</th>\n",
       "      <td>ukb-b-19809</td>\n",
       "      <td>Fed-up feelings</td>\n",
       "      <td>453071.0</td>\n",
       "      <td>[ieu-a-1161]</td>\n",
       "      <td>[7.94247770454966e-06]</td>\n",
       "      <td>[1.2684340568579098]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1451</th>\n",
       "      <td>prot-a-821</td>\n",
       "      <td>Dickkopf-related protein 1</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>[ieu-a-1136]</td>\n",
       "      <td>[8.24099097862065e-06]</td>\n",
       "      <td>[0.0339189126254016]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1452</th>\n",
       "      <td>ukb-a-361</td>\n",
       "      <td>Heel bone mineral density (BMD) T-score  autom...</td>\n",
       "      <td>106254.0</td>\n",
       "      <td>[ebi-a-GCST007236]</td>\n",
       "      <td>[8.33635583806819e-06]</td>\n",
       "      <td>[-5.32572418764976]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1453</th>\n",
       "      <td>ubm-a-513</td>\n",
       "      <td>IDP dMRI TBSS ICVF Posterior thalamic radiation L</td>\n",
       "      <td>7532.0</td>\n",
       "      <td>[ebi-a-GCST007236]</td>\n",
       "      <td>[9.55329500979885e-06]</td>\n",
       "      <td>[-0.40754021089084497]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1454 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "           exposure.id                                     exposure.trait  \\\n",
       "0            ukb-b-323  Illnesses of father: Alzheimer's disease/dementia   \n",
       "1           prot-a-408                       C-C motif chemokine 3-like 1   \n",
       "2            ukb-d-H40               Diagnoses - main ICD10: H40 Glaucoma   \n",
       "3     ukb-d-30270_irnt                           Mean sphered cell volume   \n",
       "4           ukb-b-2732                Time from waking to first cigarette   \n",
       "...                ...                                                ...   \n",
       "1449         met-a-359                            Gamma-glutamylglutamine   \n",
       "1450       ukb-b-19809                                    Fed-up feelings   \n",
       "1451        prot-a-821                         Dickkopf-related protein 1   \n",
       "1452         ukb-a-361  Heel bone mineral density (BMD) T-score  autom...   \n",
       "1453         ubm-a-513  IDP dMRI TBSS ICVF Posterior thalamic radiation L   \n",
       "\n",
       "     exposure.sample_size                                        outcome_ids  \\\n",
       "0                399793.0  [ebi-a-GCST004988, ieu-a-1134, ieu-a-1132, ieu...   \n",
       "1                  3301.0  [ebi-a-GCST004988, ebi-a-GCST007236, ieu-a-113...   \n",
       "2                361194.0                     [ebi-a-GCST007236, ieu-a-1137]   \n",
       "3                344729.0                                 [ebi-a-GCST007236]   \n",
       "4                 33304.0                       [ebi-a-GCST007236, ukb-a-55]   \n",
       "...                   ...                                                ...   \n",
       "1449               7662.0                                       [ieu-a-1167]   \n",
       "1450             453071.0                                       [ieu-a-1161]   \n",
       "1451               3301.0                                       [ieu-a-1136]   \n",
       "1452             106254.0                                 [ebi-a-GCST007236]   \n",
       "1453               7532.0                                 [ebi-a-GCST007236]   \n",
       "\n",
       "                                               MR_pvals  \\\n",
       "0     [0.0, 8.299326114712149e-72, 6.21025571093903e...   \n",
       "1     [0.0, 5.37437935276178e-45, 3.2070884984982397...   \n",
       "2                         [0.0, 4.4397636534247396e-11]   \n",
       "3                                                 [0.0]   \n",
       "4                         [0.0, 1.0627484509411099e-09]   \n",
       "...                                                 ...   \n",
       "1449                             [7.44948187880931e-06]   \n",
       "1450                             [7.94247770454966e-06]   \n",
       "1451                             [8.24099097862065e-06]   \n",
       "1452                             [8.33635583806819e-06]   \n",
       "1453                             [9.55329500979885e-06]   \n",
       "\n",
       "                                                MR_beta  \n",
       "0     [-0.930140957122164, 1.69433355372966, -1.5471...  \n",
       "1     [0.0172084678909587, 1.39602294061095, 0.07991...  \n",
       "2               [-726.001285117886, 24.913334445577696]  \n",
       "3                                   [7.490779645720821]  \n",
       "4              [-11.1357984372859, 0.00667248437247834]  \n",
       "...                                                 ...  \n",
       "1449                              [-1.7471772915958101]  \n",
       "1450                               [1.2684340568579098]  \n",
       "1451                               [0.0339189126254016]  \n",
       "1452                                [-5.32572418764976]  \n",
       "1453                             [-0.40754021089084497]  \n",
       "\n",
       "[1454 rows x 6 columns]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# MR\n",
    "# get traits that have pval < 1e-05\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id in {gwas_list} \n",
    "AND  not exposure.id  in {gwas_list}\n",
    "//AND (not (toLower(exposure.trait) contains 'breast')) \n",
    "AND mr.pval < 1e-05\n",
    "with mr, exposure, outcome\n",
    "ORDER BY mr.pval \n",
    "RETURN exposure.id, exposure.trait, exposure.sample_size,\n",
    "        collect(outcome.id) as outcome_ids, \n",
    "        collect(mr.pval) as MR_pvals, collect(mr.b) as MR_beta\n",
    "        \n",
    "\"\"\".format(gwas_list = all_bc_gwas)\n",
    "df = query_to_df(session, query, False)\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "WHERE outcome.id in ['ebi-a-GCST004988', 'ebi-a-GCST007236', 'ieu-a-1126', 'ieu-a-1127', 'ieu-a-1128', 'ieu-a-1129', 'ieu-a-1130', 'ieu-a-1131', 'ieu-a-1132', 'ieu-a-1133', 'ieu-a-1134', 'ieu-a-1135', 'ieu-a-1136', 'ieu-a-1137', 'ieu-a-1160', 'ieu-a-1161', 'ieu-a-1162', 'ieu-a-1163', 'ieu-a-1164', 'ieu-a-1165', 'ieu-a-1166', 'ieu-a-1167', 'ieu-a-1168', 'ukb-a-55', 'ukb-b-16890', 'ukb-d-C3_BREAST_3'] \n",
      "AND  exposure.id  in ['ukb-b-19809', 'ubm-a-724', 'met-c-953', 'ukb-a-358', 'prot-a-3000', 'prot-a-1005', 'ubm-a-172', 'prot-a-1174', 'ukb-b-323', 'prot-a-1006', 'ubm-a-154', 'ieu-a-93', 'prot-a-2006', 'prot-a-2222', 'ubm-a-796', 'ukb-b-11842', 'ebi-a-GCST004629', 'prot-a-149', 'ubm-a-3143', 'prot-a-2462', 'ubm-a-215', 'prot-a-201', 'prot-a-1502', 'ieu-a-1011', 'ukb-a-511', 'ukb-b-9473', 'ukb-b-10505', 'ubm-a-285', 'met-a-524', 'ieu-a-10', 'ukb-a-264', 'ubm-a-481', 'ukb-b-7376', 'ukb-b-4650', 'prot-a-3193', 'prot-a-2393', 'ubm-a-504', 'ukb-a-572', 'prot-a-316', 'ukb-b-9571', 'prot-a-545', 'ukb-a-11', 'ebi-a-GCST004424', 'ukb-a-280', 'ukb-b-4564', 'met-c-899', 'prot-a-2269', 'prot-a-745', 'ukb-a-117', 'met-c-874', 'ukb-b-8746', 'prot-a-467', 'ubm-a-639', 'met-a-573', 'met-a-460', 'prot-a-971', 'ukb-d-30760_raw', 'prot-a-1991', 'ukb-a-91', 'ukb-b-19921', 'prot-a-2486', 'ebi-a-GCST004460', 'met-c-921', 'ukb-a-428', 'prot-a-1299', 'prot-a-1075', 'ukb-a-292', 'ukb-a-338', 'ukb-a-419', 'ukb-a-301', 'prot-a-2951', 'prot-a-599', 'prot-a-2739', 'ukb-b-12181', 'ukb-b-748', 'ukb-b-9190', 'ukb-a-284', 'ukb-b-18366', 'ubm-a-891', 'ukb-a-483', 'prot-a-1724', 'ukb-a-213', 'ieu-a-785', 'prot-a-2676', 'ebi-a-GCST003435', 'prot-a-2795', 'prot-a-1276', 'prot-a-1576', 'ieu-a-1051', 'ukb-b-18096', 'ieu-a-782', 'ubm-a-806', 'ubm-a-498', 'ukb-b-6218', 'met-a-476', 'ukb-a-289', 'prot-a-2357', 'ieu-a-831', 'prot-a-398', 'prot-a-2663', 'ukb-a-333', 'ukb-a-225', 'met-a-505', 'met-c-912', 'ubm-a-751', 'prot-a-216', 'ukb-a-325', 'ebi-a-GCST005842', 'ukb-d-C_MALE_GENITAL', 'ubm-a-669', 'ukb-b-18994', 'ukb-b-9592', 'ebi-a-GCST004600', 'prot-a-1950', 'ebi-a-GCST006867', 'ukb-a-51', 'ukb-b-3599', 'ieu-a-53', 'ukb-b-6306', 'prot-a-766', 'prot-a-2532', 'ukb-a-454', 'ukb-b-8909', 'prot-a-2685', 'ukb-b-18275', 'ukb-b-9508', 'prot-a-2043', 'prot-a-89', 'prot-a-2904', 'prot-a-2308', 'ieu-a-25', 'prot-a-3180', 'ukb-a-552', 'prot-a-2392', 'ieu-a-833', 'ebi-a-GCST004620', 'prot-a-2991', 'ukb-b-17595', 'prot-a-1665', 'ukb-d-C67', 'ukb-a-342', 'prot-a-112', 'ubm-a-668', 'ebi-a-GCST005067', 'prot-a-1046', 'prot-a-1995', 'prot-a-2878', 'ebi-a-GCST004076', 'prot-a-1898', 'ukb-d-22601_35423237', 'prot-a-3031', 'ukb-b-12465', 'ieu-a-1228', 'ebi-a-GCST004634', 'prot-a-1112', 'ukb-b-4955', 'ukb-b-3278', 'met-c-878', 'ebi-a-GCST003044', 'ieu-a-1050', 'met-c-936', 'ukb-b-10827', 'ieu-a-980', 'ieu-a-101', 'met-c-860', 'ukb-b-4522', 'prot-a-674', 'ebi-a-GCST004132', 'prot-a-44', 'ukb-b-13799', 'ukb-b-6353', 'prot-a-2701', 'prot-a-987', 'prot-a-1332', 'prot-a-586', 'ieu-a-273', 'met-c-882', 'ukb-d-30090_irnt', 'ukb-a-251', 'met-c-876', 'ieu-a-70', 'ubm-a-135', 'ukb-d-1418_3', 'prot-a-2399', 'prot-a-717', 'ukb-a-274', 'ukb-b-15445', 'prot-a-2189', 'ukb-b-4256', 'ukb-a-243', 'prot-a-1115', 'ieu-a-31', 'ukb-b-13251', 'ukb-b-17841', 'prot-a-1453', 'met-c-887', 'ubm-a-476', 'ukb-b-14080', 'ieu-a-795', 'ieu-a-982', 'prot-a-2744', 'ukb-b-1707', 'ieu-a-974', 'ukb-b-20486', 'ukb-a-216', 'ukb-b-18377', 'ukb-b-2183', 'ubm-a-271', 'ubm-a-524', 'ukb-d-30700_irnt', 'ubm-a-790', 'ukb-b-11971', 'ukb-a-45', 'ukb-b-845', 'prot-a-1051', 'prot-a-2139', 'ukb-d-STILL_ADULT', 'ukb-b-13500', 'ieu-a-89', 'ubm-a-811', 'prot-a-3243', 'ukb-b-11358', 'ukb-d-1747_3', 'prot-a-1347', 'met-c-866', 'ukb-d-30240_irnt', 'prot-a-3124', 'ubm-a-667', 'ukb-b-1744', 'ukb-b-4710', 'prot-a-566', 'ukb-d-XIII_MUSCULOSKELET', 'met-a-304', 'ukb-b-5779', 'ukb-b-14395', 'prot-a-246', 'prot-a-10', 'met-a-513', 'prot-a-953', 'ieu-a-293', 'prot-a-609', 'prot-a-2351', 'ukb-b-16399', 'ubm-a-415', 'ukb-a-421', 'met-c-848', 'prot-a-540', 'ebi-a-GCST005569', 'ukb-a-524', 'prot-a-2720', 'prot-a-1313', 'ieu-a-65', 'ieu-a-1231', 'ubm-a-248', 'prot-a-524', 'ubm-a-791', 'prot-a-2743', 'ukb-a-331', 'prot-a-1713', 'ieu-a-78', 'ubm-a-3', 'ebi-a-GCST003043', 'prot-a-1166', 'ukb-b-16576', 'ukb-b-18103', 'met-a-636', 'met-c-902', 'prot-a-988', 'ukb-b-13932', 'ubm-a-840', 'prot-a-2432', 'ukb-d-ICDMAIN_ANY_ENTRY', 'ukb-a-176', 'ieu-a-72', 'ukb-b-5076', 'ubm-a-801', 'prot-a-2030', 'met-c-942', 'met-c-932', 'prot-a-983', 'ubm-a-484', 'ebi-a-GCST006061', 'ieu-a-55', 'ukb-b-4667', 'ukb-b-6324', 'prot-a-390', 'ubm-a-813', 'ieu-a-1096', 'ubm-a-2656', 'ukb-a-490', 'prot-a-608', 'ukb-a-195', 'prot-a-892', 'met-a-682', 'ieu-a-816', 'met-c-840', 'prot-a-2747', 'ebi-a-GCST005413', 'prot-a-1917', 'prot-a-3048', 'met-c-842', 'ukb-b-16019', 'prot-a-2481', 'ukb-b-3793', 'met-a-419', 'ukb-d-30210_irnt', 'ukb-d-30050_irnt', 'ebi-a-GCST004610', 'ukb-d-1508_2', 'met-a-699', 'ieu-a-755', 'prot-a-836', 'ukb-a-211', 'ubm-a-516', 'ukb-b-19373', 'prot-a-710', 'ukb-d-20553_5', 'ukb-b-2862', 'ukb-b-589', 'ieu-a-796', 'ukb-b-1061', 'ukb-b-2227', 'prot-a-2875', 'ebi-a-GCST000568', 'ukb-a-528', 'ukb-b-14294', 'prot-a-2071', 'prot-a-2395', 'prot-a-2049', 'ukb-b-19379', 'prot-a-1949', 'ukb-a-238', 'prot-a-1659', 'prot-a-1202', 'prot-a-607', 'ukb-b-11297', 'met-a-356', 'ieu-a-64', 'ubm-a-711', 'ukb-b-8398', 'ebi-a-GCST006941', 'prot-a-2852', 'ubm-a-659', 'ebi-a-GCST004296', 'prot-a-3215', 'ieu-a-1049', 'ubm-a-495', 'ukb-a-41', 'ukb-a-320', 'ukb-a-210', 'ieu-a-976', 'prot-a-656', 'ukb-d-I9_CORATHER', 'ieu-a-30', 'ukb-a-53', 'prot-a-1288', 'ukb-d-30290_irnt', 'prot-a-1541', 'ukb-b-5593', 'ukb-a-574', 'ubm-a-29', 'ukb-b-469', 'prot-a-1389', 'prot-a-3267', 'ukb-b-11064', 'ebi-a-GCST006368', 'ukb-b-14310', 'ubm-a-792', 'prot-a-346', 'ukb-a-254', 'ukb-d-K11_OTHDIG', 'ebi-a-GCST004613', 'ukb-b-1260', 'ieu-a-79', 'ubm-a-278', 'prot-a-1250', 'prot-a-2538', 'prot-a-2493', 'prot-a-1921', 'ubm-a-2734', 'prot-a-972', 'ukb-b-7992', 'prot-a-135', 'ukb-b-18162', 'ubm-a-148', 'ukb-d-30730_irnt', 'prot-a-2018', 'prot-a-1027', 'prot-a-2087', 'ieu-a-1105', 'prot-a-570', 'ieu-a-68', 'met-a-500', 'prot-a-32', 'ieu-a-999', 'ukb-b-16886', 'prot-a-2371', 'ukb-b-4801', 'met-c-897', 'ieu-a-968', 'ukb-d-5182_1', 'ukb-a-433', 'ukb-a-232', 'ukb-a-418', 'ukb-a-488', 'prot-a-2356', 'ubm-a-643', 'ukb-b-4077', 'prot-a-2301', 'ebi-a-GCST004631', 'ukb-b-13354', 'ukb-b-2535', 'ieu-a-300', 'ieu-a-2', 'prot-a-2211', 'ukb-a-66', 'prot-a-28', 'ukb-b-8865', 'prot-a-735', 'prot-a-391', 'ebi-a-GCST006906', 'ubm-a-2651', 'ubm-a-517', 'ukb-b-6852', 'prot-a-2064', 'prot-a-3137', 'ukb-b-660', 'ukb-b-18240', 'ukb-a-22', 'prot-a-2892', 'ukb-d-C3_PRIMARY_LYMPHOID_HEMATOPOIETIC', 'ukb-b-14067', 'ebi-a-GCST005038', 'ukb-b-6848', 'ubm-a-2737', 'ukb-a-503', 'ukb-a-46', 'ukb-b-15784', 'ukb-a-343', 'ebi-a-GCST003045', 'ukb-b-15592', 'prot-a-1779', 'ebi-a-GCST004133', 'prot-a-335', 'prot-a-2350', 'prot-a-3071', 'ukb-b-3304', 'prot-a-2907', 'prot-a-819', 'ukb-b-12722', 'met-c-856', 'ebi-a-GCST005522', 'ukb-b-9125', 'ieu-a-292', 'ubm-a-165', 'ukb-b-9038', 'prot-a-1930', 'prot-a-804', 'prot-a-1148', 'prot-a-486', 'met-a-485', 'met-c-864', 'ukb-b-7710', 'prot-a-2427', 'prot-a-2324', 'ukb-b-5664', 'prot-a-1074', 'met-a-652', 'ukb-d-OTHER_ILD_CVD_COMORB', 'ebi-a-GCST005923', 'ukb-a-282', 'ubm-a-513', 'prot-a-2573', 'ukb-a-13', 'ukb-a-218', 'prot-a-2940', 'prot-a-3076', 'ukb-a-393', 'prot-a-2900', 'ebi-a-GCST006414', 'prot-a-1746', 'ukb-b-11158', 'prot-a-2524', 'prot-a-532', 'ukb-a-199', 'ubm-a-734', 'ukb-b-15418', 'met-c-859', 'ebi-a-GCST001198', 'ukb-d-30760_irnt', 'prot-a-706', 'ubm-a-747', 'prot-b-50', 'prot-a-2557', 'prot-a-372', 'ieu-a-834', 'prot-a-2101', 'ukb-d-1468_5', 'ukb-d-680_1', 'prot-a-2939', 'ukb-d-22617_9149', 'ieu-a-69', 'ukb-b-4943', 'prot-a-2665', 'prot-a-1858', 'prot-a-2813', 'ukb-b-13378', 'ukb-a-397', 'ukb-b-4643', 'ukb-d-I9_IHD', 'met-c-947', 'ieu-a-1056', 'prot-a-521', 'met-a-359', 'ukb-d-C3_SKIN', 'ebi-a-GCST000964', 'prot-a-3016', 'prot-a-1178', 'ieu-a-1230', 'ubm-a-793', 'ukb-b-20292', 'ukb-a-217', 'ebi-a-GCST004608', 'prot-a-690', 'ukb-d-C3_PROSTATE', 'ukb-b-10859', 'ukb-b-703', 'ukb-b-19579', 'prot-a-403', 'ukb-b-11650', 'ukb-b-15782', 'ebi-a-GCST004616', 'ukb-a-252', 'prot-a-347', 'ukb-b-17422', 'ukb-d-H7_LENS', 'ieu-a-1102', 'prot-a-208', 'ukb-d-30120_irnt', 'ukb-b-5421', 'ukb-b-10415', 'ukb-d-30500_irnt', 'ieu-a-996', 'prot-a-1911', 'ukb-d-C_SKIN', 'prot-a-2061', 'ukb-b-7043', 'ubm-a-804', 'prot-a-2818', 'prot-a-878', 'prot-a-2902', 'ebi-a-GCST006908', 'ukb-b-8929', 'ukb-b-18009', 'ieu-a-11', 'ebi-a-GCST004626', 'ieu-a-1233', 'ukb-a-270', 'ukb-b-6591', 'met-a-615', 'prot-a-1386', 'ukb-a-335', 'ukb-a-239', 'prot-a-2908', 'ukb-b-14521', 'ukb-d-1538_2', 'prot-a-213', 'ukb-d-IV_ENDOCRIN_NUTRIT', 'met-c-915', 'ubm-a-859', 'prot-a-705', 'prot-a-2205', 'prot-a-1369', 'prot-a-1696', 'prot-a-1402', 'ebi-a-GCST004438', 'ieu-a-73', 'ukb-b-13184', 'ieu-a-789', 'met-a-665', 'prot-a-1707', 'ubm-a-3142', 'prot-b-18', 'ieu-a-52', 'ukb-a-75', 'ukb-b-17848', 'prot-a-2221', 'ebi-a-GCST005528', 'ebi-a-GCST003129', 'ukb-a-361', 'ubm-a-392', 'prot-a-2245', 'prot-a-592', 'ukb-b-10003', 'ukb-b-7435', 'prot-a-2944', 'ubm-a-916', 'ieu-a-1008', 'ubm-a-508', 'ukb-b-5463', 'prot-a-1537', 'prot-a-1500', 'ukb-d-30020_irnt', 'ukb-d-ASTHMA_MEDICATIO_COMORB', 'prot-a-1854', 'prot-a-3109', 'ukb-b-10831', 'prot-a-1863', 'ieu-a-801', 'ukb-d-1508_3', 'ukb-d-22506_114', 'ukb-a-328', 'ubm-a-660', 'prot-a-3028', 'ukb-b-20432', 'prot-a-627', 'ukb-a-26', 'ubm-a-929', 'prot-a-1742', 'ukb-b-143', 'ukb-b-3386', 'prot-a-2009', 'ubm-a-506', 'prot-a-2730', 'ubm-a-4', 'ieu-a-783', 'prot-a-2575', 'met-a-383', 'ubm-a-11', 'ukb-b-10093', 'prot-a-995', 'prot-a-399', 'ukb-a-34', 'ukb-b-11856', 'ubm-a-408', 'ebi-a-GCST004692', 'ubm-a-458', 'ebi-a-GCST004602', 'ukb-d-20500', 'met-c-919', 'ukb-b-14670', 'ebi-a-GCST003839', 'prot-a-612', 'ukb-a-295', 'ukb-a-426', 'prot-a-2736', 'ukb-d-20117_2', 'ukb-b-3656', 'prot-a-3123', 'ebi-a-GCST005920', 'ukb-b-6991', 'prot-a-1695', 'ieu-a-1013', 'ukb-d-D12', 'ebi-a-GCST005838', 'prot-a-2398', 'prot-a-1277', 'ieu-a-800', 'ukb-b-5447', 'ebi-a-GCST004734', 'prot-a-1922', 'ukb-b-19060', 'prot-a-3090', 'ieu-a-99', 'prot-a-527', 'ukb-b-20544', 'ukb-a-475', 'ukb-b-7137', 'prot-a-439', 'ukb-b-4657', 'ukb-a-398', 'ukb-b-17952', 'ukb-d-R79', 'prot-a-1207', 'met-a-517', 'ebi-a-GCST006478', 'ukb-b-282', 'ukb-b-8133', 'ukb-b-20531', 'ukb-a-23', 'ukb-b-17868', 'prot-b-55', 'met-c-885', 'ubm-a-525', 'ebi-a-GCST004733', 'ubm-a-487', 'met-a-479', 'ieu-a-1095', 'prot-a-1823', 'ieu-a-1088', 'ukb-b-7478', 'ukb-d-XI_DIGESTIVE', 'ukb-b-9099', 'ebi-a-GCST006572', 'ukb-a-44', 'ukb-b-20261', 'prot-b-40', 'ukb-b-12912', 'ieu-a-49', 'ukb-b-9207', 'ieu-a-812', 'ukb-b-15918', 'ukb-d-5327_0', 'ukb-b-7460', 'ubm-a-502', 'met-c-855', 'ukb-d-M06', 'ubm-a-146', 'ukb-b-998', 'prot-a-970', 'ukb-a-286', 'ukb-a-399', 'ubm-a-809', 'ukb-a-204', 'ukb-a-60', 'ukb-b-20296', 'ubm-a-774', 'ieu-a-836', 'ukb-b-3957', 'ukb-d-II_NEOPLASM', 'ieu-a-75', 'prot-a-2082', 'ebi-a-GCST004432', 'prot-a-1586', 'prot-a-2889', 'prot-a-2329', 'ukb-b-970', 'ukb-a-453', 'prot-a-1645', 'prot-a-1920', 'ieu-a-803', 'prot-a-315', 'ukb-b-17885', 'prot-a-3093', 'ieu-a-271', 'ukb-d-2654_2', 'ukb-b-223', 'prot-a-670', 'ukb-d-ULCERNAS', 'ukb-b-19520', 'ubm-a-510', 'ieu-a-58', 'ieu-a-1112', 'prot-a-2930', 'prot-a-1317', 'prot-a-1781', 'prot-a-3197', 'ukb-b-6704', 'ukb-b-6445', 'ukb-b-7178', 'ukb-a-401', 'prot-a-2215', 'ukb-a-290', 'prot-a-394', 'prot-a-181', 'prot-a-2815', 'prot-a-3009', 'ebi-a-GCST004433', 'ukb-d-I9_DVTANDPULM', 'prot-a-96', 'met-c-858', 'ukb-b-5174', 'ukb-b-15787', 'ukb-b-14147', 'prot-a-2978', 'ukb-b-9487', 'ukb-b-17918', 'prot-a-2341', 'ukb-b-16407', 'met-c-914', 'ukb-a-246', 'ieu-a-90', 'ebi-a-GCST006862', 'ukb-d-30640_raw', 'ukb-b-10559', 'prot-a-1540', 'ukb-b-2134', 'ukb-b-4733', 'ukb-a-268', 'ebi-a-GCST005314', 'prot-a-1117', 'prot-a-134', 'ukb-b-11189', 'ukb-b-5192', 'ukb-b-10454', 'ieu-a-1034', 'prot-a-1738', 'prot-a-1050', 'ukb-b-11268', 'ukb-b-19732', 'prot-a-842', 'ukb-a-448', 'ebi-a-GCST004618', 'ukb-b-8764', 'ubm-a-512', 'prot-a-280', 'prot-a-1747', 'ieu-a-1120', 'ukb-d-30010_irnt', 'ukb-b-13392', 'prot-a-2667', 'prot-a-1038', 'ukb-b-15169', 'ebi-a-GCST004941', 'prot-a-774', 'ebi-a-GCST004441', 'ubm-a-230', 'ebi-a-GCST006698', 'ukb-d-1538_0', 'ukb-d-2247_0', 'ukb-b-18436', 'met-a-444', 'ebi-a-GCST007557', 'ebi-a-GCST005065', 'ukb-b-9433', 'prot-a-2760', 'ebi-a-GCST005847', 'ebi-a-GCST006940', 'ukb-a-513', 'ieu-a-32', 'ebi-a-GCST004609', 'prot-a-2748', 'ubm-a-723', 'ukb-b-3376', 'ukb-a-271', 'ukb-a-103', 'prot-a-305', 'prot-a-1792', 'ukb-b-17241', 'prot-a-1378', 'ukb-b-18799', 'ubm-a-812', 'ebi-a-GCST006951', 'ieu-a-1121', 'prot-a-2073', 'ukb-a-357', 'ukb-a-58', 'prot-a-319', 'met-a-316', 'ukb-b-19277', 'ukb-a-108', 'prot-a-1411', 'ukb-b-16866', 'ebi-a-GCST005058', 'prot-a-655', 'prot-b-21', 'ukb-b-9981', 'prot-a-205', 'ukb-a-201', 'prot-a-2729', 'prot-a-1445', 'prot-a-19', 'ukb-b-16677', 'ubm-a-613', 'prot-a-1228', 'ieu-a-1083', 'met-c-900', 'ukb-b-1806', 'met-c-844', 'met-a-558', 'ukb-a-132', 'met-c-940', 'ebi-a-GCST004075', 'met-a-306', 'met-a-375', 'prot-a-1097', 'prot-a-977', 'ebi-a-GCST004601', 'ukb-d-30690_raw', 'ukb-d-C3_MALE_GENITAL', 'ubm-a-147', 'ukb-b-4711', 'ieu-a-797', 'ukb-d-C_OTHER_SKIN', 'prot-a-1258', 'ebi-a-GCST004611', 'ieu-a-44', 'ieu-a-66', 'prot-a-488', 'prot-a-821', 'prot-a-654', 'ubm-a-2667', 'prot-a-322', 'prot-a-1606', 'ukb-d-1418_1', 'ukb-a-313', 'met-a-542', 'prot-a-1170', 'ubm-a-2677', 'prot-a-1275', 'ubm-a-521', 'prot-a-2464', 'met-c-944', 'ukb-a-379', 'ebi-a-GCST005848', 'prot-a-643', 'met-c-872', 'ukb-b-1553', 'prot-a-3216', 'ubm-a-798', 'ukb-b-14146', 'ebi-a-GCST004439', 'prot-a-1867', 'met-a-616', 'ukb-b-11535', 'ukb-b-16855', 'met-c-923', 'ukb-b-7663', 'ukb-b-11207', 'ieu-a-76', 'prot-a-354', 'ebi-a-GCST000679', 'ebi-a-GCST005073', 'ukb-a-228', 'prot-a-456', 'prot-a-805', 'met-c-901', 'ubm-a-470', 'ubm-a-799', 'ubm-a-866', 'prot-a-1931', 'prot-a-3203', 'ubm-a-200', 'ubm-a-670', 'prot-a-1906', 'ubm-a-488', 'prot-a-2797', 'prot-a-1732', 'ebi-a-GCST006702', 'ukb-d-C_PRIMARY_LYMPHOID_HEMATOPOIETIC', 'prot-a-310', 'ukb-b-20379', 'ukb-b-1096', 'ukb-d-20406', 'ukb-b-15491', 'prot-a-1401', 'ukb-d-RHEUMA_NOS', 'ukb-a-487', 'ebi-a-GCST004904', 'prot-a-1072', 'prot-a-2166', 'ebi-a-GCST002318', 'ieu-a-1104', 'met-c-851', 'ukb-b-3666', 'ukb-b-7872', 'ukb-b-13978', 'ukb-b-2732', 'prot-a-873', 'ebi-a-GCST004623', 'ubm-a-507', 'ebi-a-GCST001791', 'prot-a-2891', 'ubm-a-499', 'ebi-a-GCST004430', 'prot-a-1397', 'ukb-b-13065', 'met-a-362', 'ieu-a-835', 'met-c-898', 'ukb-b-19925', 'met-a-519', 'ukb-b-19071', 'prot-a-1657', 'ukb-d-30600_irnt', 'ieu-a-111', 'ubm-a-293', 'prot-a-2302', 'ukb-b-15695', 'ukb-b-3357', 'ieu-a-297', 'ukb-a-281', 'prot-a-3258', 'ukb-b-16881', 'ukb-b-16217', 'ukb-b-11075', 'ebi-a-GCST003770', 'prot-a-2291', 'prot-a-543', 'prot-a-1639', 'ebi-a-GCST006948', 'ukb-a-373', 'prot-a-936', 'ukb-a-324', 'prot-a-419', 'prot-a-1835', 'prot-a-1360', 'ieu-a-54', 'ieu-a-1025', 'prot-a-48', 'prot-a-857', 'prot-a-2629', 'prot-a-392', 'ukb-a-452', 'ukb-b-1004', 'ukb-d-M13_POLYARTHROPATHIES', 'ukb-a-52', 'ukb-b-2618', 'ukb-a-269', 'prot-a-1298', 'ebi-a-GCST004614', 'prot-a-1741', 'prot-a-1739', 'ieu-a-91', 'prot-a-2959', 'prot-a-500', 'ubm-a-800', 'ukb-d-K11_HERNIA', 'prot-a-2690', 'ukb-b-1572', 'ukb-a-94', 'ieu-a-1239', 'prot-a-613', 'prot-a-2039', 'prot-a-1791', 'prot-b-38', 'ebi-a-GCST006095', 'ukb-b-17788', 'ukb-b-14057', 'ubm-a-131', 'prot-a-1833', 'ukb-b-17616', 'prot-a-1688', 'ebi-a-GCST005212', 'ukb-b-15590', 'met-c-934', 'ebi-a-GCST004939', 'ubm-a-327', 'ukb-d-K11_GALLBILPANC', 'ieu-a-27', 'ukb-d-G6_NERPLEX', 'ukb-a-237', 'ukb-a-585', 'ebi-a-GCST004607', 'ukb-a-265', 'ukb-a-31', 'ukb-b-2221', 'ukb-a-423', 'ubm-a-805', 'prot-a-314', 'ebi-a-GCST004137', 'prot-a-2440', 'prot-a-3254', 'ukb-a-153', 'ebi-a-GCST006094', 'ukb-b-5262', 'ukb-d-H40', 'prot-a-518', 'ukb-b-1996', 'met-a-355', 'ukb-d-L72', 'prot-a-1129', 'prot-a-2906', 'ubm-a-550', 'ubm-a-511', 'prot-a-2733', 'ukb-b-4886', 'ukb-b-10215', 'ukb-b-9093', 'ubm-a-466', 'ukb-a-446', 'prot-a-37', 'ukb-b-13344', 'ukb-b-16858', 'prot-a-3191', 'ebi-a-GCST006586', 'ebi-a-GCST005846', 'ukb-b-7859', 'ukb-a-61', 'ubm-a-424', 'ieu-a-1082', 'ukb-d-30270_irnt', 'ukb-b-4414', 'ukb-b-15748', 'prot-a-420', 'ebi-a-GCST006947', 'prot-a-722', 'ukb-b-5445', 'ebi-a-GCST004422', 'ukb-b-151', 'ukb-b-5495', 'ukb-a-150', 'met-c-935', 'ebi-a-GCST004732', 'ukb-b-14177', 'ukb-a-9', 'ebi-a-GCST005843', 'prot-a-444', 'ukb-b-10169', 'ubm-a-413', 'ukb-b-4655', 'ubm-a-913', 'prot-a-982', 'prot-a-2616', 'ukb-a-50', 'prot-a-2820', 'met-a-661', 'prot-a-426', 'ieu-a-1232', 'ieu-a-48', 'met-c-911', 'ukb-b-17601', 'ukb-d-1747_6', 'met-c-849', 'ukb-b-8297', 'ieu-a-60', 'ukb-b-1511', 'prot-a-86', 'met-a-596', 'ieu-a-62', 'ieu-a-1015', 'ukb-a-300', 'ukb-b-14713', 'ieu-a-57', 'ukb-b-7408', 'ukb-b-12018', 'ebi-a-GCST005327', 'ieu-a-1024', 'ubm-a-561', 'ubm-a-810', 'prot-a-1530', 'ubm-a-494', 'met-c-841', 'met-a-467', 'ebi-a-GCST004901', 'prot-a-994', 'ukb-a-449', 'ukb-b-4000', 'prot-a-381', 'ieu-a-94', 'prot-a-648', 'ukb-a-285', 'prot-a-831', 'ukb-a-24', 'prot-a-1154', 'ieu-a-1283', 'ieu-a-1006', 'ukb-d-30630_raw', 'prot-a-445', 'prot-a-2008', 'ukb-b-7352', 'prot-a-2561', 'ukb-b-4068', 'ukb-b-17805', 'prot-b-6', 'met-a-656', 'ieu-a-24', 'ebi-a-GCST005180', 'ebi-a-GCST002223', 'prot-a-2396', 'ieu-a-9', 'prot-a-1526', 'ubm-a-501', 'ukb-d-30600_raw', 'prot-a-1655', 'ukb-b-6500', 'ukb-d-J45', 'ukb-a-261', 'ebi-a-GCST004575', 'ukb-b-8755', 'ubm-a-735', 'prot-a-366', 'ukb-b-5640', 'ukb-a-223', 'ukb-d-C3_BRONCHUS_LUNG', 'ukb-b-4630', 'ieu-a-1123', 'ukb-d-30790_raw', 'prot-a-1885', 'prot-a-1879', 'ieu-a-1060', 'prot-a-1223', 'ukb-d-30740_raw', 'ukb-b-3768', 'ubm-a-814', 'ukb-a-205', 'prot-a-1842', 'prot-a-2470', 'ieu-a-83', 'ubm-a-503', 'met-c-957', 'met-c-865', 'prot-a-2361', 'ukb-a-293', 'ebi-a-GCST005849', 'prot-a-3205', 'prot-b-48', 'ieu-a-67', 'prot-a-1837', 'ieu-a-274', 'ebi-a-GCST005232', 'ukb-d-30670_irnt', 'prot-a-197', 'ebi-a-GCST003116', 'ubm-a-520', 'prot-a-475', 'prot-a-1306', 'ukb-b-8846', 'ukb-a-450', 'ukb-b-4078', 'prot-a-2337', 'ieu-a-12', 'prot-a-212', 'prot-a-2194', 'ukb-b-8778', 'ubm-a-2649', 'prot-a-714', 'prot-a-1153', 'ebi-a-GCST004617', 'ieu-a-798', 'ieu-a-298', 'ukb-b-20175', 'prot-a-1414', 'ukb-b-12039', 'ukb-b-18194', 'ukb-b-5716', 'ukb-a-482', 'ukb-b-14360', 'prot-a-1644', 'prot-a-3214', 'ukb-b-14944', 'prot-a-220', 'prot-a-1305', 'ieu-a-837', 'ukb-b-18336', 'ukb-b-9961', 'prot-a-2025', 'ukb-b-14898', 'met-a-531', 'ukb-a-316', 'prot-a-884', 'prot-a-83', 'ukb-a-222', 'prot-a-1194', 'ubm-a-373', 'ubm-a-500', 'ukb-b-698', 'ubm-a-496', 'ukb-b-8072', 'ieu-a-792', 'met-c-946', 'ukb-b-11497', 'prot-b-71', 'ukb-b-12493', 'ukb-b-5213', 'ukb-a-35', 'ebi-a-GCST005840', 'prot-a-2948', 'ukb-d-VII_EYE_ADNEXA', 'met-c-890', 'prot-a-1587', 'ebi-a-GCST004632', 'ubm-a-410', 'ukb-d-5540_0', 'ebi-a-GCST004604', 'prot-a-1542', 'prot-a-932', 'ubm-a-2671', 'ukb-b-4171', 'ieu-a-990', 'ukb-d-H33', 'ukb-b-14926', 'ukb-b-4575', 'prot-a-1395', 'met-c-877', 'ukb-b-15555', 'prot-a-1403', 'prot-a-1049', 'ieu-a-971', 'ubm-a-130', 'ukb-b-18113', 'ukb-b-298', 'ukb-d-30670_raw', 'ukb-d-30750_irnt', 'ukb-b-14695', 'ukb-a-374', 'met-a-501', 'ukb-b-14540', 'ukb-d-2395_1', 'ukb-a-389', 'prot-a-2824', 'ubm-a-815', 'met-a-427', 'ukb-b-2002', 'prot-a-412', 'ukb-b-5379', 'prot-a-629', 'prot-a-564', 'ukb-d-30630_irnt', 'ieu-a-1052', 'ubm-a-169', 'prot-a-3200', 'prot-a-326', 'ukb-a-273', 'ubm-a-2650', 'prot-a-2397', 'ukb-d-M13_RHEUMA', 'ukb-d-30730_raw', 'prot-a-1511', 'ukb-b-12440', 'ukb-a-14', 'ukb-b-2953', 'ukb-a-248', 'prot-a-989', 'ebi-a-GCST001969', 'prot-a-1782', 'ieu-a-56', 'ukb-d-5012', 'ebi-a-GCST005527', 'ukb-a-267', 'met-a-629', 'ieu-a-1007', 'ukb-d-30850_raw', 'ieu-a-1', 'met-a-580', 'prot-a-2689', 'prot-a-2243', 'ukb-d-30620_irnt', 'prot-a-1045', 'ebi-a-GCST006366', 'prot-a-276', 'prot-a-1753', 'ukb-d-ASTHMA_EOSINOPHIL_SUGG', 'ukb-a-427', 'prot-a-387', 'ukb-d-I9_DISVEINLYMPH', 'prot-a-2362', 'ukb-d-K63', 'ukb-d-6020_33', 'prot-a-2877', 'ebi-a-GCST004603', 'ebi-a-GCST006910', 'prot-a-1800', 'met-a-618', 'prot-a-2920', 'ieu-a-294', 'prot-a-1506', 'prot-a-1486', 'prot-a-867', 'ukb-b-8121', 'met-c-879', 'prot-a-2129', 'ukb-b-5237', 'ubm-a-509', 'ukb-a-77', 'met-c-847', 'ubm-a-651', 'ubm-a-515', 'ukb-b-8875', 'met-c-904', 'ukb-a-459', 'prot-a-1836', 'ukb-a-521', 'met-c-922', 'ebi-a-GCST004824', 'ieu-a-1055', 'ieu-a-970', 'ukb-b-14068', 'ukb-b-16698', 'prot-a-2609', 'ukb-d-XVIII_MISCFINDINGS', 'ubm-a-144', 'ukb-b-5476', 'ukb-a-235', 'ubm-a-505', 'ieu-a-1047', 'ieu-a-1106', 'ukb-b-16606', 'ukb-b-8668', 'ukb-a-491', 'ukb-b-1285', 'prot-a-823', 'ubm-a-918', 'ukb-d-30250_irnt', 'prot-a-2666', 'ukb-b-16812', 'ubm-a-721', 'ukb-b-1209', 'prot-a-888', 'ukb-b-20124', 'ukb-b-17999', 'ubm-a-514', 'prot-a-408', 'ubm-a-2685', 'met-a-495', 'ukb-a-485', 'prot-a-99', 'prot-a-373', 'ubm-a-2666', 'prot-a-2007', 'prot-a-1610', 'ukb-b-6811', 'ukb-a-72', 'ukb-b-4094', 'prot-a-1938', 'ukb-a-424', 'ieu-a-85', 'ubm-a-412', 'ieu-a-107', 'prot-a-402', 'ieu-a-7', 'ukb-a-272', 'ukb-b-9127', 'ukb-b-6727', 'ukb-b-13348', 'ukb-b-15851', 'ukb-d-41231_1', 'prot-a-550', 'ubm-a-803', 'met-a-683', 'ubm-a-533', 'ebi-a-GCST005845', 'prot-a-2309', 'ukb-b-10181', 'ubm-a-2644', 'ukb-d-D17', 'prot-a-1443', 'prot-a-2811', 'prot-a-2247', 'ukb-b-5238', 'ebi-a-GCST002221', 'ebi-a-GCST006475', 'prot-a-1126', 'ubm-a-802', 'ukb-b-3672', 'ukb-a-536', 'met-a-578', 'ukb-d-30070_irnt', 'ieu-a-973', 'ukb-a-236', 'ukb-a-303', 'ieu-a-969', 'ebi-a-GCST006952', 'ukb-b-7910', 'ukb-d-PULM_MEDICATIO_COMORB', 'ebi-a-GCST006696', 'ukb-a-5', 'prot-a-2926', 'prot-a-1902', 'ukb-a-3', 'prot-a-334', 'prot-a-663', 'ukb-b-19393', 'ukb-b-16027', 'met-a-667', 'ieu-a-86', 'ukb-a-6', 'prot-a-67', 'ukb-a-30', 'ukb-b-12209', 'ukb-d-30130_irnt', 'prot-a-1499', 'ukb-a-344', 'ebi-a-GCST005185']\n",
      "with mr, exposure, outcome\n",
      "ORDER BY exposure.trait\n",
      "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, exposure.note,\n",
      "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
      "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, mr.pval, mr.b, mr.se, mr.moescore\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.sample_size</th>\n",
       "      <th>exposure.sex</th>\n",
       "      <th>exposure.note</th>\n",
       "      <th>year</th>\n",
       "      <th>author</th>\n",
       "      <th>consortium</th>\n",
       "      <th>outcome.id</th>\n",
       "      <th>outcome.sample_size</th>\n",
       "      <th>N_case</th>\n",
       "      <th>mr.pval</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.se</th>\n",
       "      <th>mr.moescore</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1165</td>\n",
       "      <td>37954.0</td>\n",
       "      <td>2900</td>\n",
       "      <td>0.500000</td>\n",
       "      <td>0.124119</td>\n",
       "      <td>0.124119</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1127</td>\n",
       "      <td>175475.0</td>\n",
       "      <td>69501</td>\n",
       "      <td>0.012762</td>\n",
       "      <td>-4.294414</td>\n",
       "      <td>1.724423</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1128</td>\n",
       "      <td>127442.0</td>\n",
       "      <td>21468</td>\n",
       "      <td>0.780908</td>\n",
       "      <td>0.885429</td>\n",
       "      <td>3.183436</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ukb-a-55</td>\n",
       "      <td>337159.0</td>\n",
       "      <td>7480</td>\n",
       "      <td>0.569689</td>\n",
       "      <td>-0.030093</td>\n",
       "      <td>0.052933</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>228951.0</td>\n",
       "      <td>122977</td>\n",
       "      <td>0.192254</td>\n",
       "      <td>-2.230371</td>\n",
       "      <td>1.710487</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35109</th>\n",
       "      <td>ubm-a-2685</td>\n",
       "      <td>volume Right-VentralDC</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1131</td>\n",
       "      <td>32498.0</td>\n",
       "      <td>14910</td>\n",
       "      <td>0.821754</td>\n",
       "      <td>-0.039192</td>\n",
       "      <td>0.173963</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35110</th>\n",
       "      <td>ubm-a-2685</td>\n",
       "      <td>volume Right-VentralDC</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1136</td>\n",
       "      <td>50225.0</td>\n",
       "      <td>7333</td>\n",
       "      <td>0.463249</td>\n",
       "      <td>0.153854</td>\n",
       "      <td>0.209752</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35111</th>\n",
       "      <td>ubm-a-2685</td>\n",
       "      <td>volume Right-VentralDC</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1129</td>\n",
       "      <td>106776.0</td>\n",
       "      <td>61282</td>\n",
       "      <td>0.230856</td>\n",
       "      <td>0.069494</td>\n",
       "      <td>0.058001</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35112</th>\n",
       "      <td>ubm-a-2685</td>\n",
       "      <td>volume Right-VentralDC</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1130</td>\n",
       "      <td>89677.0</td>\n",
       "      <td>46785</td>\n",
       "      <td>0.733248</td>\n",
       "      <td>0.018464</td>\n",
       "      <td>0.054178</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35113</th>\n",
       "      <td>ubm-a-2685</td>\n",
       "      <td>volume Right-VentralDC</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1137</td>\n",
       "      <td>22068.0</td>\n",
       "      <td>4480</td>\n",
       "      <td>0.733855</td>\n",
       "      <td>0.093671</td>\n",
       "      <td>0.275501</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>35114 rows × 15 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                       exposure.id          exposure.trait  \\\n",
       "0      ukb-d-M13_POLYARTHROPATHIES      #Polyarthropathies   \n",
       "1      ukb-d-M13_POLYARTHROPATHIES      #Polyarthropathies   \n",
       "2      ukb-d-M13_POLYARTHROPATHIES      #Polyarthropathies   \n",
       "3      ukb-d-M13_POLYARTHROPATHIES      #Polyarthropathies   \n",
       "4      ukb-d-M13_POLYARTHROPATHIES      #Polyarthropathies   \n",
       "...                            ...                     ...   \n",
       "35109                   ubm-a-2685  volume Right-VentralDC   \n",
       "35110                   ubm-a-2685  volume Right-VentralDC   \n",
       "35111                   ubm-a-2685  volume Right-VentralDC   \n",
       "35112                   ubm-a-2685  volume Right-VentralDC   \n",
       "35113                   ubm-a-2685  volume Right-VentralDC   \n",
       "\n",
       "      exposure.sample_size       exposure.sex exposure.note  year      author  \\\n",
       "0                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "1                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "2                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "3                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "4                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "...                    ...                ...           ...   ...         ...   \n",
       "35109               8411.0              Males          None  2018  Elliott LT   \n",
       "35110               8411.0              Males          None  2018  Elliott LT   \n",
       "35111               8411.0              Males          None  2018  Elliott LT   \n",
       "35112               8411.0              Males          None  2018  Elliott LT   \n",
       "35113               8411.0              Males          None  2018  Elliott LT   \n",
       "\n",
       "      consortium  outcome.id outcome.sample_size  N_case   mr.pval      mr.b  \\\n",
       "0           None  ieu-a-1165             37954.0    2900  0.500000  0.124119   \n",
       "1           None  ieu-a-1127            175475.0   69501  0.012762 -4.294414   \n",
       "2           None  ieu-a-1128            127442.0   21468  0.780908  0.885429   \n",
       "3           None    ukb-a-55            337159.0    7480  0.569689 -0.030093   \n",
       "4           None  ieu-a-1126            228951.0  122977  0.192254 -2.230371   \n",
       "...          ...         ...                 ...     ...       ...       ...   \n",
       "35109       None  ieu-a-1131             32498.0   14910  0.821754 -0.039192   \n",
       "35110       None  ieu-a-1136             50225.0    7333  0.463249  0.153854   \n",
       "35111       None  ieu-a-1129            106776.0   61282  0.230856  0.069494   \n",
       "35112       None  ieu-a-1130             89677.0   46785  0.733248  0.018464   \n",
       "35113       None  ieu-a-1137             22068.0    4480  0.733855  0.093671   \n",
       "\n",
       "          mr.se  mr.moescore  \n",
       "0      0.124119          1.0  \n",
       "1      1.724423          1.0  \n",
       "2      3.183436          1.0  \n",
       "3      0.052933          1.0  \n",
       "4      1.710487          1.0  \n",
       "...         ...          ...  \n",
       "35109  0.173963          1.0  \n",
       "35110  0.209752          1.0  \n",
       "35111  0.058001          1.0  \n",
       "35112  0.054178          1.0  \n",
       "35113  0.275501          1.0  \n",
       "\n",
       "[35114 rows x 15 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# now those traits that appered at least once in something at <1e05, \n",
    "# get MR results for those traits with all BC datasets\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id in {gwas_list} \n",
    "AND  exposure.id  in {exposure_list}\n",
    "with mr, exposure, outcome\n",
    "ORDER BY exposure.trait\n",
    "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, exposure.note,\n",
    "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
    "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, mr.pval, mr.b, mr.se, mr.moescore\n",
    "\"\"\".format(gwas_list = all_bc_gwas,\n",
    "           exposure_list = list(set(df['exposure.id'])))\n",
    "df = query_to_df(session, query, True)\n",
    "\n",
    "\n",
    "df.to_csv(\"query_results/bc_all_mr.tsv\", sep=\"\\t\", index=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Extract MR results for a list of exposure GWAS\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "WHERE outcome.id in ['ukb-a-519', 'ukb-a-55', 'ieu-a-1126', 'ieu-a-1127', 'ieu-a-1128', 'ieu-a-1129', 'ieu-a-1130', 'ieu-a-1132', 'ieu-a-1133', 'ieu-a-1135', 'ieu-a-1136', 'ieu-a-1131', 'ieu-a-1137', 'ieu-a-1134'] \n",
      "AND  exposure.id  in ['ukb-b-8764', 'ukb-b-7663', 'ukb-a-485', 'ukb-b-2115', 'ukb-b-13932', 'ukb-b-13184', 'ukb-a-483', 'ukb-a-482', 'ukb-a-487', 'ukb-a-512', 'ukb-b-15869', 'ukb-b-11495', 'ukb-b-8865', 'ukb-a-509', 'ukb-a-486', 'ukb-b-2346', 'ukb-b-7337', 'ukb-a-484', 'ukb-b-13702', 'ieu-a-1095', 'ieu-a-1004', 'ukb-b-4206', 'ukb-a-320', 'ukb-b-18541', 'ukb-a-317', 'ukb-b-1209', 'ukb-b-18105', 'ukb-b-17422', 'ukb-a-315', 'ukb-b-9547', 'ukb-b-12405', 'ukb-a-451', 'ukb-b-8727', 'ukb-b-4564', 'ukb-b-8080', 'ukb-a-322', 'ukb-b-9433', 'ukb-a-324', 'ukb-b-4193', 'ukb-b-3768', 'ukb-a-319', 'ukb-a-316', 'ukb-a-323', 'ukb-b-9509', 'ukb-b-16927', 'ukb-b-9487', 'ieu-a-29', 'ieu-a-27', 'ukb-b-13378', 'ieu-b-40', 'ieu-a-974', 'ukb-b-19953', 'ieu-a-1096', 'ukb-a-34', 'ukb-b-4650', 'ukb-a-35', 'ieu-a-1038', 'ieu-a-1035', 'ieu-a-87', 'ieu-a-97', 'ieu-a-1032', 'ieu-a-51', 'ieu-a-99', 'ukb-b-15590', 'ieu-a-57', 'ieu-a-101', 'ieu-a-90', 'ieu-a-91', 'ieu-a-92', 'ukb-b-16881', 'ukb-b-10787', 'ieu-a-103', 'ieu-a-63', 'ukb-b-9405', 'ieu-a-69', 'ieu-a-105', 'ieu-a-109', 'ieu-a-75', 'ieu-a-81', 'ieu-a-111', 'ukb-a-265', 'ukb-b-19393', 'ukb-a-266', 'ukb-b-13354']\n",
      "//AND mr.pval < 1e-05\n",
      "with mr, exposure, outcome\n",
      "ORDER BY exposure.trait\n",
      "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex,\n",
      "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, mr.pval, mr.b, mr.se\n",
      "        \n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.sample_size</th>\n",
       "      <th>exposure.sex</th>\n",
       "      <th>outcome.id</th>\n",
       "      <th>outcome.sample_size</th>\n",
       "      <th>N_case</th>\n",
       "      <th>mr.pval</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.se</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ukb-a-319</td>\n",
       "      <td>Age at first live birth</td>\n",
       "      <td>123846.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>337199.0</td>\n",
       "      <td>5510</td>\n",
       "      <td>0.558758</td>\n",
       "      <td>0.001719</td>\n",
       "      <td>0.002879</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ukb-a-319</td>\n",
       "      <td>Age at first live birth</td>\n",
       "      <td>123846.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ukb-a-55</td>\n",
       "      <td>337159.0</td>\n",
       "      <td>7480</td>\n",
       "      <td>0.816717</td>\n",
       "      <td>0.001187</td>\n",
       "      <td>0.005120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ukb-a-319</td>\n",
       "      <td>Age at first live birth</td>\n",
       "      <td>123846.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>228951.0</td>\n",
       "      <td>122977</td>\n",
       "      <td>0.013006</td>\n",
       "      <td>-0.262657</td>\n",
       "      <td>0.105756</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ukb-a-319</td>\n",
       "      <td>Age at first live birth</td>\n",
       "      <td>123846.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1127</td>\n",
       "      <td>175475.0</td>\n",
       "      <td>69501</td>\n",
       "      <td>0.789003</td>\n",
       "      <td>-0.034011</td>\n",
       "      <td>0.124982</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ukb-a-319</td>\n",
       "      <td>Age at first live birth</td>\n",
       "      <td>123846.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1128</td>\n",
       "      <td>127442.0</td>\n",
       "      <td>21468</td>\n",
       "      <td>0.618318</td>\n",
       "      <td>-0.171930</td>\n",
       "      <td>0.337429</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>596</th>\n",
       "      <td>ukb-a-266</td>\n",
       "      <td>Whole body fat-free mass</td>\n",
       "      <td>331291.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1136</td>\n",
       "      <td>50225.0</td>\n",
       "      <td>7333</td>\n",
       "      <td>0.000697</td>\n",
       "      <td>-0.342825</td>\n",
       "      <td>0.100251</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>597</th>\n",
       "      <td>ukb-a-266</td>\n",
       "      <td>Whole body fat-free mass</td>\n",
       "      <td>331291.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1131</td>\n",
       "      <td>32498.0</td>\n",
       "      <td>14910</td>\n",
       "      <td>0.042964</td>\n",
       "      <td>-0.177672</td>\n",
       "      <td>0.087480</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>598</th>\n",
       "      <td>ukb-a-266</td>\n",
       "      <td>Whole body fat-free mass</td>\n",
       "      <td>331291.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1130</td>\n",
       "      <td>89677.0</td>\n",
       "      <td>46785</td>\n",
       "      <td>0.582227</td>\n",
       "      <td>0.038816</td>\n",
       "      <td>0.070557</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>599</th>\n",
       "      <td>ukb-a-266</td>\n",
       "      <td>Whole body fat-free mass</td>\n",
       "      <td>331291.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1132</td>\n",
       "      <td>83691.0</td>\n",
       "      <td>38197</td>\n",
       "      <td>0.862899</td>\n",
       "      <td>0.007952</td>\n",
       "      <td>0.046012</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>600</th>\n",
       "      <td>ukb-a-266</td>\n",
       "      <td>Whole body fat-free mass</td>\n",
       "      <td>331291.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>ieu-a-1133</td>\n",
       "      <td>69970.0</td>\n",
       "      <td>27078</td>\n",
       "      <td>0.763215</td>\n",
       "      <td>-0.014564</td>\n",
       "      <td>0.048345</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>601 rows × 10 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    exposure.id            exposure.trait exposure.sample_size  \\\n",
       "0     ukb-a-319   Age at first live birth             123846.0   \n",
       "1     ukb-a-319   Age at first live birth             123846.0   \n",
       "2     ukb-a-319   Age at first live birth             123846.0   \n",
       "3     ukb-a-319   Age at first live birth             123846.0   \n",
       "4     ukb-a-319   Age at first live birth             123846.0   \n",
       "..          ...                       ...                  ...   \n",
       "596   ukb-a-266  Whole body fat-free mass             331291.0   \n",
       "597   ukb-a-266  Whole body fat-free mass             331291.0   \n",
       "598   ukb-a-266  Whole body fat-free mass             331291.0   \n",
       "599   ukb-a-266  Whole body fat-free mass             331291.0   \n",
       "600   ukb-a-266  Whole body fat-free mass             331291.0   \n",
       "\n",
       "          exposure.sex  outcome.id outcome.sample_size  N_case   mr.pval  \\\n",
       "0    Males and Females   ukb-a-519            337199.0    5510  0.558758   \n",
       "1    Males and Females    ukb-a-55            337159.0    7480  0.816717   \n",
       "2    Males and Females  ieu-a-1126            228951.0  122977  0.013006   \n",
       "3    Males and Females  ieu-a-1127            175475.0   69501  0.789003   \n",
       "4    Males and Females  ieu-a-1128            127442.0   21468  0.618318   \n",
       "..                 ...         ...                 ...     ...       ...   \n",
       "596  Males and Females  ieu-a-1136             50225.0    7333  0.000697   \n",
       "597  Males and Females  ieu-a-1131             32498.0   14910  0.042964   \n",
       "598  Males and Females  ieu-a-1130             89677.0   46785  0.582227   \n",
       "599  Males and Females  ieu-a-1132             83691.0   38197  0.862899   \n",
       "600  Males and Females  ieu-a-1133             69970.0   27078  0.763215   \n",
       "\n",
       "         mr.b     mr.se  \n",
       "0    0.001719  0.002879  \n",
       "1    0.001187  0.005120  \n",
       "2   -0.262657  0.105756  \n",
       "3   -0.034011  0.124982  \n",
       "4   -0.171930  0.337429  \n",
       "..        ...       ...  \n",
       "596 -0.342825  0.100251  \n",
       "597 -0.177672  0.087480  \n",
       "598  0.038816  0.070557  \n",
       "599  0.007952  0.046012  \n",
       "600 -0.014564  0.048345  \n",
       "\n",
       "[601 rows x 10 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# read list of exp gwas (EXTRACTED IN R)\n",
    "risk_factors = list(pd.read_csv(\"query_results/gwas_rf_list.txt\", sep = '\\t')['id'])\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id in {gwas_list_outcome} \n",
    "AND  exposure.id  in {gwas_list_exposure}\n",
    "//AND mr.pval < 1e-05\n",
    "with mr, exposure, outcome\n",
    "ORDER BY exposure.trait\n",
    "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex,exposure.note,\n",
    "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, mr.pval, mr.b, mr.se, mr.moescore\n",
    "        \n",
    "\"\"\".format(gwas_list_outcome = all_bc_gwas,\n",
    "           gwas_list_exposure = risk_factors )\n",
    "df = query_to_df(session, query, True)\n",
    "\n",
    "\n",
    "df.to_csv(\"query_results/gwas_rf_bc_all_mr.tsv\", sep=\"\\t\", index=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Correlation "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (trait:Gwas)-[gen_cor:GEN_COR]-(assoc_trait:Gwas)\n",
      "where assoc_trait.id in ['ukb-a-519']\n",
      "match (trait:Gwas)-[mr:MR_EVE_MR]->(assoc_trait:Gwas)\n",
      "//where mr.pval < 1e-03\n",
      "return distinct trait.trait, trait.id, gen_cor.rg, assoc_trait.trait, assoc_trait.id, mr.b, mr.pval\n",
      "order by gen_cor.rg desc\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>trait.trait</th>\n",
       "      <th>trait.id</th>\n",
       "      <th>gen_cor.rg</th>\n",
       "      <th>assoc_trait.trait</th>\n",
       "      <th>assoc_trait.id</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.pval</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Number of self-reported cancers</td>\n",
       "      <td>ukb-a-21</td>\n",
       "      <td>0.8279</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>0.077594</td>\n",
       "      <td>1.850559e-02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Had other major operations</td>\n",
       "      <td>ukb-a-326</td>\n",
       "      <td>0.2660</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>0.026946</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Breastfed as a baby</td>\n",
       "      <td>ukb-a-33</td>\n",
       "      <td>0.2471</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.012162</td>\n",
       "      <td>5.060810e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Headaches for 3+ months</td>\n",
       "      <td>ukb-a-354</td>\n",
       "      <td>0.1980</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.017729</td>\n",
       "      <td>3.182665e-29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Qualifications: NVQ or HND or HNC or equivalent</td>\n",
       "      <td>ukb-a-402</td>\n",
       "      <td>0.1885</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>0.026366</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>260</th>\n",
       "      <td>Reason for glasses/contact lenses: For 'astigm...</td>\n",
       "      <td>ukb-a-422</td>\n",
       "      <td>-0.1279</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.077385</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>261</th>\n",
       "      <td>Diagnoses - main ICD10: I21 Acute myocardial i...</td>\n",
       "      <td>ukb-a-533</td>\n",
       "      <td>-0.1304</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.057651</td>\n",
       "      <td>5.647018e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>262</th>\n",
       "      <td>Number of days/week of vigorous physical activ...</td>\n",
       "      <td>ukb-a-511</td>\n",
       "      <td>-0.1306</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.006864</td>\n",
       "      <td>3.821609e-02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263</th>\n",
       "      <td>Mineral and other dietary supplements: None of...</td>\n",
       "      <td>ukb-a-493</td>\n",
       "      <td>-0.1405</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.014608</td>\n",
       "      <td>6.539805e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>264</th>\n",
       "      <td>Types of transport used (excluding work): Car/...</td>\n",
       "      <td>ukb-a-478</td>\n",
       "      <td>-0.1570</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.033081</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>265 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           trait.trait   trait.id  gen_cor.rg  \\\n",
       "0                      Number of self-reported cancers   ukb-a-21      0.8279   \n",
       "1                           Had other major operations  ukb-a-326      0.2660   \n",
       "2                                  Breastfed as a baby   ukb-a-33      0.2471   \n",
       "3                              Headaches for 3+ months  ukb-a-354      0.1980   \n",
       "4      Qualifications: NVQ or HND or HNC or equivalent  ukb-a-402      0.1885   \n",
       "..                                                 ...        ...         ...   \n",
       "260  Reason for glasses/contact lenses: For 'astigm...  ukb-a-422     -0.1279   \n",
       "261  Diagnoses - main ICD10: I21 Acute myocardial i...  ukb-a-533     -0.1304   \n",
       "262  Number of days/week of vigorous physical activ...  ukb-a-511     -0.1306   \n",
       "263  Mineral and other dietary supplements: None of...  ukb-a-493     -0.1405   \n",
       "264  Types of transport used (excluding work): Car/...  ukb-a-478     -0.1570   \n",
       "\n",
       "                                     assoc_trait.trait assoc_trait.id  \\\n",
       "0    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "1    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "2    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "3    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "4    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "..                                                 ...            ...   \n",
       "260  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "261  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "262  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "263  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "264  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "\n",
       "         mr.b       mr.pval  \n",
       "0    0.077594  1.850559e-02  \n",
       "1    0.026946  5.000000e-01  \n",
       "2   -0.012162  5.060810e-01  \n",
       "3   -0.017729  3.182665e-29  \n",
       "4    0.026366  5.000000e-01  \n",
       "..        ...           ...  \n",
       "260 -0.077385  5.000000e-01  \n",
       "261 -0.057651  5.647018e-01  \n",
       "262 -0.006864  3.821609e-02  \n",
       "263 -0.014608  6.539805e-01  \n",
       "264 -0.033081  5.000000e-01  \n",
       "\n",
       "[265 rows x 7 columns]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find which traits are highly correlated with UKB cancers\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (trait:Gwas)-[gen_cor:GEN_COR]-(assoc_trait:Gwas)\n",
    "where assoc_trait.id in ['ukb-a-519']\n",
    "match (trait:Gwas)-[mr:MR_EVE_MR]->(assoc_trait:Gwas)\n",
    "//where mr.pval < 1e-03\n",
    "return distinct trait.trait, trait.id, gen_cor.rg, assoc_trait.trait, assoc_trait.id, mr.b, mr.pval\n",
    "order by gen_cor.rg desc\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "df\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
