{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "38687\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "import json\n",
    "from environs import Env\n",
    "from graph_functions import query_to_df,start_graph_session, start_graph_session_crashdown_w_auth\n",
    "from IPython.display import Image\n",
    "\n",
    "\n",
    "env = Env()\n",
    "#session = start_graph_session(env) \n",
    "session = start_graph_session_crashdown_w_auth(env) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## List of all breast-related GWAS"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (gwas:Gwas)\n",
      "where toLower(gwas.trait) contains \"breast\"\n",
      "and not(toLower(gwas.trait) contains \"baby\") \n",
      "and not(toLower(gwas.trait) contains \"mother\")\n",
      "and not(toLower(gwas.trait) contains \"sibling\")\n",
      "and not(toLower(gwas.trait) contains \"mammogram\")\n",
      "return distinct gwas.trait, gwas.id, gwas.sample_size as SampleSize,\n",
      "toInteger(gwas.ncase) as N_case, toInteger(gwas.ncontrol) as N_control, gwas.author, gwas.year, gwas.consortium\n",
      "order by SampleSize desc\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>gwas.trait</th>\n",
       "      <th>gwas.id</th>\n",
       "      <th>SampleSize</th>\n",
       "      <th>N_case</th>\n",
       "      <th>N_control</th>\n",
       "      <th>gwas.author</th>\n",
       "      <th>gwas.year</th>\n",
       "      <th>gwas.consortium</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Other disorders of breast</td>\n",
       "      <td>finn-a-N14_BREASTDISOTH</td>\n",
       "      <td>None</td>\n",
       "      <td>594.0</td>\n",
       "      <td>50767.0</td>\n",
       "      <td>None</td>\n",
       "      <td>2020.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Malignant neoplasm of breast</td>\n",
       "      <td>finn-a-C3_BREAST</td>\n",
       "      <td>None</td>\n",
       "      <td>2589.0</td>\n",
       "      <td>93910.0</td>\n",
       "      <td>None</td>\n",
       "      <td>2020.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Malignant neoplasm of breast</td>\n",
       "      <td>finn-a-C3_BREAST_3</td>\n",
       "      <td>None</td>\n",
       "      <td>2589.0</td>\n",
       "      <td>93910.0</td>\n",
       "      <td>None</td>\n",
       "      <td>2020.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Carcinoma in situ of breast (ICD C excluded)</td>\n",
       "      <td>finn-a-CD2_INSITU_BREAST_EXALLC</td>\n",
       "      <td>None</td>\n",
       "      <td>377.0</td>\n",
       "      <td>87024.0</td>\n",
       "      <td>None</td>\n",
       "      <td>2020.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Carcinoma in situ of breast</td>\n",
       "      <td>finn-a-CD2_INSITU_BREAST</td>\n",
       "      <td>None</td>\n",
       "      <td>377.0</td>\n",
       "      <td>96122.0</td>\n",
       "      <td>None</td>\n",
       "      <td>2020.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>ER- Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1166</td>\n",
       "      <td>21695.0</td>\n",
       "      <td>3611.0</td>\n",
       "      <td>18084.0</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>BCAC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66</th>\n",
       "      <td>ER+ Breast cancer (Combined Oncoarray; iCOGS; ...</td>\n",
       "      <td>ieu-a-1127</td>\n",
       "      <td>175475.0</td>\n",
       "      <td>69501.0</td>\n",
       "      <td>105974.0</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>Breast cancer</td>\n",
       "      <td>ebi-a-GCST004988</td>\n",
       "      <td>139274.0</td>\n",
       "      <td>76192.0</td>\n",
       "      <td>63082.0</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>68</th>\n",
       "      <td>ER- Breast cancer (Combined Oncoarray; iCOGS; ...</td>\n",
       "      <td>ieu-a-1128</td>\n",
       "      <td>127442.0</td>\n",
       "      <td>21468.0</td>\n",
       "      <td>105974.0</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1129</td>\n",
       "      <td>106776.0</td>\n",
       "      <td>61282.0</td>\n",
       "      <td>45494.0</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>70 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           gwas.trait  \\\n",
       "0                           Other disorders of breast   \n",
       "1                        Malignant neoplasm of breast   \n",
       "2                        Malignant neoplasm of breast   \n",
       "3        Carcinoma in situ of breast (ICD C excluded)   \n",
       "4                         Carcinoma in situ of breast   \n",
       "..                                                ...   \n",
       "65                           ER- Breast cancer (GWAS)   \n",
       "66  ER+ Breast cancer (Combined Oncoarray; iCOGS; ...   \n",
       "67                                      Breast cancer   \n",
       "68  ER- Breast cancer (Combined Oncoarray; iCOGS; ...   \n",
       "69                          Breast cancer (Oncoarray)   \n",
       "\n",
       "                            gwas.id SampleSize   N_case  N_control  \\\n",
       "0           finn-a-N14_BREASTDISOTH       None    594.0    50767.0   \n",
       "1                  finn-a-C3_BREAST       None   2589.0    93910.0   \n",
       "2                finn-a-C3_BREAST_3       None   2589.0    93910.0   \n",
       "3   finn-a-CD2_INSITU_BREAST_EXALLC       None    377.0    87024.0   \n",
       "4          finn-a-CD2_INSITU_BREAST       None    377.0    96122.0   \n",
       "..                              ...        ...      ...        ...   \n",
       "65                       ieu-a-1166    21695.0   3611.0    18084.0   \n",
       "66                       ieu-a-1127   175475.0  69501.0   105974.0   \n",
       "67                 ebi-a-GCST004988   139274.0  76192.0    63082.0   \n",
       "68                       ieu-a-1128   127442.0  21468.0   105974.0   \n",
       "69                       ieu-a-1129   106776.0  61282.0    45494.0   \n",
       "\n",
       "      gwas.author gwas.year gwas.consortium  \n",
       "0            None    2020.0            None  \n",
       "1            None    2020.0            None  \n",
       "2            None    2020.0            None  \n",
       "3            None    2020.0            None  \n",
       "4            None    2020.0            None  \n",
       "..            ...       ...             ...  \n",
       "65  Michailidou K    2015.0            BCAC  \n",
       "66  Michailidou K    2017.0            BCAC  \n",
       "67  Michailidou K    2017.0            None  \n",
       "68  Michailidou K    2017.0            BCAC  \n",
       "69  Michailidou K    2017.0            BCAC  \n",
       "\n",
       "[70 rows x 8 columns]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (gwas:Gwas)\n",
    "where toLower(gwas.trait) contains \"breast\"\n",
    "and not(toLower(gwas.trait) contains \"baby\") \n",
    "and not(toLower(gwas.trait) contains \"mother\")\n",
    "and not(toLower(gwas.trait) contains \"sibling\")\n",
    "and not(toLower(gwas.trait) contains \"mammogram\")\n",
    "return distinct gwas.trait, gwas.id, gwas.sample_size as SampleSize,\n",
    "toInteger(gwas.ncase) as N_case, toInteger(gwas.ncontrol) as N_control, gwas.author, gwas.year, gwas.consortium\n",
    "order by SampleSize desc\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "#df.to_csv(\"query_results/bc_all_related_gwas.tsv\", sep=\"\\t\", index=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Get BC GWAS that have MR results + exclude unrelated"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (gwas:Gwas)<-[mr:MR_EVE_MR]-(othergwas:Gwas)\n",
      "where toLower(gwas.trait) contains \"breast\"\n",
      "    and not(toLower(gwas.trait) contains \"baby\") \n",
      "    and not(toLower(gwas.trait) contains \"mother\")\n",
      "    and not(toLower(gwas.trait) contains \"sibling\")\n",
      "    and not(toLower(gwas.trait) contains \"mammogram\")\n",
      "    and not(toLower(gwas.trait) contains \"protein\")\n",
      "return distinct gwas.trait, gwas.id, toInteger(gwas.sample_size) as SampleSize,\n",
      "toInteger(gwas.ncase) as N_case, toInteger(gwas.ncontrol) as N_control, gwas.author, gwas.year, gwas.consortium\n",
      "order by gwas.id,  gwas.author, N_case desc\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>gwas.trait</th>\n",
       "      <th>gwas.id</th>\n",
       "      <th>SampleSize</th>\n",
       "      <th>N_case</th>\n",
       "      <th>N_control</th>\n",
       "      <th>gwas.author</th>\n",
       "      <th>gwas.year</th>\n",
       "      <th>gwas.consortium</th>\n",
       "      <th>case_percent</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Breast cancer</td>\n",
       "      <td>ebi-a-GCST004988</td>\n",
       "      <td>139274</td>\n",
       "      <td>76192</td>\n",
       "      <td>63082</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>None</td>\n",
       "      <td>54.706550</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Breast cancer</td>\n",
       "      <td>ebi-a-GCST007236</td>\n",
       "      <td>89677</td>\n",
       "      <td>46785</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>None</td>\n",
       "      <td>52.170568</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Breast cancer (Combined Oncoarray; iCOGS; GWAS...</td>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>228951</td>\n",
       "      <td>122977</td>\n",
       "      <td>105974</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>53.713240</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ER+ Breast cancer (Combined Oncoarray; iCOGS; ...</td>\n",
       "      <td>ieu-a-1127</td>\n",
       "      <td>175475</td>\n",
       "      <td>69501</td>\n",
       "      <td>105974</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>39.607351</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ER- Breast cancer (Combined Oncoarray; iCOGS; ...</td>\n",
       "      <td>ieu-a-1128</td>\n",
       "      <td>127442</td>\n",
       "      <td>21468</td>\n",
       "      <td>105974</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>16.845310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1129</td>\n",
       "      <td>106776</td>\n",
       "      <td>61282</td>\n",
       "      <td>45494</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>57.393047</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1130</td>\n",
       "      <td>89677</td>\n",
       "      <td>46785</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>52.170568</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1131</td>\n",
       "      <td>32498</td>\n",
       "      <td>14910</td>\n",
       "      <td>17588</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>45.879746</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ER+ Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1132</td>\n",
       "      <td>83691</td>\n",
       "      <td>38197</td>\n",
       "      <td>45494</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>45.640511</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ER+ Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1133</td>\n",
       "      <td>69970</td>\n",
       "      <td>27078</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>38.699443</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>ER+ Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1134</td>\n",
       "      <td>21814</td>\n",
       "      <td>4226</td>\n",
       "      <td>17588</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>19.372880</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>ER- Breast cancer (Oncoarray)</td>\n",
       "      <td>ieu-a-1135</td>\n",
       "      <td>55149</td>\n",
       "      <td>9655</td>\n",
       "      <td>45494</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>17.507117</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ER- Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1136</td>\n",
       "      <td>50225</td>\n",
       "      <td>7333</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>14.600299</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>ER- Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1137</td>\n",
       "      <td>22068</td>\n",
       "      <td>4480</td>\n",
       "      <td>17588</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>20.300888</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>ER- Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1160</td>\n",
       "      <td>50225</td>\n",
       "      <td>7333</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>14.600299</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>ER+ Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1161</td>\n",
       "      <td>69970</td>\n",
       "      <td>27078</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>38.699443</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Breast cancer (iCOGS)</td>\n",
       "      <td>ieu-a-1162</td>\n",
       "      <td>89677</td>\n",
       "      <td>46785</td>\n",
       "      <td>42892</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>52.170568</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>ER- Breast cancer (Survival)</td>\n",
       "      <td>ieu-a-1163</td>\n",
       "      <td>6881</td>\n",
       "      <td>920</td>\n",
       "      <td>5961</td>\n",
       "      <td>Guo Q</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>13.370150</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>ER+ Breast cancer (Survival)</td>\n",
       "      <td>ieu-a-1164</td>\n",
       "      <td>23059</td>\n",
       "      <td>1333</td>\n",
       "      <td>21726</td>\n",
       "      <td>Guo Q</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>5.780823</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Breast cancer (Survival)</td>\n",
       "      <td>ieu-a-1165</td>\n",
       "      <td>37954</td>\n",
       "      <td>2900</td>\n",
       "      <td>35054</td>\n",
       "      <td>Guo Q</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>7.640828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>ER- Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1166</td>\n",
       "      <td>21695</td>\n",
       "      <td>3611</td>\n",
       "      <td>18084</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>16.644388</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>ER+ Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1167</td>\n",
       "      <td>22286</td>\n",
       "      <td>4202</td>\n",
       "      <td>18084</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>18.854886</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Breast cancer (GWAS)</td>\n",
       "      <td>ieu-a-1168</td>\n",
       "      <td>33832</td>\n",
       "      <td>15748</td>\n",
       "      <td>18084</td>\n",
       "      <td>Michailidou K</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>BCAC</td>\n",
       "      <td>46.547647</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Cancer code  self-reported: breast cancer</td>\n",
       "      <td>ukb-a-55</td>\n",
       "      <td>337159</td>\n",
       "      <td>7480</td>\n",
       "      <td>329679</td>\n",
       "      <td>Neale</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>Neale Lab</td>\n",
       "      <td>2.218538</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Cancer code, self-reported: breast cancer</td>\n",
       "      <td>ukb-b-16890</td>\n",
       "      <td>462933</td>\n",
       "      <td>10303</td>\n",
       "      <td>452630</td>\n",
       "      <td>Ben Elsworth</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>MRC-IEU</td>\n",
       "      <td>2.225592</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>Malignant neoplasm of breast</td>\n",
       "      <td>ukb-d-C3_BREAST_3</td>\n",
       "      <td>361194</td>\n",
       "      <td>9721</td>\n",
       "      <td>351473</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>None</td>\n",
       "      <td>2.691351</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           gwas.trait            gwas.id  \\\n",
       "0                                       Breast cancer   ebi-a-GCST004988   \n",
       "1                                       Breast cancer   ebi-a-GCST007236   \n",
       "2   Breast cancer (Combined Oncoarray; iCOGS; GWAS...         ieu-a-1126   \n",
       "3   ER+ Breast cancer (Combined Oncoarray; iCOGS; ...         ieu-a-1127   \n",
       "4   ER- Breast cancer (Combined Oncoarray; iCOGS; ...         ieu-a-1128   \n",
       "5                           Breast cancer (Oncoarray)         ieu-a-1129   \n",
       "6                               Breast cancer (iCOGS)         ieu-a-1130   \n",
       "7                                Breast cancer (GWAS)         ieu-a-1131   \n",
       "8                       ER+ Breast cancer (Oncoarray)         ieu-a-1132   \n",
       "9                           ER+ Breast cancer (iCOGS)         ieu-a-1133   \n",
       "10                           ER+ Breast cancer (GWAS)         ieu-a-1134   \n",
       "11                      ER- Breast cancer (Oncoarray)         ieu-a-1135   \n",
       "12                          ER- Breast cancer (iCOGS)         ieu-a-1136   \n",
       "13                           ER- Breast cancer (GWAS)         ieu-a-1137   \n",
       "14                          ER- Breast cancer (iCOGS)         ieu-a-1160   \n",
       "15                          ER+ Breast cancer (iCOGS)         ieu-a-1161   \n",
       "16                              Breast cancer (iCOGS)         ieu-a-1162   \n",
       "17                       ER- Breast cancer (Survival)         ieu-a-1163   \n",
       "18                       ER+ Breast cancer (Survival)         ieu-a-1164   \n",
       "19                           Breast cancer (Survival)         ieu-a-1165   \n",
       "20                           ER- Breast cancer (GWAS)         ieu-a-1166   \n",
       "21                           ER+ Breast cancer (GWAS)         ieu-a-1167   \n",
       "22                               Breast cancer (GWAS)         ieu-a-1168   \n",
       "24          Cancer code  self-reported: breast cancer           ukb-a-55   \n",
       "30          Cancer code, self-reported: breast cancer        ukb-b-16890   \n",
       "47                       Malignant neoplasm of breast  ukb-d-C3_BREAST_3   \n",
       "\n",
       "    SampleSize  N_case  N_control    gwas.author gwas.year gwas.consortium  \\\n",
       "0       139274   76192      63082  Michailidou K    2017.0            None   \n",
       "1        89677   46785      42892  Michailidou K    2015.0            None   \n",
       "2       228951  122977     105974  Michailidou K    2017.0            BCAC   \n",
       "3       175475   69501     105974  Michailidou K    2017.0            BCAC   \n",
       "4       127442   21468     105974  Michailidou K    2017.0            BCAC   \n",
       "5       106776   61282      45494  Michailidou K    2017.0            BCAC   \n",
       "6        89677   46785      42892  Michailidou K    2017.0            BCAC   \n",
       "7        32498   14910      17588  Michailidou K    2017.0            BCAC   \n",
       "8        83691   38197      45494  Michailidou K    2017.0            BCAC   \n",
       "9        69970   27078      42892  Michailidou K    2017.0            BCAC   \n",
       "10       21814    4226      17588  Michailidou K    2017.0            BCAC   \n",
       "11       55149    9655      45494  Michailidou K    2017.0            BCAC   \n",
       "12       50225    7333      42892  Michailidou K    2017.0            BCAC   \n",
       "13       22068    4480      17588  Michailidou K    2017.0            BCAC   \n",
       "14       50225    7333      42892  Michailidou K    2015.0            BCAC   \n",
       "15       69970   27078      42892  Michailidou K    2015.0            BCAC   \n",
       "16       89677   46785      42892  Michailidou K    2015.0            BCAC   \n",
       "17        6881     920       5961          Guo Q    2015.0            BCAC   \n",
       "18       23059    1333      21726          Guo Q    2015.0            BCAC   \n",
       "19       37954    2900      35054          Guo Q    2015.0            BCAC   \n",
       "20       21695    3611      18084  Michailidou K    2015.0            BCAC   \n",
       "21       22286    4202      18084  Michailidou K    2015.0            BCAC   \n",
       "22       33832   15748      18084  Michailidou K    2015.0            BCAC   \n",
       "24      337159    7480     329679          Neale    2017.0       Neale Lab   \n",
       "30      462933   10303     452630   Ben Elsworth    2018.0         MRC-IEU   \n",
       "47      361194    9721     351473      Neale lab    2018.0            None   \n",
       "\n",
       "    case_percent  \n",
       "0      54.706550  \n",
       "1      52.170568  \n",
       "2      53.713240  \n",
       "3      39.607351  \n",
       "4      16.845310  \n",
       "5      57.393047  \n",
       "6      52.170568  \n",
       "7      45.879746  \n",
       "8      45.640511  \n",
       "9      38.699443  \n",
       "10     19.372880  \n",
       "11     17.507117  \n",
       "12     14.600299  \n",
       "13     20.300888  \n",
       "14     14.600299  \n",
       "15     38.699443  \n",
       "16     52.170568  \n",
       "17     13.370150  \n",
       "18      5.780823  \n",
       "19      7.640828  \n",
       "20     16.644388  \n",
       "21     18.854886  \n",
       "22     46.547647  \n",
       "24      2.218538  \n",
       "30      2.225592  \n",
       "47      2.691351  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (gwas:Gwas)<-[mr:MR_EVE_MR]-(othergwas:Gwas)\n",
    "where toLower(gwas.trait) contains \"breast\"\n",
    "    and not(toLower(gwas.trait) contains \"baby\") \n",
    "    and not(toLower(gwas.trait) contains \"mother\")\n",
    "    and not(toLower(gwas.trait) contains \"sibling\")\n",
    "    and not(toLower(gwas.trait) contains \"mammogram\")\n",
    "    and not(toLower(gwas.trait) contains \"protein\")\n",
    "return distinct gwas.trait, gwas.id, toInteger(gwas.sample_size) as SampleSize,\n",
    "toInteger(gwas.ncase) as N_case, toInteger(gwas.ncontrol) as N_control, gwas.author, gwas.year, gwas.consortium\n",
    "order by gwas.id,  gwas.author, N_case desc\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "#df.to_csv(\"query_results/bc_gwas_with_mr.tsv\", sep=\"\\t\", index=False)\n",
    "\n",
    "# calulate cases % in the dataset and only keep those >2%\n",
    "df['case_percent'] = df['N_case']/df['SampleSize']*100\n",
    "df = df[df['case_percent'] > 2]\n",
    "\n",
    "\n",
    "#df.to_csv(\"query_results/bc_gwas_with_mr_keep.tsv\", sep=\"\\t\", index=False)\n",
    "all_bc_gwas = list(df['gwas.id'])\n",
    "df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['ebi-a-GCST004988',\n",
       " 'ebi-a-GCST007236',\n",
       " 'ieu-a-1126',\n",
       " 'ieu-a-1127',\n",
       " 'ieu-a-1128',\n",
       " 'ieu-a-1129',\n",
       " 'ieu-a-1130',\n",
       " 'ieu-a-1131',\n",
       " 'ieu-a-1132',\n",
       " 'ieu-a-1133',\n",
       " 'ieu-a-1134',\n",
       " 'ieu-a-1135',\n",
       " 'ieu-a-1136',\n",
       " 'ieu-a-1137',\n",
       " 'ieu-a-1160',\n",
       " 'ieu-a-1161',\n",
       " 'ieu-a-1162',\n",
       " 'ieu-a-1163',\n",
       " 'ieu-a-1164',\n",
       " 'ieu-a-1165',\n",
       " 'ieu-a-1166',\n",
       " 'ieu-a-1167',\n",
       " 'ieu-a-1168',\n",
       " 'ukb-a-55',\n",
       " 'ukb-b-16890',\n",
       " 'ukb-d-C3_BREAST_3']"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "all_bc_gwas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['ieu-a-1126', 'ieu-a-1127', 'ieu-a-1128', 'ieu-a-1129', 'ieu-a-1130', 'ieu-a-1131', 'ieu-a-1132', 'ieu-a-1133', 'ieu-a-1134', 'ieu-a-1135', 'ieu-a-1136', 'ieu-a-1137', 'ieu-a-1160', 'ieu-a-1161', 'ieu-a-1162', 'ieu-a-1163', 'ieu-a-1164', 'ieu-a-1165', 'ieu-a-1166', 'ieu-a-1167', 'ieu-a-1168', 'ukb-a-55', 'ukb-b-16890', 'ukb-d-C3_BREAST_3']\n"
     ]
    }
   ],
   "source": [
    "# ebi-a-GCST007236 data is messed up - exclude\n",
    "all_bc_gwas.remove('ebi-a-GCST007236')\n",
    "all_bc_gwas.remove('ebi-a-GCST004988')\n",
    "print(all_bc_gwas)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Review MR data for the main dataset"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "WHERE outcome.id = \"ieu-a-1126\"  \n",
      "AND (not (toLower(exposure.trait) contains 'breast')) \n",
      "AND mr.pval < 1e-05\n",
      "RETURN exposure {.id, .trait}, outcome.id, mr {.b, .pval, .method, .selection, .moescore} ORDER BY mr.pval\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>outcome.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.method</th>\n",
       "      <th>mr.selection</th>\n",
       "      <th>mr.pval</th>\n",
       "      <th>mr.moescore</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Ever addicted to alcohol</td>\n",
       "      <td>ukb-d-20406</td>\n",
       "      <td>-0.054825</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>0.000000e+00</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Diagnoses - secondary ICD10: K44.9 Diaphragmat...</td>\n",
       "      <td>ukb-b-3672</td>\n",
       "      <td>-1.542995</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>4.514856e-242</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Killer cell immunoglobulin-like receptor 2DL5A</td>\n",
       "      <td>prot-a-1644</td>\n",
       "      <td>0.016679</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>4.770365e-106</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Ever had hysterectomy (womb removed)</td>\n",
       "      <td>ukb-b-6445</td>\n",
       "      <td>-1.562231</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>9.686474e-86</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Operation code: bunion/hallus valgus surgery</td>\n",
       "      <td>ukb-b-9190</td>\n",
       "      <td>1.109370</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.334299e-85</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Vascular endothelial growth factor A, isoform 121</td>\n",
       "      <td>prot-a-3197</td>\n",
       "      <td>0.013410</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>7.992747e-83</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>fatty acid binding protein 4</td>\n",
       "      <td>prot-b-71</td>\n",
       "      <td>0.019159</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.571455e-58</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Diagnoses - secondary ICD10: Z92.1 Personal hi...</td>\n",
       "      <td>ukb-b-7352</td>\n",
       "      <td>-0.973106</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.267170e-57</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>CUB and zona pellucida-like domain-containing ...</td>\n",
       "      <td>prot-a-735</td>\n",
       "      <td>0.021479</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.941390e-37</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Filamin-A</td>\n",
       "      <td>prot-a-1117</td>\n",
       "      <td>-0.054938</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>9.719336e-26</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Alpha-L-iduronidase</td>\n",
       "      <td>prot-a-1411</td>\n",
       "      <td>0.022690</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>4.120827e-25</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Secretory phospholipase A2 receptor</td>\n",
       "      <td>prot-a-2291</td>\n",
       "      <td>0.014897</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>8.347529e-25</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>HDL cholesterol</td>\n",
       "      <td>ebi-a-GCST005058</td>\n",
       "      <td>0.058877</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.163784e-19</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>X-11440</td>\n",
       "      <td>met-a-513</td>\n",
       "      <td>-0.113873</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.321509e-19</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Childhood obesity</td>\n",
       "      <td>ieu-a-1096</td>\n",
       "      <td>-0.199101</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.726210e-18</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Falls in the last year</td>\n",
       "      <td>ukb-b-2535</td>\n",
       "      <td>1.278313</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.494507e-16</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Delta-like protein 1</td>\n",
       "      <td>prot-a-831</td>\n",
       "      <td>0.053920</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>6.557481e-16</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Cadherin-related family member 3</td>\n",
       "      <td>prot-a-488</td>\n",
       "      <td>-0.088639</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.358433e-15</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Completion status of test: Heart rate reached ...</td>\n",
       "      <td>ukb-d-6020_33</td>\n",
       "      <td>-0.653432</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.380744e-15</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Non-cancer illness code, self-reported: ankylo...</td>\n",
       "      <td>ukb-b-18194</td>\n",
       "      <td>1.662842</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.066378e-14</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Body mass index</td>\n",
       "      <td>ieu-a-974</td>\n",
       "      <td>-0.788037</td>\n",
       "      <td>FE Egger</td>\n",
       "      <td>HF</td>\n",
       "      <td>9.788118e-13</td>\n",
       "      <td>0.76</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Added milk to espresso</td>\n",
       "      <td>ukb-b-1004</td>\n",
       "      <td>0.867059</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.788631e-12</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Parental longevity (combined parental age at d...</td>\n",
       "      <td>ebi-a-GCST006702</td>\n",
       "      <td>0.526232</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>HF</td>\n",
       "      <td>2.541637e-11</td>\n",
       "      <td>0.73</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Tyrosine-protein kinase receptor Tie-1, soluble</td>\n",
       "      <td>prot-a-2978</td>\n",
       "      <td>-0.031356</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.783312e-11</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Xyloside xylosyltransferase 1</td>\n",
       "      <td>prot-a-3243</td>\n",
       "      <td>0.050365</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>5.800064e-11</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Hip circumference</td>\n",
       "      <td>ieu-a-99</td>\n",
       "      <td>-0.571581</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>6.247788e-11</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Maspardin</td>\n",
       "      <td>prot-a-2815</td>\n",
       "      <td>-0.016165</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.624044e-10</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>IDP dMRI TBSS ICVF Anterior limb of internal c...</td>\n",
       "      <td>ubm-a-501</td>\n",
       "      <td>0.058488</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.048454e-09</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>IDP dMRI ProbtrackX ISOVF slf r</td>\n",
       "      <td>ubm-a-866</td>\n",
       "      <td>-0.050763</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.597902e-09</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Calpastatin</td>\n",
       "      <td>prot-a-366</td>\n",
       "      <td>0.054911</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.406328e-09</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Types of physical activity in last 4 weeks: No...</td>\n",
       "      <td>ukb-a-483</td>\n",
       "      <td>3.564379</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>HF</td>\n",
       "      <td>4.223489e-09</td>\n",
       "      <td>0.71</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Immunoglobulin superfamily containing leucine-...</td>\n",
       "      <td>prot-a-1576</td>\n",
       "      <td>-0.079188</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.003360e-08</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Age at menopause (last menstrual period)</td>\n",
       "      <td>ukb-b-17422</td>\n",
       "      <td>0.187735</td>\n",
       "      <td>Weighted median</td>\n",
       "      <td>Tophits</td>\n",
       "      <td>1.174988e-08</td>\n",
       "      <td>0.83</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Retinoic acid receptor responder protein 1</td>\n",
       "      <td>prot-a-2493</td>\n",
       "      <td>-0.007965</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.370085e-08</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Waist circumference</td>\n",
       "      <td>ieu-a-68</td>\n",
       "      <td>-0.395373</td>\n",
       "      <td>Penalised median</td>\n",
       "      <td>HF</td>\n",
       "      <td>1.646781e-08</td>\n",
       "      <td>0.72</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>IDP T1 FAST ROIs R ventral striatum</td>\n",
       "      <td>ubm-a-135</td>\n",
       "      <td>0.053819</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.476054e-08</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>IDP dMRI TBSS ICVF External capsule R</td>\n",
       "      <td>ubm-a-516</td>\n",
       "      <td>0.047657</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.079077e-08</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Interleukin-16 levels</td>\n",
       "      <td>ebi-a-GCST004430</td>\n",
       "      <td>0.019195</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.167074e-08</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Impedance of arm (left)</td>\n",
       "      <td>ukb-a-273</td>\n",
       "      <td>0.155830</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>Tophits</td>\n",
       "      <td>6.049757e-08</td>\n",
       "      <td>0.67</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>IDP T1 FAST ROIs R hippocampus</td>\n",
       "      <td>ubm-a-131</td>\n",
       "      <td>0.472672</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>9.494311e-08</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>IDP dMRI ProbtrackX L1 unc r</td>\n",
       "      <td>ubm-a-735</td>\n",
       "      <td>-0.049616</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.299429e-07</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Operation code: carpal tunnel surgery</td>\n",
       "      <td>ukb-b-17788</td>\n",
       "      <td>1.519196</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>2.533744e-07</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>IDP dMRI TBSS ICVF External capsule L</td>\n",
       "      <td>ubm-a-517</td>\n",
       "      <td>0.047683</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>4.310607e-07</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>netmat ICA 09Aug2017 003</td>\n",
       "      <td>ubm-a-3143</td>\n",
       "      <td>-0.063051</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>4.395737e-07</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>IDP dMRI TBSS ICVF Anterior limb of internal c...</td>\n",
       "      <td>ubm-a-500</td>\n",
       "      <td>0.062689</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>7.980397e-07</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Height</td>\n",
       "      <td>ieu-a-1034</td>\n",
       "      <td>0.224204</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>9.450253e-07</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>HDL cholesterol</td>\n",
       "      <td>ukb-d-30760_irnt</td>\n",
       "      <td>0.136435</td>\n",
       "      <td>Penalised median</td>\n",
       "      <td>DF</td>\n",
       "      <td>1.071715e-06</td>\n",
       "      <td>0.69</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Impedance of arm (left)</td>\n",
       "      <td>ukb-b-19379</td>\n",
       "      <td>0.155514</td>\n",
       "      <td>Simple mean</td>\n",
       "      <td>HF</td>\n",
       "      <td>1.169473e-06</td>\n",
       "      <td>0.74</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Hip circumference</td>\n",
       "      <td>ieu-a-101</td>\n",
       "      <td>0.300115</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>3.831879e-06</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Number in household</td>\n",
       "      <td>ukb-b-5445</td>\n",
       "      <td>-1.181082</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>5.908395e-06</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Complement C1q tumor necrosis factor-related p...</td>\n",
       "      <td>prot-a-305</td>\n",
       "      <td>-0.083802</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>6.316824e-06</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Impedance of leg (right)</td>\n",
       "      <td>ukb-b-7376</td>\n",
       "      <td>0.105088</td>\n",
       "      <td>Simple mean</td>\n",
       "      <td>HF</td>\n",
       "      <td>8.297733e-06</td>\n",
       "      <td>0.71</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Parkinson's disease</td>\n",
       "      <td>ieu-a-812</td>\n",
       "      <td>0.058860</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>8.649386e-06</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>Time to answer</td>\n",
       "      <td>ukb-b-14360</td>\n",
       "      <td>1.105045</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>DF</td>\n",
       "      <td>9.654924e-06</td>\n",
       "      <td>1.00</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    outcome.id                                     exposure.trait  \\\n",
       "0   ieu-a-1126                           Ever addicted to alcohol   \n",
       "1   ieu-a-1126  Diagnoses - secondary ICD10: K44.9 Diaphragmat...   \n",
       "2   ieu-a-1126     Killer cell immunoglobulin-like receptor 2DL5A   \n",
       "3   ieu-a-1126               Ever had hysterectomy (womb removed)   \n",
       "4   ieu-a-1126       Operation code: bunion/hallus valgus surgery   \n",
       "5   ieu-a-1126  Vascular endothelial growth factor A, isoform 121   \n",
       "6   ieu-a-1126                       fatty acid binding protein 4   \n",
       "7   ieu-a-1126  Diagnoses - secondary ICD10: Z92.1 Personal hi...   \n",
       "8   ieu-a-1126  CUB and zona pellucida-like domain-containing ...   \n",
       "9   ieu-a-1126                                          Filamin-A   \n",
       "10  ieu-a-1126                                Alpha-L-iduronidase   \n",
       "11  ieu-a-1126                Secretory phospholipase A2 receptor   \n",
       "12  ieu-a-1126                                    HDL cholesterol   \n",
       "13  ieu-a-1126                                            X-11440   \n",
       "14  ieu-a-1126                                  Childhood obesity   \n",
       "15  ieu-a-1126                             Falls in the last year   \n",
       "16  ieu-a-1126                               Delta-like protein 1   \n",
       "17  ieu-a-1126                   Cadherin-related family member 3   \n",
       "18  ieu-a-1126  Completion status of test: Heart rate reached ...   \n",
       "19  ieu-a-1126  Non-cancer illness code, self-reported: ankylo...   \n",
       "20  ieu-a-1126                                    Body mass index   \n",
       "21  ieu-a-1126                             Added milk to espresso   \n",
       "22  ieu-a-1126  Parental longevity (combined parental age at d...   \n",
       "23  ieu-a-1126    Tyrosine-protein kinase receptor Tie-1, soluble   \n",
       "24  ieu-a-1126                      Xyloside xylosyltransferase 1   \n",
       "25  ieu-a-1126                                  Hip circumference   \n",
       "26  ieu-a-1126                                          Maspardin   \n",
       "27  ieu-a-1126  IDP dMRI TBSS ICVF Anterior limb of internal c...   \n",
       "28  ieu-a-1126                    IDP dMRI ProbtrackX ISOVF slf r   \n",
       "29  ieu-a-1126                                        Calpastatin   \n",
       "30  ieu-a-1126  Types of physical activity in last 4 weeks: No...   \n",
       "31  ieu-a-1126  Immunoglobulin superfamily containing leucine-...   \n",
       "32  ieu-a-1126           Age at menopause (last menstrual period)   \n",
       "33  ieu-a-1126         Retinoic acid receptor responder protein 1   \n",
       "34  ieu-a-1126                                Waist circumference   \n",
       "35  ieu-a-1126                IDP T1 FAST ROIs R ventral striatum   \n",
       "36  ieu-a-1126              IDP dMRI TBSS ICVF External capsule R   \n",
       "37  ieu-a-1126                              Interleukin-16 levels   \n",
       "38  ieu-a-1126                            Impedance of arm (left)   \n",
       "39  ieu-a-1126                     IDP T1 FAST ROIs R hippocampus   \n",
       "40  ieu-a-1126                       IDP dMRI ProbtrackX L1 unc r   \n",
       "41  ieu-a-1126              Operation code: carpal tunnel surgery   \n",
       "42  ieu-a-1126              IDP dMRI TBSS ICVF External capsule L   \n",
       "43  ieu-a-1126                           netmat ICA 09Aug2017 003   \n",
       "44  ieu-a-1126  IDP dMRI TBSS ICVF Anterior limb of internal c...   \n",
       "45  ieu-a-1126                                             Height   \n",
       "46  ieu-a-1126                                    HDL cholesterol   \n",
       "47  ieu-a-1126                            Impedance of arm (left)   \n",
       "48  ieu-a-1126                                  Hip circumference   \n",
       "49  ieu-a-1126                                Number in household   \n",
       "50  ieu-a-1126  Complement C1q tumor necrosis factor-related p...   \n",
       "51  ieu-a-1126                           Impedance of leg (right)   \n",
       "52  ieu-a-1126                                Parkinson's disease   \n",
       "53  ieu-a-1126                                     Time to answer   \n",
       "\n",
       "         exposure.id      mr.b         mr.method mr.selection        mr.pval  \\\n",
       "0        ukb-d-20406 -0.054825            FE IVW           DF   0.000000e+00   \n",
       "1         ukb-b-3672 -1.542995            FE IVW           DF  4.514856e-242   \n",
       "2        prot-a-1644  0.016679            FE IVW           DF  4.770365e-106   \n",
       "3         ukb-b-6445 -1.562231            FE IVW           DF   9.686474e-86   \n",
       "4         ukb-b-9190  1.109370            FE IVW           DF   3.334299e-85   \n",
       "5        prot-a-3197  0.013410            FE IVW           DF   7.992747e-83   \n",
       "6          prot-b-71  0.019159            FE IVW           DF   1.571455e-58   \n",
       "7         ukb-b-7352 -0.973106            FE IVW           DF   1.267170e-57   \n",
       "8         prot-a-735  0.021479            FE IVW           DF   2.941390e-37   \n",
       "9        prot-a-1117 -0.054938            FE IVW           DF   9.719336e-26   \n",
       "10       prot-a-1411  0.022690            FE IVW           DF   4.120827e-25   \n",
       "11       prot-a-2291  0.014897            FE IVW           DF   8.347529e-25   \n",
       "12  ebi-a-GCST005058  0.058877            FE IVW           DF   1.163784e-19   \n",
       "13         met-a-513 -0.113873            FE IVW           DF   1.321509e-19   \n",
       "14        ieu-a-1096 -0.199101            FE IVW           DF   1.726210e-18   \n",
       "15        ukb-b-2535  1.278313            FE IVW           DF   3.494507e-16   \n",
       "16        prot-a-831  0.053920            FE IVW           DF   6.557481e-16   \n",
       "17        prot-a-488 -0.088639            FE IVW           DF   1.358433e-15   \n",
       "18     ukb-d-6020_33 -0.653432            FE IVW           DF   2.380744e-15   \n",
       "19       ukb-b-18194  1.662842            FE IVW           DF   2.066378e-14   \n",
       "20         ieu-a-974 -0.788037          FE Egger           HF   9.788118e-13   \n",
       "21        ukb-b-1004  0.867059            FE IVW           DF   3.788631e-12   \n",
       "22  ebi-a-GCST006702  0.526232            FE IVW           HF   2.541637e-11   \n",
       "23       prot-a-2978 -0.031356            FE IVW           DF   2.783312e-11   \n",
       "24       prot-a-3243  0.050365            FE IVW           DF   5.800064e-11   \n",
       "25          ieu-a-99 -0.571581            FE IVW           DF   6.247788e-11   \n",
       "26       prot-a-2815 -0.016165            FE IVW           DF   3.624044e-10   \n",
       "27         ubm-a-501  0.058488            FE IVW           DF   1.048454e-09   \n",
       "28         ubm-a-866 -0.050763            FE IVW           DF   2.597902e-09   \n",
       "29        prot-a-366  0.054911            FE IVW           DF   3.406328e-09   \n",
       "30         ukb-a-483  3.564379            FE IVW           HF   4.223489e-09   \n",
       "31       prot-a-1576 -0.079188            FE IVW           DF   1.003360e-08   \n",
       "32       ukb-b-17422  0.187735   Weighted median      Tophits   1.174988e-08   \n",
       "33       prot-a-2493 -0.007965            FE IVW           DF   1.370085e-08   \n",
       "34          ieu-a-68 -0.395373  Penalised median           HF   1.646781e-08   \n",
       "35         ubm-a-135  0.053819            FE IVW           DF   2.476054e-08   \n",
       "36         ubm-a-516  0.047657            FE IVW           DF   3.079077e-08   \n",
       "37  ebi-a-GCST004430  0.019195            FE IVW           DF   3.167074e-08   \n",
       "38         ukb-a-273  0.155830            FE IVW      Tophits   6.049757e-08   \n",
       "39         ubm-a-131  0.472672            FE IVW           DF   9.494311e-08   \n",
       "40         ubm-a-735 -0.049616            FE IVW           DF   1.299429e-07   \n",
       "41       ukb-b-17788  1.519196            FE IVW           DF   2.533744e-07   \n",
       "42         ubm-a-517  0.047683            FE IVW           DF   4.310607e-07   \n",
       "43        ubm-a-3143 -0.063051            FE IVW           DF   4.395737e-07   \n",
       "44         ubm-a-500  0.062689            FE IVW           DF   7.980397e-07   \n",
       "45        ieu-a-1034  0.224204            FE IVW           DF   9.450253e-07   \n",
       "46  ukb-d-30760_irnt  0.136435  Penalised median           DF   1.071715e-06   \n",
       "47       ukb-b-19379  0.155514       Simple mean           HF   1.169473e-06   \n",
       "48         ieu-a-101  0.300115            FE IVW           DF   3.831879e-06   \n",
       "49        ukb-b-5445 -1.181082            FE IVW           DF   5.908395e-06   \n",
       "50        prot-a-305 -0.083802            FE IVW           DF   6.316824e-06   \n",
       "51        ukb-b-7376  0.105088       Simple mean           HF   8.297733e-06   \n",
       "52         ieu-a-812  0.058860            FE IVW           DF   8.649386e-06   \n",
       "53       ukb-b-14360  1.105045            FE IVW           DF   9.654924e-06   \n",
       "\n",
       "    mr.moescore  \n",
       "0          1.00  \n",
       "1          1.00  \n",
       "2          1.00  \n",
       "3          1.00  \n",
       "4          1.00  \n",
       "5          1.00  \n",
       "6          1.00  \n",
       "7          1.00  \n",
       "8          1.00  \n",
       "9          1.00  \n",
       "10         1.00  \n",
       "11         1.00  \n",
       "12         1.00  \n",
       "13         1.00  \n",
       "14         1.00  \n",
       "15         1.00  \n",
       "16         1.00  \n",
       "17         1.00  \n",
       "18         1.00  \n",
       "19         1.00  \n",
       "20         0.76  \n",
       "21         1.00  \n",
       "22         0.73  \n",
       "23         1.00  \n",
       "24         1.00  \n",
       "25         1.00  \n",
       "26         1.00  \n",
       "27         1.00  \n",
       "28         1.00  \n",
       "29         1.00  \n",
       "30         0.71  \n",
       "31         1.00  \n",
       "32         0.83  \n",
       "33         1.00  \n",
       "34         0.72  \n",
       "35         1.00  \n",
       "36         1.00  \n",
       "37         1.00  \n",
       "38         0.67  \n",
       "39         1.00  \n",
       "40         1.00  \n",
       "41         1.00  \n",
       "42         1.00  \n",
       "43         1.00  \n",
       "44         1.00  \n",
       "45         1.00  \n",
       "46         0.69  \n",
       "47         0.74  \n",
       "48         1.00  \n",
       "49         1.00  \n",
       "50         1.00  \n",
       "51         0.71  \n",
       "52         1.00  \n",
       "53         1.00  "
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# MR test\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id = \"ieu-a-1126\"  \n",
    "AND (not (toLower(exposure.trait) contains 'breast')) \n",
    "AND mr.pval < 1e-05\n",
    "RETURN exposure {.id, .trait}, outcome.id, mr {.b, .pval, .method, .selection, .moescore} ORDER BY mr.pval\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "    MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "    WHERE outcome.id in ['ieu-a-1126', 'ieu-a-1127', 'ieu-a-1128', 'ieu-a-1129', 'ieu-a-1130', 'ieu-a-1131', 'ieu-a-1132', 'ieu-a-1133', 'ieu-a-1134', 'ieu-a-1135', 'ieu-a-1136', 'ieu-a-1137', 'ieu-a-1160', 'ieu-a-1161', 'ieu-a-1162', 'ieu-a-1163', 'ieu-a-1164', 'ieu-a-1165', 'ieu-a-1166', 'ieu-a-1167', 'ieu-a-1168', 'ukb-a-55', 'ukb-b-16890', 'ukb-d-C3_BREAST_3'] \n",
      "    AND  not exposure.id  in ['ieu-a-1126', 'ieu-a-1127', 'ieu-a-1128', 'ieu-a-1129', 'ieu-a-1130', 'ieu-a-1131', 'ieu-a-1132', 'ieu-a-1133', 'ieu-a-1134', 'ieu-a-1135', 'ieu-a-1136', 'ieu-a-1137', 'ieu-a-1160', 'ieu-a-1161', 'ieu-a-1162', 'ieu-a-1163', 'ieu-a-1164', 'ieu-a-1165', 'ieu-a-1166', 'ieu-a-1167', 'ieu-a-1168', 'ukb-a-55', 'ukb-b-16890', 'ukb-d-C3_BREAST_3']\n",
      "    AND (not (toLower(exposure.trait) contains 'breast')) \n",
      "    AND mr.pval < 1e-05\n",
      "    with mr, exposure, outcome\n",
      "    ORDER BY mr.pval \n",
      "    RETURN exposure.id, exposure.trait, exposure.sample_size,\n",
      "            collect(outcome.id) as outcome_ids, \n",
      "            collect(mr.pval) as MR_pvals, collect(mr.b) as MR_beta\n",
      "\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.sample_size</th>\n",
       "      <th>outcome_ids</th>\n",
       "      <th>MR_pvals</th>\n",
       "      <th>MR_beta</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>prot-a-1411</td>\n",
       "      <td>Alpha-L-iduronidase</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>[ukb-b-16890, ieu-a-1136, ieu-a-1126, ieu-a-11...</td>\n",
       "      <td>[0.0, 0.0, 4.12082678662007e-25, 1.62953109690...</td>\n",
       "      <td>[0.000454060802980906, 0.0167251457326905, 0.0...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>prot-a-1276</td>\n",
       "      <td>Glutamate receptor ionotropic, delta-2</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>[ukb-b-16890]</td>\n",
       "      <td>[0.0]</td>\n",
       "      <td>[0.00273122085407538]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>prot-a-2166</td>\n",
       "      <td>Platelet-activating factor acetylhydrolase IB ...</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>[ukb-b-16890]</td>\n",
       "      <td>[0.0]</td>\n",
       "      <td>[-0.000697314107341724]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>prot-a-995</td>\n",
       "      <td>Protein eva-1 homolog C</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>[ukb-b-16890, ieu-a-1132, ieu-a-1127]</td>\n",
       "      <td>[0.0, 1.71005705410616e-33, 9.05550305130723e-11]</td>\n",
       "      <td>[0.00111999698219523, -0.0269001814975584, -0....</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>prot-a-566</td>\n",
       "      <td>Creatine kinase M-type</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>[ukb-b-16890]</td>\n",
       "      <td>[0.0]</td>\n",
       "      <td>[-0.0020934261149299]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>737</th>\n",
       "      <td>prot-a-821</td>\n",
       "      <td>Dickkopf-related protein 1</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>[ieu-a-1136]</td>\n",
       "      <td>[8.24099097862065e-06]</td>\n",
       "      <td>[0.0339189126254016]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>738</th>\n",
       "      <td>ukb-b-7376</td>\n",
       "      <td>Impedance of leg (right)</td>\n",
       "      <td>454863.0</td>\n",
       "      <td>[ieu-a-1126]</td>\n",
       "      <td>[8.29773347622307e-06]</td>\n",
       "      <td>[0.105088281390953]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>739</th>\n",
       "      <td>ukb-b-15782</td>\n",
       "      <td>logMAR, final (right)</td>\n",
       "      <td>101023.0</td>\n",
       "      <td>[ukb-a-55]</td>\n",
       "      <td>[8.52893962249346e-06]</td>\n",
       "      <td>[0.00588635442005368]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>740</th>\n",
       "      <td>ieu-a-812</td>\n",
       "      <td>Parkinson's disease</td>\n",
       "      <td>5691.0</td>\n",
       "      <td>[ieu-a-1126]</td>\n",
       "      <td>[8.64938636830279e-06]</td>\n",
       "      <td>[0.0588601942842277]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>741</th>\n",
       "      <td>ieu-a-22</td>\n",
       "      <td>Schizophrenia</td>\n",
       "      <td>82315.0</td>\n",
       "      <td>[ieu-a-1132]</td>\n",
       "      <td>[8.8263705385911e-06]</td>\n",
       "      <td>[0.0589809881113837]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>742 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     exposure.id                                     exposure.trait  \\\n",
       "0    prot-a-1411                                Alpha-L-iduronidase   \n",
       "1    prot-a-1276             Glutamate receptor ionotropic, delta-2   \n",
       "2    prot-a-2166  Platelet-activating factor acetylhydrolase IB ...   \n",
       "3     prot-a-995                            Protein eva-1 homolog C   \n",
       "4     prot-a-566                             Creatine kinase M-type   \n",
       "..           ...                                                ...   \n",
       "737   prot-a-821                         Dickkopf-related protein 1   \n",
       "738   ukb-b-7376                           Impedance of leg (right)   \n",
       "739  ukb-b-15782                              logMAR, final (right)   \n",
       "740    ieu-a-812                                Parkinson's disease   \n",
       "741     ieu-a-22                                      Schizophrenia   \n",
       "\n",
       "    exposure.sample_size                                        outcome_ids  \\\n",
       "0                 3301.0  [ukb-b-16890, ieu-a-1136, ieu-a-1126, ieu-a-11...   \n",
       "1                 3301.0                                      [ukb-b-16890]   \n",
       "2                 3301.0                                      [ukb-b-16890]   \n",
       "3                 3301.0              [ukb-b-16890, ieu-a-1132, ieu-a-1127]   \n",
       "4                 3301.0                                      [ukb-b-16890]   \n",
       "..                   ...                                                ...   \n",
       "737               3301.0                                       [ieu-a-1136]   \n",
       "738             454863.0                                       [ieu-a-1126]   \n",
       "739             101023.0                                         [ukb-a-55]   \n",
       "740               5691.0                                       [ieu-a-1126]   \n",
       "741              82315.0                                       [ieu-a-1132]   \n",
       "\n",
       "                                              MR_pvals  \\\n",
       "0    [0.0, 0.0, 4.12082678662007e-25, 1.62953109690...   \n",
       "1                                                [0.0]   \n",
       "2                                                [0.0]   \n",
       "3    [0.0, 1.71005705410616e-33, 9.05550305130723e-11]   \n",
       "4                                                [0.0]   \n",
       "..                                                 ...   \n",
       "737                             [8.24099097862065e-06]   \n",
       "738                             [8.29773347622307e-06]   \n",
       "739                             [8.52893962249346e-06]   \n",
       "740                             [8.64938636830279e-06]   \n",
       "741                              [8.8263705385911e-06]   \n",
       "\n",
       "                                               MR_beta  \n",
       "0    [0.000454060802980906, 0.0167251457326905, 0.0...  \n",
       "1                                [0.00273122085407538]  \n",
       "2                              [-0.000697314107341724]  \n",
       "3    [0.00111999698219523, -0.0269001814975584, -0....  \n",
       "4                                [-0.0020934261149299]  \n",
       "..                                                 ...  \n",
       "737                               [0.0339189126254016]  \n",
       "738                                [0.105088281390953]  \n",
       "739                              [0.00588635442005368]  \n",
       "740                               [0.0588601942842277]  \n",
       "741                               [0.0589809881113837]  \n",
       "\n",
       "[742 rows x 6 columns]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# NB takes a long time\n",
    "# MR\n",
    "# get traits that have pval < 1e-05\n",
    "\n",
    "query = \"\"\"\n",
    "    MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "    WHERE outcome.id in {gwas_list} \n",
    "    AND  not exposure.id  in {gwas_list}\n",
    "    AND (not (toLower(exposure.trait) contains 'breast')) \n",
    "    AND mr.pval < 1e-05\n",
    "    with mr, exposure, outcome\n",
    "    ORDER BY mr.pval \n",
    "    RETURN exposure.id, exposure.trait, exposure.sample_size,\n",
    "            collect(outcome.id) as outcome_ids, \n",
    "            collect(mr.pval) as MR_pvals, collect(mr.b) as MR_beta\n",
    "\n",
    "\"\"\".format(gwas_list = all_bc_gwas)\n",
    "df = query_to_df(session, query, True)\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(742, 6)"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "WHERE outcome.id in ['ieu-a-1126', 'ieu-a-1127', 'ieu-a-1128', 'ieu-a-1129', 'ieu-a-1130', 'ieu-a-1131', 'ieu-a-1132', 'ieu-a-1133', 'ieu-a-1134', 'ieu-a-1135', 'ieu-a-1136', 'ieu-a-1137', 'ieu-a-1160', 'ieu-a-1161', 'ieu-a-1162', 'ieu-a-1163', 'ieu-a-1164', 'ieu-a-1165', 'ieu-a-1166', 'ieu-a-1167', 'ieu-a-1168', 'ukb-a-55', 'ukb-b-16890', 'ukb-d-C3_BREAST_3'] \n",
      "AND  exposure.id  in ['ukb-b-16812', 'ieu-a-22', 'prot-a-2440', 'ubm-a-510', 'prot-a-2039', 'ukb-b-16677', 'prot-a-1288', 'ukb-b-8846', 'ubm-a-271', 'prot-a-1075', 'ieu-a-64', 'prot-a-2362', 'ukb-b-19520', 'prot-a-1833', 'ubm-a-613', 'prot-a-1930', 'ukb-a-243', 'prot-a-2557', 'prot-a-319', 'prot-a-2018', 'prot-a-212', 'ukb-b-2183', 'prot-a-3137', 'prot-a-3254', 'ukb-b-8297', 'ukb-d-G6_NERPLEX', 'ukb-b-10859', 'prot-a-1006', 'ubm-a-495', 'met-a-513', 'ukb-a-176', 'prot-a-2743', 'prot-a-2920', 'prot-a-1739', 'prot-a-2357', 'prot-a-1317', 'prot-a-213', 'prot-a-1917', 'ukb-b-9508', 'prot-a-310', 'ukb-a-485', 'met-a-316', 'ukb-a-153', 'met-c-840', 'ubm-a-466', 'met-a-500', 'met-a-683', 'prot-a-2733', 'ubm-a-643', 'prot-a-1879', 'prot-a-1995', 'prot-a-2211', 'prot-a-1858', 'prot-a-1411', 'ubm-a-412', 'prot-a-1707', 'ukb-a-72', 'prot-a-2685', 'ukb-b-7137', 'prot-a-1298', 'prot-a-1696', 'ukb-b-9038', 'ubm-a-144', 'ubm-a-711', 'prot-a-1500', 'prot-a-392', 'ukb-b-10505', 'ukb-b-19732', 'ukb-b-17918', 'prot-a-532', 'ukb-d-C3_PRIMARY_LYMPHOID_HEMATOPOIETIC', 'ukb-b-11856', 'prot-a-390', 'ukb-d-R79', 'ukb-a-428', 'prot-a-643', 'ubm-a-148', 'prot-a-2308', 'ukb-b-15787', 'prot-a-366', 'ukb-b-10454', 'prot-a-735', 'ebi-a-GCST005838', 'prot-a-1644', 'prot-a-2926', 'ukb-b-5421', 'ubm-a-500', 'ubm-a-496', 'ubm-a-669', 'ukb-b-15590', 'prot-a-2215', 'ukb-b-18377', 'prot-a-2427', 'ebi-a-GCST004939', 'prot-a-706', 'prot-a-220', 'prot-a-1443', 'prot-a-1537', 'ukb-b-16019', 'prot-a-1898', 'prot-a-599', 'ubm-a-561', 'ebi-a-GCST004439', 'met-c-947', 'ieu-a-803', 'prot-a-488', 'ebi-a-GCST005180', 'prot-a-1842', 'ieu-a-976', 'prot-a-857', 'ukb-a-459', 'prot-a-1166', 'prot-a-1038', 'ukb-d-C_PRIMARY_LYMPHOID_HEMATOPOIETIC', 'ieu-a-101', 'ubm-a-800', 'ukb-d-5012', 'ukb-a-195', 'ieu-a-837', 'ukb-d-VII_EYE_ADNEXA', 'prot-a-1074', 'prot-a-2396', 'prot-a-892', 'ukb-b-14080', 'ukb-d-M13_POLYARTHROPATHIES', 'ukb-a-574', 'ebi-a-GCST006906', 'ukb-b-8909', 'ieu-a-1050', 'prot-a-2189', 'ubm-a-791', 'ukb-b-5445', 'ukb-b-18994', 'prot-a-3205', 'ubm-a-481', 'ukb-b-6218', 'ubm-a-200', 'ukb-a-487', 'prot-a-566', 'ukb-b-10827', 'prot-a-2337', 'prot-a-280', 'met-c-864', 'ukb-a-132', 'ukb-a-452', 'ukb-a-426', 'prot-a-2341', 'ukb-b-13500', 'ebi-a-GCST006368', 'ukb-b-16399', 'ubm-a-408', 'ukb-b-5237', 'ukb-b-18194', 'prot-a-1129', 'ubm-a-651', 'ukb-b-12722', 'ieu-a-1088', 'prot-a-2889', 'ubm-a-3142', 'ukb-b-13978', 'ukb-a-205', 'prot-a-1800', 'prot-a-2082', 'ukb-a-117', 'prot-a-983', 'ubm-a-659', 'prot-a-2815', 'ukb-a-316', 'ukb-b-3672', 'prot-a-197', 'prot-a-486', 'ukb-a-222', 'prot-a-2464', 'prot-a-1659', 'ubm-a-476', 'prot-a-2739', 'ukb-b-10181', 'ieu-a-93', 'ebi-a-GCST000679', 'ubm-a-2656', 'ukb-b-4955', 'ukb-d-20500', 'ebi-a-GCST004623', 'ukb-a-75', 'ukb-a-572', 'prot-a-2978', 'ukb-b-13932', 'ukb-b-8778', 'prot-a-2795', 'ebi-a-GCST003770', 'prot-a-2030', 'prot-a-2900', 'ukb-b-15445', 'prot-a-1117', 'prot-a-1906', 'prot-a-2245', 'ukb-a-23', 'ukb-b-8133', 'ukb-b-11971', 'prot-a-2760', 'ukb-b-12209', 'met-c-855', 'ukb-b-8755', 'prot-a-674', 'ukb-a-343', 'ukb-b-3599', 'ukb-b-703', 'prot-a-1950', 'prot-a-2666', 'ukb-a-552', 'prot-a-2329', 'ukb-b-1744', 'prot-a-714', 'prot-a-2875', 'ukb-b-18799', 'prot-a-2350', 'prot-a-2247', 'prot-a-867', 'ukb-b-8865', 'ukb-d-II_NEOPLASM', 'prot-a-135', 'ubm-a-517', 'ukb-a-373', 'ukb-b-9127', 'ukb-b-6500', 'ieu-a-76', 'ukb-d-22506_114', 'ieu-a-999', 'ubm-a-550', 'ubm-a-327', 'ieu-a-55', 'prot-a-1921', 'prot-a-953', 'ukb-a-273', 'prot-a-1991', 'ukb-a-60', 'prot-a-2729', 'ubm-a-668', 'met-a-558', 'prot-a-1835', 'prot-a-1863', 'prot-a-2665', 'prot-a-1724', 'ieu-a-1051', 'ebi-a-GCST005327', 'ukb-b-16855', 'met-c-874', 'met-c-902', 'prot-a-37', 'ukb-a-454', 'ieu-a-836', 'prot-a-2878', 'prot-a-570', 'prot-a-3009', 'prot-a-1645', 'met-a-383', 'ukb-a-150', 'met-a-636', 'prot-a-2324', 'ukb-b-4711', 'prot-a-419', 'ukb-b-17422', 'ukb-b-16881', 'prot-a-1606', 'prot-a-2291', 'prot-a-2573', 'ukb-a-236', 'ukb-b-16886', 'ukb-b-1004', 'ukb-d-XVIII_MISCFINDINGS', 'ukb-b-15918', 'ukb-b-3304', 'prot-a-1332', 'ukb-b-14713', 'ukb-a-254', 'met-c-914', 'ukb-a-94', 'prot-a-1207', 'ukb-b-660', 'ukb-b-18240', 'prot-a-1486', 'prot-a-1586', 'prot-a-3197', 'prot-a-524', 'ukb-b-15695', 'prot-a-995', 'ubm-a-2667', 'ukb-d-20553_5', 'prot-a-1530', 'ukb-b-5476', 'prot-a-3243', 'ukb-d-1538_2', 'ieu-a-783', 'ukb-a-211', 'ukb-b-469', 'ukb-b-10415', 'prot-a-648', 'met-c-876', 'prot-a-96', 'prot-a-2166', 'prot-a-888', 'ubm-a-866', 'prot-a-3200', 'ukb-b-1553', 'prot-a-654', 'ukb-d-ULCERNAS', 'prot-b-55', 'prot-a-2025', 'met-a-517', 'prot-a-3214', 'prot-a-1885', 'ukb-d-1468_5', 'ukb-a-393', 'ukb-a-320', 'ukb-b-11158', 'ieu-a-812', 'met-c-900', 'ukb-b-19809', 'ukb-b-13348', 'ukb-b-1511', 'ukb-d-J45', 'ieu-a-1228', 'ubm-a-499', 'ukb-b-16606', 'prot-a-2690', 'ukb-b-143', 'ukb-d-5540_0', 'met-a-578', 'met-c-912', 'prot-a-181', 'ukb-d-41231_1', 'ukb-d-C67', 'ukb-b-19379', 'ukb-b-323', 'ubm-a-735', 'prot-a-420', 'prot-a-2071', 'ebi-a-GCST004634', 'met-a-573', 'prot-a-2813', 'prot-a-831', 'ukb-b-11064', 'ebi-a-GCST005920', 'prot-a-1395', 'ukb-b-16866', 'ukb-b-16858', 'ubm-a-410', 'ukb-b-19060', 'prot-a-1313', 'ebi-a-GCST004422', 'prot-a-1742', 'prot-a-1867', 'prot-a-2392', 'prot-a-2301', 'prot-a-1154', 'ebi-a-GCST003839', 'ubm-a-660', 'ukb-d-1508_2', 'prot-a-989', 'prot-a-977', 'ukb-b-18366', 'prot-a-1378', 'ubm-a-29', 'prot-a-1153', 'ukb-d-6020_33', 'ebi-a-GCST004901', 'prot-a-99', 'met-a-427', 'ubm-a-913', 'ebi-a-GCST002223', 'ukb-a-34', 'ukb-d-680_1', 'prot-a-67', 'ukb-b-998', 'ukb-b-13354', 'ubm-a-424', 'ieu-a-1034', 'met-a-656', 'met-a-682', 'met-c-932', 'ubm-a-840', 'ubm-a-516', 'prot-a-2398', 'ukb-a-418', 'prot-a-426', 'met-c-898', 'prot-b-38', 'ieu-a-980', 'ubm-a-3143', 'prot-a-612', 'ukb-a-449', 'met-a-485', 'ieu-a-792', 'ebi-a-GCST005058', 'ebi-a-GCST005067', 'prot-a-2902', 'prot-a-3109', 'ukb-b-7352', 'prot-a-2944', 'ubm-a-751', 'ukb-b-12493', 'ukb-b-4522', 'ieu-a-99', 'ukb-a-585', 'prot-a-2720', 'prot-b-71', 'ieu-a-1056', 'ubm-a-392', 'met-c-957', 'ukb-d-30500_irnt', 'prot-a-1403', 'ieu-a-1015', 'ukb-b-14147', 'ukb-a-91', 'ubm-a-723', 'ukb-b-4643', 'prot-a-201', 'met-a-616', 'prot-a-1445', 'ukb-b-6306', 'prot-a-609', 'ukb-b-15555', 'ubm-a-278', 'ukb-a-269', 'ebi-a-GCST006698', 'ukb-b-4943', 'ukb-a-103', 'ieu-a-44', 'prot-a-2008', 'met-c-944', 'ubm-a-165', 'ukb-d-XI_DIGESTIVE', 'prot-a-1202', 'prot-a-398', 'ukb-a-521', 'prot-a-381', 'prot-a-1511', 'prot-a-971', 'prot-a-10', 'ukb-b-9571', 'prot-a-540', 'prot-a-2139', 'ubm-a-501', 'ukb-b-3376', 'ubm-a-2649', 'prot-a-608', 'met-c-866', 'ieu-a-1007', 'ubm-a-415', 'ubm-a-2737', 'ukb-b-8072', 'prot-a-1695', 'prot-a-1414', 'ukb-d-5327_0', 'ukb-a-14', 'prot-a-2824', 'met-c-901', 'prot-a-1746', 'prot-a-527', 'ubm-a-2644', 'ukb-b-18336', 'ukb-b-4414', 'prot-a-3216', 'met-a-444', 'ukb-b-6811', 'met-a-495', 'prot-a-2205', 'prot-a-1782', 'ukb-b-17868', 'ukb-b-2535', 'ukb-b-15784', 'ukb-b-698', 'ukb-d-IV_ENDOCRIN_NUTRIT', 'prot-a-988', 'prot-a-354', 'ukb-b-7910', 'ubm-a-798', 'prot-a-3193', 'ieu-a-1283', 'prot-a-3180', 'prot-a-2462', 'prot-a-1741', 'ukb-b-2732', 'ukb-a-427', 'ubm-a-670', 'prot-a-690', 'ieu-a-90', 'prot-a-1148', 'ukb-b-7859', 'prot-a-1049', 'ukb-b-17885', 'ukb-b-9207', 'ukb-d-20117_2', 'ukb-b-15592', 'ebi-a-GCST001198', 'ukb-b-11207', 'ukb-b-14360', 'prot-a-1713', 'ukb-b-4077', 'ebi-a-GCST005569', 'prot-a-1655', 'ebi-a-GCST003435', 'met-a-519', 'ukb-b-4801', 'ubm-a-248', 'prot-a-402', 'ukb-b-12018', 'ubm-a-130', 'ukb-a-295', 'prot-a-475', 'ukb-b-6445', 'prot-a-314', 'met-c-923', 'prot-a-821', 'prot-a-2351', 'ieu-a-1024', 'ukb-b-282', 'prot-a-1046', 'prot-a-655', 'ukb-a-357', 'met-a-629', 'ieu-a-1096', 'prot-a-2891', 'prot-a-2043', 'ukb-a-483', 'ieu-a-111', 'prot-a-32', 'ubm-a-667', 'ukb-b-1707', 'prot-a-586', 'ukb-b-3793', 'prot-a-1369', 'ukb-b-1572', 'ukb-a-52', 'prot-a-2361', 'ieu-a-68', 'ukb-b-748', 'met-c-946', 'prot-a-1610', 'ukb-a-325', 'prot-a-2748', 'ukb-d-20406', 'prot-a-518', 'prot-a-2222', 'ubm-a-131', 'met-c-887', 'ukb-b-13392', 'prot-a-346', 'ieu-a-974', 'ieu-a-91', 'ieu-a-834', 'prot-a-836', 'prot-a-1386', 'ukb-a-46', 'ukb-a-204', 'prot-a-545', 'ieu-a-1013', 'prot-b-50', 'prot-a-2892', 'prot-a-2575', 'prot-a-216', 'ebi-a-GCST004075', 'ukb-b-16027', 'ukb-a-24', 'ukb-b-15748', 'ubm-a-790', 'ukb-a-223', 'ubm-a-916', 'ubm-a-11', 'ukb-b-589', 'prot-a-1541', 'prot-a-1397', 'prot-a-456', 'prot-a-550', 'ebi-a-GCST004618', 'met-c-897', 'prot-a-2561', 'ieu-a-1049', 'prot-a-2629', 'ukb-a-401', 'prot-a-1005', 'prot-a-627', 'ieu-a-755', 'prot-a-1792', 'ukb-b-7872', 'prot-a-2930', 'met-c-911', 'ukb-b-16698', 'prot-a-1299', 'prot-a-2129', 'ukb-a-210', 'met-a-362', 'prot-a-982', 'met-a-304', 'ubm-a-514', 'prot-a-334', 'ukb-a-58', 'ukb-b-11075', 'ukb-b-7043', 'ukb-b-18162', 'ukb-b-19579', 'ukb-b-13251', 'ebi-a-GCST005522', 'prot-a-1389', 'ukb-d-22617_9149', 'met-c-890', 'prot-a-3258', 'ukb-b-12039', 'ubm-a-215', 'prot-a-83', 'prot-a-1276', 'ubm-a-498', 'ieu-a-1052', 'ubm-a-135', 'ubm-a-373', 'ukb-b-17616', 'prot-a-3000', 'ebi-a-GCST005840', 'prot-a-1639', 'ebi-a-GCST004296', 'ukb-d-30730_irnt', 'ukb-b-15782', 'prot-a-1347', 'ieu-a-1123', 'ukb-b-16217', 'prot-a-521', 'ubm-a-230', 'prot-a-629', 'ukb-a-328', 'prot-a-1258', 'ebi-a-GCST004604', 'prot-a-1250', 'ukb-a-11', 'ukb-b-6848', 'met-a-652', 'ukb-b-9093', 'ukb-b-17601', 'ukb-b-14067', 'prot-a-613', 'prot-a-972', 'ukb-b-14310', 'prot-a-2432', 'prot-a-2701', 'ebi-a-GCST006941', 'ukb-b-17788', 'ukb-d-H40', 'ubm-a-806', 'ukb-b-9592', 'prot-a-1072', 'prot-a-305', 'ukb-b-7376', 'prot-a-932', 'prot-a-2007', 'prot-a-805', 'ukb-a-313', 'ukb-a-217', 'prot-a-2101', 'prot-a-710', 'ukb-a-421', 'met-a-359', 'prot-a-1305', 'ukb-b-8668', 'prot-a-878', 'prot-a-399', 'ubm-a-470', 'ubm-a-511', 'ebi-a-GCST006702', 'ubm-a-413', 'met-a-661', 'met-c-919', 'ubm-a-929', 'ubm-a-724', 'ebi-a-GCST005843', 'ukb-b-11535', 'prot-b-21', 'prot-a-1506', 'ukb-a-342', 'ukb-a-6', 'prot-a-500', 'ukb-a-528', 'ukb-b-3666', 'prot-a-3267', 'ieu-a-85', 'ukb-b-9961', 'prot-a-412', 'ukb-d-1418_3', 'prot-a-3028', 'ukb-d-22601_35423237', 'ukb-b-2221', 'ukb-b-10559', 'prot-a-1051', 'ukb-b-20379', 'ukb-a-324', 'prot-a-1097', 'prot-a-2269', 'prot-a-2820', 'prot-a-408', 'ukb-b-5213', 'prot-a-2470', 'prot-a-1779', 'prot-a-2356', 'prot-a-322', 'ebi-a-GCST006366', 'ukb-b-18436', 'ebi-a-GCST004631', 'ukb-b-15491', 'ukb-a-475', 'ukb-a-423', 'ukb-b-10003', 'ukb-d-K11_OTHDIG', 'ubm-a-533', 'ukb-a-491', 'ebi-a-GCST004430', 'met-a-667', 'ukb-a-30', 'ieu-a-970', 'prot-a-1045', 'ebi-a-GCST001969', 'met-a-618', 'ukb-d-D17', 'prot-a-2087', 'ukb-b-9125', 'ieu-a-833', 'prot-a-1657', 'ebi-a-GCST002318', 'ukb-b-15169', 'ebi-a-GCST004575', 'met-c-953', 'ukb-b-9190', 'prot-a-2493', 'ukb-d-30760_irnt', 'ukb-b-14521', 'prot-a-1576', 'prot-a-3090', 'prot-a-543', 'ieu-a-298', 'ubm-a-285', 'ukb-d-1418_1', 'ukb-b-17241', 'met-a-542', 'ubm-a-809', 'prot-a-1126']\n",
      "with mr, exposure, outcome\n",
      "ORDER BY exposure.trait\n",
      "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, exposure.note,\n",
      "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
      "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, outcome.year, outcome.nsnp,\n",
      "        mr.pval, mr.b, mr.se, mr.method, mr.moescore\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.sample_size</th>\n",
       "      <th>exposure.sex</th>\n",
       "      <th>exposure.note</th>\n",
       "      <th>year</th>\n",
       "      <th>author</th>\n",
       "      <th>consortium</th>\n",
       "      <th>outcome.id</th>\n",
       "      <th>outcome.sample_size</th>\n",
       "      <th>N_case</th>\n",
       "      <th>outcome.year</th>\n",
       "      <th>outcome.nsnp</th>\n",
       "      <th>mr.pval</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.se</th>\n",
       "      <th>mr.method</th>\n",
       "      <th>mr.moescore</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1168</td>\n",
       "      <td>33832.0</td>\n",
       "      <td>15748</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>13011123.0</td>\n",
       "      <td>8.200307e-01</td>\n",
       "      <td>-0.692852</td>\n",
       "      <td>3.045429</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1167</td>\n",
       "      <td>22286.0</td>\n",
       "      <td>4202</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>13011123.0</td>\n",
       "      <td>5.000000e-01</td>\n",
       "      <td>-0.462777</td>\n",
       "      <td>-0.462777</td>\n",
       "      <td>Wald ratio</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1166</td>\n",
       "      <td>21695.0</td>\n",
       "      <td>3611</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>13011123.0</td>\n",
       "      <td>1.253699e-02</td>\n",
       "      <td>2.923434</td>\n",
       "      <td>1.170939</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1165</td>\n",
       "      <td>37954.0</td>\n",
       "      <td>2900</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>12940150.0</td>\n",
       "      <td>5.000000e-01</td>\n",
       "      <td>0.124119</td>\n",
       "      <td>0.124119</td>\n",
       "      <td>Wald ratio</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1164</td>\n",
       "      <td>23059.0</td>\n",
       "      <td>1333</td>\n",
       "      <td>2015.0</td>\n",
       "      <td>8714606.0</td>\n",
       "      <td>5.000000e-01</td>\n",
       "      <td>-17.286818</td>\n",
       "      <td>-17.286818</td>\n",
       "      <td>Wald ratio</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16180</th>\n",
       "      <td>ubm-a-2656</td>\n",
       "      <td>volume Left-Lateral-Ventricle</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1130</td>\n",
       "      <td>89677.0</td>\n",
       "      <td>46785</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257.0</td>\n",
       "      <td>1.543810e-02</td>\n",
       "      <td>0.108434</td>\n",
       "      <td>0.044772</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16181</th>\n",
       "      <td>ubm-a-2656</td>\n",
       "      <td>volume Left-Lateral-Ventricle</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1129</td>\n",
       "      <td>106776.0</td>\n",
       "      <td>61282</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257.0</td>\n",
       "      <td>1.285261e-90</td>\n",
       "      <td>-0.158745</td>\n",
       "      <td>0.007864</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16182</th>\n",
       "      <td>ubm-a-2656</td>\n",
       "      <td>volume Left-Lateral-Ventricle</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1128</td>\n",
       "      <td>127442.0</td>\n",
       "      <td>21468</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257.0</td>\n",
       "      <td>2.196088e-01</td>\n",
       "      <td>0.041780</td>\n",
       "      <td>0.034035</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16183</th>\n",
       "      <td>ubm-a-2656</td>\n",
       "      <td>volume Left-Lateral-Ventricle</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1127</td>\n",
       "      <td>175475.0</td>\n",
       "      <td>69501</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257.0</td>\n",
       "      <td>1.951276e-01</td>\n",
       "      <td>-0.094147</td>\n",
       "      <td>0.072669</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16184</th>\n",
       "      <td>ubm-a-2656</td>\n",
       "      <td>volume Left-Lateral-Ventricle</td>\n",
       "      <td>8411.0</td>\n",
       "      <td>Males</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Elliott LT</td>\n",
       "      <td>None</td>\n",
       "      <td>ieu-a-1126</td>\n",
       "      <td>228951.0</td>\n",
       "      <td>122977</td>\n",
       "      <td>2017.0</td>\n",
       "      <td>10680257.0</td>\n",
       "      <td>2.759776e-01</td>\n",
       "      <td>-0.066561</td>\n",
       "      <td>0.061099</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>16185 rows × 18 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                       exposure.id                 exposure.trait  \\\n",
       "0      ukb-d-M13_POLYARTHROPATHIES             #Polyarthropathies   \n",
       "1      ukb-d-M13_POLYARTHROPATHIES             #Polyarthropathies   \n",
       "2      ukb-d-M13_POLYARTHROPATHIES             #Polyarthropathies   \n",
       "3      ukb-d-M13_POLYARTHROPATHIES             #Polyarthropathies   \n",
       "4      ukb-d-M13_POLYARTHROPATHIES             #Polyarthropathies   \n",
       "...                            ...                            ...   \n",
       "16180                   ubm-a-2656  volume Left-Lateral-Ventricle   \n",
       "16181                   ubm-a-2656  volume Left-Lateral-Ventricle   \n",
       "16182                   ubm-a-2656  volume Left-Lateral-Ventricle   \n",
       "16183                   ubm-a-2656  volume Left-Lateral-Ventricle   \n",
       "16184                   ubm-a-2656  volume Left-Lateral-Ventricle   \n",
       "\n",
       "      exposure.sample_size       exposure.sex exposure.note  year      author  \\\n",
       "0                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "1                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "2                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "3                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "4                 361194.0  Males and Females          None  2018   Neale lab   \n",
       "...                    ...                ...           ...   ...         ...   \n",
       "16180               8411.0              Males          None  2018  Elliott LT   \n",
       "16181               8411.0              Males          None  2018  Elliott LT   \n",
       "16182               8411.0              Males          None  2018  Elliott LT   \n",
       "16183               8411.0              Males          None  2018  Elliott LT   \n",
       "16184               8411.0              Males          None  2018  Elliott LT   \n",
       "\n",
       "      consortium  outcome.id outcome.sample_size  N_case outcome.year  \\\n",
       "0           None  ieu-a-1168             33832.0   15748       2015.0   \n",
       "1           None  ieu-a-1167             22286.0    4202       2015.0   \n",
       "2           None  ieu-a-1166             21695.0    3611       2015.0   \n",
       "3           None  ieu-a-1165             37954.0    2900       2015.0   \n",
       "4           None  ieu-a-1164             23059.0    1333       2015.0   \n",
       "...          ...         ...                 ...     ...          ...   \n",
       "16180       None  ieu-a-1130             89677.0   46785       2017.0   \n",
       "16181       None  ieu-a-1129            106776.0   61282       2017.0   \n",
       "16182       None  ieu-a-1128            127442.0   21468       2017.0   \n",
       "16183       None  ieu-a-1127            175475.0   69501       2017.0   \n",
       "16184       None  ieu-a-1126            228951.0  122977       2017.0   \n",
       "\n",
       "      outcome.nsnp       mr.pval       mr.b      mr.se   mr.method  \\\n",
       "0       13011123.0  8.200307e-01  -0.692852   3.045429      FE IVW   \n",
       "1       13011123.0  5.000000e-01  -0.462777  -0.462777  Wald ratio   \n",
       "2       13011123.0  1.253699e-02   2.923434   1.170939      FE IVW   \n",
       "3       12940150.0  5.000000e-01   0.124119   0.124119  Wald ratio   \n",
       "4        8714606.0  5.000000e-01 -17.286818 -17.286818  Wald ratio   \n",
       "...            ...           ...        ...        ...         ...   \n",
       "16180   10680257.0  1.543810e-02   0.108434   0.044772      FE IVW   \n",
       "16181   10680257.0  1.285261e-90  -0.158745   0.007864      FE IVW   \n",
       "16182   10680257.0  2.196088e-01   0.041780   0.034035      FE IVW   \n",
       "16183   10680257.0  1.951276e-01  -0.094147   0.072669      FE IVW   \n",
       "16184   10680257.0  2.759776e-01  -0.066561   0.061099      FE IVW   \n",
       "\n",
       "       mr.moescore  \n",
       "0              1.0  \n",
       "1              1.0  \n",
       "2              1.0  \n",
       "3              1.0  \n",
       "4              1.0  \n",
       "...            ...  \n",
       "16180          1.0  \n",
       "16181          1.0  \n",
       "16182          1.0  \n",
       "16183          1.0  \n",
       "16184          1.0  \n",
       "\n",
       "[16185 rows x 18 columns]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# now those traits that appered at least once in something at <1e05, \n",
    "# get MR results for those traits with all BC datasets\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id in {gwas_list} \n",
    "AND  exposure.id  in {exposure_list}\n",
    "with mr, exposure, outcome\n",
    "ORDER BY exposure.trait\n",
    "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, exposure.note,\n",
    "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
    "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, outcome.year, outcome.nsnp,\n",
    "        mr.pval, mr.b, mr.se, mr.method, mr.moescore\n",
    "\"\"\".format(gwas_list = all_bc_gwas,\n",
    "           exposure_list = list(set(df['exposure.id'])))\n",
    "df = query_to_df(session, query, True)\n",
    "\n",
    "\n",
    "#df.to_csv(\"query_results/bc_all_mr.tsv\", sep=\"\\t\", index=False)\n",
    "#df.to_csv(\"query_results/bc_all_mr_allMR.tsv\", sep=\"\\t\", index=False) with pval <1\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(16185, 18)"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "df.to_csv(\"../query_results/bc_all_mr_allMR.tsv\", sep=\"\\t\", index=False)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Extract MR results for a list of exposure GWAS\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "WHERE outcome.id in None \n",
      "AND  exposure.id  in ['ukb-b-2115', 'ukb-b-19885', 'ukb-b-5764', 'ebi-a-GCST006100', 'ukb-a-511', 'ukb-a-4', 'ukb-b-4512', 'ukb-b-15869', 'ukb-b-8865', 'ukb-b-7663', 'ukb-b-6011', 'ukb-a-507', 'ukb-b-16998', 'ukb-b-2993', 'ukb-a-483', 'ukb-b-8764', 'ukb-b-4710', 'ukb-b-3502', 'ukb-b-151', 'ukb-a-485', 'ukb-b-13184', 'ukb-a-512', 'ebi-a-GCST006097', 'ukb-b-13702', 'ukb-a-486', 'ukb-b-12205', 'ukb-b-11495', 'ukb-a-509', 'ukb-a-508', 'ukb-a-349', 'ukb-a-350', 'ukb-a-1', 'ukb-b-7337', 'ukb-b-2346', 'ukb-b-14649', 'ukb-b-1046', 'ukb-a-396', 'ukb-b-18176', 'ukb-b-13932', 'ebi-a-GCST006098', 'ukb-a-484', 'ebi-a-GCST006099', 'ukb-b-9991', 'ukb-a-482', 'ukb-a-487', 'ukb-b-2634', 'ukb-a-312', 'ukb-b-9433', 'ukb-a-315', 'ukb-a-323', 'ukb-b-9487', 'ukb-b-8727', 'ukb-b-18105', 'ukb-b-12405', 'ukb-b-9509', 'ukb-b-3768', 'ukb-b-4564', 'ukb-b-4193', 'ukb-b-9547', 'ukb-b-17422', 'ieu-a-1004', 'ukb-a-322', 'ukb-a-319', 'ukb-b-8080', 'ukb-a-324', 'ukb-a-317', 'ukb-a-451', 'ukb-b-18541', 'ukb-b-4206', 'ukb-b-1209', 'ukb-a-316', 'ukb-a-320', 'ukb-b-16927', 'ieu-a-1095', 'ebi-a-GCST90000027', 'ebi-a-GCST90000025', 'ebi-a-GCST90000026', 'ieu-a-27', 'ieu-a-1083', 'ebi-a-GCST007557', 'ukb-a-198', 'ukb-b-13378', 'ukb-a-264', 'ukb-b-8909', 'ebi-a-GCST003435', 'ieu-b-40', 'ieu-a-974', 'ieu-a-835', 'ebi-a-GCST006802', 'ieu-a-1089', 'ebi-a-GCST006368', 'ieu-a-95', 'ebi-a-GCST002783', 'ukb-a-248', 'ukb-b-2303', 'ukb-b-19953', 'ieu-a-1096', 'ukb-a-34', 'ukb-b-4650', 'ukb-a-35', 'ukb-d-R22', 'ukb-b-13845', 'ieu-a-1040', 'ieu-a-1038', 'ieu-a-1035', 'ieu-a-1037', 'ieu-a-85', 'ieu-a-86', 'ieu-a-87', 'ukb-d-4979', 'ukb-b-13330', 'prot-a-18', 'ukb-d-20544_5', 'ieu-a-90', 'ieu-a-91', 'ieu-a-92', 'ebi-a-GCST005314', 'ieu-a-93', 'ukb-a-195', 'ukb-b-16881', 'ieu-a-1070', 'ieu-a-1071', 'ukb-a-389', 'ukb-b-10787', 'ukb-b-20044', 'ukb-a-291', 'ukb-a-290', 'ukb-b-16407', 'ukb-a-292', 'ukb-b-17409', 'ukb-a-293', 'ukb-b-9685', 'ieu-a-109', 'ieu-a-73', 'ieu-a-75', 'ieu-a-81', 'ieu-a-79', 'ieu-a-111', 'ukb-b-19393', 'ukb-a-265', 'ukb-a-266', 'ukb-b-13354', 'ukb-a-267', 'ukb-b-14540']\n",
      "//AND mr.pval < 1e-05\n",
      "with mr, exposure, outcome\n",
      "ORDER BY exposure.trait\n",
      "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, exposure.note,\n",
      "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
      "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, outcome.year, outcome.nsnp,\n",
      "        mr.pval, mr.b, mr.se, mr.method, mr.moescore\n",
      "        \n",
      "\n"
     ]
    },
    {
     "ename": "CypherSyntaxError",
     "evalue": "{code: Neo.ClientError.Statement.SyntaxError} {message: Variable `None` not defined (line 3, column 21 (offset: 74))\n\"WHERE outcome.id in None\"\n                     ^}",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mCypherSyntaxError\u001b[0m                         Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-6-9ecc9884f85a>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m     17\u001b[0m \"\"\".format(gwas_list_outcome = all_bc_gwas,\n\u001b[1;32m     18\u001b[0m            gwas_list_exposure = risk_factors )\n\u001b[0;32m---> 19\u001b[0;31m \u001b[0mdf\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mquery_to_df\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msession\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mquery\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;32mTrue\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     20\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     21\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/Documents/Projects_IEU/epigraphdb_breast_cancer/python/graph_functions.py\u001b[0m in \u001b[0;36mquery_to_df\u001b[0;34m(session, query, print_query)\u001b[0m\n\u001b[1;32m     64\u001b[0m     \u001b[0;32mif\u001b[0m \u001b[0mprint_query\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     65\u001b[0m         \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 66\u001b[0;31m     \u001b[0mdata\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0msession\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdata\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     67\u001b[0m     \u001b[0mdf\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mpd\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mjson_normalize\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     68\u001b[0m     \u001b[0;32mreturn\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdf\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/opt/anaconda3/envs/neo4j_build/lib/python3.7/site-packages/neo4j/work/simple.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, query, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    215\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    216\u001b[0m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_autoResult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mResult\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcx\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhydrant\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_config\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfetch_size\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_result_closed\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 217\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_autoResult\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_run\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_config\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdatabase\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_config\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdefault_access_mode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_bookmarks\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    218\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    219\u001b[0m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_autoResult\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/opt/anaconda3/envs/neo4j_build/lib/python3.7/site-packages/neo4j/work/result.py\u001b[0m in \u001b[0;36m_run\u001b[0;34m(self, query, parameters, db, access_mode, bookmarks, **kwparameters)\u001b[0m\n\u001b[1;32m     99\u001b[0m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_pull\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    100\u001b[0m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend_all\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 101\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_attach\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    102\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    103\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_pull\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/opt/anaconda3/envs/neo4j_build/lib/python3.7/site-packages/neo4j/work/result.py\u001b[0m in \u001b[0;36m_attach\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    200\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_closed\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mFalse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    201\u001b[0m             \u001b[0;32mwhile\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_attached\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mFalse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 202\u001b[0;31m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfetch_message\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    203\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    204\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_buffer_all\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/opt/anaconda3/envs/neo4j_build/lib/python3.7/site-packages/neo4j/io/_bolt4x1.py\u001b[0m in \u001b[0;36mfetch_message\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    351\u001b[0m             \u001b[0mlog\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdebug\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"[#%04X]  S: FAILURE %r\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mlocal_port\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msummary_metadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    352\u001b[0m             \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 353\u001b[0;31m                 \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mon_failure\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msummary_metadata\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0;34m{\u001b[0m\u001b[0;34m}\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    354\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mServiceUnavailable\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mDatabaseUnavailable\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    355\u001b[0m                 \u001b[0;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpool\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/opt/anaconda3/envs/neo4j_build/lib/python3.7/site-packages/neo4j/io/_bolt4x1.py\u001b[0m in \u001b[0;36mon_failure\u001b[0;34m(self, metadata)\u001b[0m\n\u001b[1;32m    550\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    551\u001b[0m             \u001b[0mhandler\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 552\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0mNeo4jError\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhydrate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m**\u001b[0m\u001b[0mmetadata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    553\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    554\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mon_ignored\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmetadata\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mCypherSyntaxError\u001b[0m: {code: Neo.ClientError.Statement.SyntaxError} {message: Variable `None` not defined (line 3, column 21 (offset: 74))\n\"WHERE outcome.id in None\"\n                     ^}"
     ]
    }
   ],
   "source": [
    "# read list of exp gwas (EXTRACTED IN R)\n",
    "risk_factors = list(pd.read_csv(\"../query_results/gwas_rf_list.txt\", sep = '\\t')['id'])\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id in {gwas_list_outcome} \n",
    "AND  exposure.id  in {gwas_list_exposure}\n",
    "//AND mr.pval < 1e-05\n",
    "with mr, exposure, outcome\n",
    "ORDER BY exposure.trait\n",
    "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, exposure.note,\n",
    "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
    "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, outcome.year, outcome.nsnp,\n",
    "        mr.pval, mr.b, mr.se, mr.method, mr.moescore\n",
    "        \n",
    "\"\"\".format(gwas_list_outcome = all_bc_gwas,\n",
    "           gwas_list_exposure = risk_factors )\n",
    "df = query_to_df(session, query, True)\n",
    "\n",
    "\n",
    "#df.to_csv(\"query_results/gwas_rf_bc_all_mr.tsv\", sep=\"\\t\", index=False)\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Traits vs traits -- looking for intermediates"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
      "WHERE outcome.id in ['ukb-d-M13_POLYARTHROPATHIES', 'met-a-558', 'met-a-682', 'met-a-427', 'met-a-500', 'ukb-b-14067', 'ukb-b-16677', 'ukb-b-1004', 'ukb-b-18436', 'ukb-b-4643', 'ukb-a-320', 'ukb-b-17422', 'prot-a-67', 'ukb-d-20117_2', 'prot-a-1154', 'prot-a-1411', 'ieu-a-298', 'prot-a-99', 'ukb-d-30630_irnt', 'ukb-d-30630_raw', 'prot-a-310', 'ukb-b-5716', 'ukb-a-30', 'ukb-b-1707', 'prot-a-216', 'prot-a-212', 'prot-a-674', 'met-a-362', 'ieu-a-974', 'met-a-656', 'prot-a-390', 'prot-a-392', 'prot-a-399', 'prot-a-408', 'ieu-a-1015', 'prot-a-426', 'prot-a-655', 'prot-a-735', 'prot-a-486', 'prot-a-488', 'prot-a-346', 'prot-a-354', 'prot-a-366', 'ukb-a-58', 'ukb-a-60', 'ukb-d-C_PRIMARY_LYMPHOID_HEMATOPOIETIC', 'prot-a-550', 'prot-a-643', 'prot-a-710', 'prot-a-532', 'ukb-d-1468_5', 'prot-a-412', 'ukb-b-2221', 'ukb-a-295', 'ieu-a-1096', 'prot-a-714', 'prot-a-381', 'ukb-a-34', 'prot-a-305', 'prot-a-322', 'prot-a-518', 'prot-a-521', 'ukb-d-6020_33', 'met-c-890', 'prot-a-608', 'prot-a-609', 'prot-a-500', 'ukb-b-16858', 'prot-a-197', 'prot-a-654', 'prot-a-706', 'ukb-b-4955', 'met-a-618', 'prot-a-831', 'prot-a-867', 'ukb-d-D17', 'ukb-a-528', 'ukb-d-H33', 'ukb-d-J45', 'ukb-b-3672', 'ukb-b-7352', 'ukb-b-11064', 'prot-a-2629', 'prot-a-2464', 'prot-a-836', 'prot-a-586', 'prot-a-2665', 'prot-a-2573', 'prot-a-982', 'ukb-d-IV_ENDOCRIN_NUTRIT', 'prot-a-892', 'prot-a-2071', 'prot-a-1707', 'prot-a-1835', 'prot-a-977', 'prot-a-2892', 'ukb-d-20406', 'ukb-a-373', 'ukb-b-6445', 'ukb-d-20500', 'prot-a-2891', 'ukb-a-426', 'ukb-b-10181', 'ukb-d-5012', 'ukb-b-2535', 'ukb-b-3666', 'prot-a-1148', 'prot-a-1097', 'prot-a-1117', 'ukb-b-14713', 'met-c-876', 'met-c-900', 'met-c-911', 'met-c-944', 'ukb-a-243', 'prot-a-1305', 'prot-a-1202', 'prot-a-1166', 'prot-a-1414', 'prot-a-1250', 'prot-a-1046', 'prot-a-1347', 'ukb-a-316', 'prot-a-1369', 'ieu-a-1056', 'ieu-a-1034', 'prot-a-1317', 'prot-a-1378', 'prot-a-1313', 'ieu-a-1228', 'ieu-a-101', 'ieu-a-99', 'ieu-a-55', 'prot-a-10', 'ukb-d-41231_1', 'ukb-a-418', 'ukb-b-323', 'ukb-b-7910', 'ukb-b-9127', 'ukb-a-210', 'ukb-b-12018', 'ukb-b-10454', 'ukb-b-16027', 'prot-a-1576', 'ukb-a-273', 'ukb-b-19379', 'ukb-b-7859', 'ukb-a-269', 'prot-a-1403', 'prot-a-1586', 'prot-a-1397', 'prot-a-1506', 'prot-a-1530', 'prot-a-1541', 'ieu-a-1049', 'met-a-573', 'met-a-652', 'ukb-d-22617_9149', 'prot-a-1657', 'prot-a-1659', 'prot-a-1655', 'prot-a-1644', 'prot-a-2666', 'prot-a-1792', 'prot-a-1746', 'prot-a-1074', 'prot-a-1075', 'prot-a-1779', 'prot-a-2356', 'prot-a-1898', 'ukb-b-15784', 'ukb-b-9038', 'ukb-b-16019', 'ukb-d-1538_2', 'prot-a-1833', 'prot-a-2815', 'prot-a-1858', 'ukb-a-393', 'ukb-b-8846', 'ukb-d-20553_5', 'ukb-d-1418_1', 'ukb-d-1418_3', 'ukb-a-11', 'prot-a-2396', 'prot-a-1930', 'prot-a-213', 'ukb-d-II_NEOPLASM', 'ukb-d-G6_NERPLEX', 'prot-a-2007', 'prot-a-2101', 'prot-a-2082', 'prot-a-2337', 'ukb-b-3599', 'ukb-a-94', 'ukb-b-18194', 'ukb-b-13251', 'ukb-b-5445', 'ukb-b-4801', 'ieu-a-90', 'ieu-a-91', 'ukb-b-9190', 'ukb-b-17788', 'ukb-b-15491', 'ukb-b-9961', 'ukb-b-13500', 'ieu-a-93', 'prot-a-1389', 'prot-a-2087', 'prot-a-2189', 'prot-a-2398', 'prot-a-2357', 'ukb-b-6500', 'ieu-a-812', 'prot-a-2341', 'prot-a-2269', 'met-c-914', 'prot-a-2166', 'prot-a-2308', 'prot-a-1610', 'prot-a-648', 'prot-a-2247', 'prot-a-2427', 'prot-a-1049', 'prot-a-1879', 'prot-a-2329', 'prot-a-995', 'prot-a-2030', 'prot-a-2720', 'prot-a-2205', 'ukb-b-11971', 'ukb-b-8778', 'ukb-a-401', 'ukb-a-421', 'prot-a-2493', 'prot-a-2291', 'ukb-b-18336', 'prot-a-2820', 'prot-a-2878', 'ieu-a-1088', 'ukb-a-14', 'prot-a-2748', 'prot-a-2875', 'prot-a-2889', 'prot-a-3109', 'ukb-b-14360', 'ukb-d-22506_114', 'prot-a-3076', 'met-c-864', 'met-c-874', 'met-c-957', 'met-c-912', 'prot-a-1258', 'prot-a-3000', 'ukb-b-11856', 'ukb-b-17616', 'ieu-a-783', 'met-c-923', 'met-c-932', 'prot-a-2392', 'prot-a-2930', 'ukb-b-11189', 'ukb-a-487', 'ukb-b-16886', 'prot-a-2978', 'prot-a-3180', 'ieu-a-970', 'ukb-d-ULCERNAS', 'prot-a-314', 'ukb-b-15555', 'met-a-316', 'ukb-b-4711', 'prot-a-3193', 'prot-a-3197', 'prot-a-3214', 'ieu-a-62', 'ieu-a-68', 'met-a-485', 'met-a-444', 'met-a-495', 'met-a-513', 'met-a-517', 'met-a-519', 'met-a-542', 'met-a-629', 'met-a-667', 'prot-a-3243', 'prot-a-3258', 'prot-b-71', 'prot-b-55', 'prot-b-38', 'ukb-b-15782', 'prot-a-2575'] \n",
      "AND  exposure.id  in ['ukb-d-M13_POLYARTHROPATHIES', 'met-a-558', 'met-a-682', 'met-a-427', 'met-a-500', 'ukb-b-14067', 'ukb-b-16677', 'ukb-b-1004', 'ukb-b-18436', 'ukb-b-4643', 'ukb-a-320', 'ukb-b-17422', 'prot-a-67', 'ukb-d-20117_2', 'prot-a-1154', 'prot-a-1411', 'ieu-a-298', 'prot-a-99', 'ukb-d-30630_irnt', 'ukb-d-30630_raw', 'prot-a-310', 'ukb-b-5716', 'ukb-a-30', 'ukb-b-1707', 'prot-a-216', 'prot-a-212', 'prot-a-674', 'met-a-362', 'ieu-a-974', 'met-a-656', 'prot-a-390', 'prot-a-392', 'prot-a-399', 'prot-a-408', 'ieu-a-1015', 'prot-a-426', 'prot-a-655', 'prot-a-735', 'prot-a-486', 'prot-a-488', 'prot-a-346', 'prot-a-354', 'prot-a-366', 'ukb-a-58', 'ukb-a-60', 'ukb-d-C_PRIMARY_LYMPHOID_HEMATOPOIETIC', 'prot-a-550', 'prot-a-643', 'prot-a-710', 'prot-a-532', 'ukb-d-1468_5', 'prot-a-412', 'ukb-b-2221', 'ukb-a-295', 'ieu-a-1096', 'prot-a-714', 'prot-a-381', 'ukb-a-34', 'prot-a-305', 'prot-a-322', 'prot-a-518', 'prot-a-521', 'ukb-d-6020_33', 'met-c-890', 'prot-a-608', 'prot-a-609', 'prot-a-500', 'ukb-b-16858', 'prot-a-197', 'prot-a-654', 'prot-a-706', 'ukb-b-4955', 'met-a-618', 'prot-a-831', 'prot-a-867', 'ukb-d-D17', 'ukb-a-528', 'ukb-d-H33', 'ukb-d-J45', 'ukb-b-3672', 'ukb-b-7352', 'ukb-b-11064', 'prot-a-2629', 'prot-a-2464', 'prot-a-836', 'prot-a-586', 'prot-a-2665', 'prot-a-2573', 'prot-a-982', 'ukb-d-IV_ENDOCRIN_NUTRIT', 'prot-a-892', 'prot-a-2071', 'prot-a-1707', 'prot-a-1835', 'prot-a-977', 'prot-a-2892', 'ukb-d-20406', 'ukb-a-373', 'ukb-b-6445', 'ukb-d-20500', 'prot-a-2891', 'ukb-a-426', 'ukb-b-10181', 'ukb-d-5012', 'ukb-b-2535', 'ukb-b-3666', 'prot-a-1148', 'prot-a-1097', 'prot-a-1117', 'ukb-b-14713', 'met-c-876', 'met-c-900', 'met-c-911', 'met-c-944', 'ukb-a-243', 'prot-a-1305', 'prot-a-1202', 'prot-a-1166', 'prot-a-1414', 'prot-a-1250', 'prot-a-1046', 'prot-a-1347', 'ukb-a-316', 'prot-a-1369', 'ieu-a-1056', 'ieu-a-1034', 'prot-a-1317', 'prot-a-1378', 'prot-a-1313', 'ieu-a-1228', 'ieu-a-101', 'ieu-a-99', 'ieu-a-55', 'prot-a-10', 'ukb-d-41231_1', 'ukb-a-418', 'ukb-b-323', 'ukb-b-7910', 'ukb-b-9127', 'ukb-a-210', 'ukb-b-12018', 'ukb-b-10454', 'ukb-b-16027', 'prot-a-1576', 'ukb-a-273', 'ukb-b-19379', 'ukb-b-7859', 'ukb-a-269', 'prot-a-1403', 'prot-a-1586', 'prot-a-1397', 'prot-a-1506', 'prot-a-1530', 'prot-a-1541', 'ieu-a-1049', 'met-a-573', 'met-a-652', 'ukb-d-22617_9149', 'prot-a-1657', 'prot-a-1659', 'prot-a-1655', 'prot-a-1644', 'prot-a-2666', 'prot-a-1792', 'prot-a-1746', 'prot-a-1074', 'prot-a-1075', 'prot-a-1779', 'prot-a-2356', 'prot-a-1898', 'ukb-b-15784', 'ukb-b-9038', 'ukb-b-16019', 'ukb-d-1538_2', 'prot-a-1833', 'prot-a-2815', 'prot-a-1858', 'ukb-a-393', 'ukb-b-8846', 'ukb-d-20553_5', 'ukb-d-1418_1', 'ukb-d-1418_3', 'ukb-a-11', 'prot-a-2396', 'prot-a-1930', 'prot-a-213', 'ukb-d-II_NEOPLASM', 'ukb-d-G6_NERPLEX', 'prot-a-2007', 'prot-a-2101', 'prot-a-2082', 'prot-a-2337', 'ukb-b-3599', 'ukb-a-94', 'ukb-b-18194', 'ukb-b-13251', 'ukb-b-5445', 'ukb-b-4801', 'ieu-a-90', 'ieu-a-91', 'ukb-b-9190', 'ukb-b-17788', 'ukb-b-15491', 'ukb-b-9961', 'ukb-b-13500', 'ieu-a-93', 'prot-a-1389', 'prot-a-2087', 'prot-a-2189', 'prot-a-2398', 'prot-a-2357', 'ukb-b-6500', 'ieu-a-812', 'prot-a-2341', 'prot-a-2269', 'met-c-914', 'prot-a-2166', 'prot-a-2308', 'prot-a-1610', 'prot-a-648', 'prot-a-2247', 'prot-a-2427', 'prot-a-1049', 'prot-a-1879', 'prot-a-2329', 'prot-a-995', 'prot-a-2030', 'prot-a-2720', 'prot-a-2205', 'ukb-b-11971', 'ukb-b-8778', 'ukb-a-401', 'ukb-a-421', 'prot-a-2493', 'prot-a-2291', 'ukb-b-18336', 'prot-a-2820', 'prot-a-2878', 'ieu-a-1088', 'ukb-a-14', 'prot-a-2748', 'prot-a-2875', 'prot-a-2889', 'prot-a-3109', 'ukb-b-14360', 'ukb-d-22506_114', 'prot-a-3076', 'met-c-864', 'met-c-874', 'met-c-957', 'met-c-912', 'prot-a-1258', 'prot-a-3000', 'ukb-b-11856', 'ukb-b-17616', 'ieu-a-783', 'met-c-923', 'met-c-932', 'prot-a-2392', 'prot-a-2930', 'ukb-b-11189', 'ukb-a-487', 'ukb-b-16886', 'prot-a-2978', 'prot-a-3180', 'ieu-a-970', 'ukb-d-ULCERNAS', 'prot-a-314', 'ukb-b-15555', 'met-a-316', 'ukb-b-4711', 'prot-a-3193', 'prot-a-3197', 'prot-a-3214', 'ieu-a-62', 'ieu-a-68', 'met-a-485', 'met-a-444', 'met-a-495', 'met-a-513', 'met-a-517', 'met-a-519', 'met-a-542', 'met-a-629', 'met-a-667', 'prot-a-3243', 'prot-a-3258', 'prot-b-71', 'prot-b-55', 'prot-b-38', 'ukb-b-15782', 'prot-a-2575']\n",
      "AND mr.pval < 1e-05\n",
      "with mr, exposure, outcome\n",
      "ORDER BY exposure.trait\n",
      "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, exposure.note,\n",
      "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
      "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, outcome.year, outcome.nsnp,\n",
      "        mr.pval, mr.b, mr.se, mr.method, mr.moescore\n",
      "        \n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>exposure.id</th>\n",
       "      <th>exposure.trait</th>\n",
       "      <th>exposure.sample_size</th>\n",
       "      <th>exposure.sex</th>\n",
       "      <th>exposure.note</th>\n",
       "      <th>year</th>\n",
       "      <th>author</th>\n",
       "      <th>consortium</th>\n",
       "      <th>outcome.id</th>\n",
       "      <th>outcome.sample_size</th>\n",
       "      <th>N_case</th>\n",
       "      <th>outcome.year</th>\n",
       "      <th>outcome.nsnp</th>\n",
       "      <th>mr.pval</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.se</th>\n",
       "      <th>mr.method</th>\n",
       "      <th>mr.moescore</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ukb-b-3672</td>\n",
       "      <td>463010.0</td>\n",
       "      <td>14326.0</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>9851867.0</td>\n",
       "      <td>1.086372e-12</td>\n",
       "      <td>0.353187</td>\n",
       "      <td>0.049611</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ukb-d-D17</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>4314.0</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>11857594.0</td>\n",
       "      <td>2.784593e-10</td>\n",
       "      <td>0.204733</td>\n",
       "      <td>0.032444</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>prot-a-714</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>10534735.0</td>\n",
       "      <td>7.432935e-10</td>\n",
       "      <td>5.031430</td>\n",
       "      <td>0.817243</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ukb-d-J45</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>1693.0</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>10336532.0</td>\n",
       "      <td>2.094952e-11</td>\n",
       "      <td>0.270787</td>\n",
       "      <td>0.040421</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ukb-d-M13_POLYARTHROPATHIES</td>\n",
       "      <td>#Polyarthropathies</td>\n",
       "      <td>361194.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Neale lab</td>\n",
       "      <td>None</td>\n",
       "      <td>ukb-b-6445</td>\n",
       "      <td>221697.0</td>\n",
       "      <td>18171.0</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>9851867.0</td>\n",
       "      <td>1.599454e-09</td>\n",
       "      <td>1.150836</td>\n",
       "      <td>0.190725</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4961</th>\n",
       "      <td>prot-a-2575</td>\n",
       "      <td>rRNA methyltransferase 3, mitochondrial</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Sun BB</td>\n",
       "      <td>None</td>\n",
       "      <td>prot-a-2189</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>10534735.0</td>\n",
       "      <td>2.174772e-16</td>\n",
       "      <td>0.296702</td>\n",
       "      <td>0.036130</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4962</th>\n",
       "      <td>prot-a-2575</td>\n",
       "      <td>rRNA methyltransferase 3, mitochondrial</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Sun BB</td>\n",
       "      <td>None</td>\n",
       "      <td>prot-a-310</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>10534735.0</td>\n",
       "      <td>1.030570e-10</td>\n",
       "      <td>0.244003</td>\n",
       "      <td>0.037757</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4963</th>\n",
       "      <td>prot-a-2575</td>\n",
       "      <td>rRNA methyltransferase 3, mitochondrial</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Sun BB</td>\n",
       "      <td>None</td>\n",
       "      <td>prot-a-2820</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>10534735.0</td>\n",
       "      <td>1.729263e-06</td>\n",
       "      <td>-0.052297</td>\n",
       "      <td>0.010935</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4964</th>\n",
       "      <td>prot-a-2575</td>\n",
       "      <td>rRNA methyltransferase 3, mitochondrial</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Sun BB</td>\n",
       "      <td>None</td>\n",
       "      <td>prot-a-2247</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>10534735.0</td>\n",
       "      <td>1.544343e-06</td>\n",
       "      <td>-0.101734</td>\n",
       "      <td>0.021171</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4965</th>\n",
       "      <td>prot-a-2575</td>\n",
       "      <td>rRNA methyltransferase 3, mitochondrial</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>Males and Females</td>\n",
       "      <td>None</td>\n",
       "      <td>2018</td>\n",
       "      <td>Sun BB</td>\n",
       "      <td>None</td>\n",
       "      <td>prot-a-1317</td>\n",
       "      <td>3301.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>2018.0</td>\n",
       "      <td>10534735.0</td>\n",
       "      <td>2.441953e-06</td>\n",
       "      <td>0.166903</td>\n",
       "      <td>0.035414</td>\n",
       "      <td>FE IVW</td>\n",
       "      <td>1.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>4966 rows × 18 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                      exposure.id                           exposure.trait  \\\n",
       "0     ukb-d-M13_POLYARTHROPATHIES                       #Polyarthropathies   \n",
       "1     ukb-d-M13_POLYARTHROPATHIES                       #Polyarthropathies   \n",
       "2     ukb-d-M13_POLYARTHROPATHIES                       #Polyarthropathies   \n",
       "3     ukb-d-M13_POLYARTHROPATHIES                       #Polyarthropathies   \n",
       "4     ukb-d-M13_POLYARTHROPATHIES                       #Polyarthropathies   \n",
       "...                           ...                                      ...   \n",
       "4961                  prot-a-2575  rRNA methyltransferase 3, mitochondrial   \n",
       "4962                  prot-a-2575  rRNA methyltransferase 3, mitochondrial   \n",
       "4963                  prot-a-2575  rRNA methyltransferase 3, mitochondrial   \n",
       "4964                  prot-a-2575  rRNA methyltransferase 3, mitochondrial   \n",
       "4965                  prot-a-2575  rRNA methyltransferase 3, mitochondrial   \n",
       "\n",
       "     exposure.sample_size       exposure.sex exposure.note  year     author  \\\n",
       "0                361194.0  Males and Females          None  2018  Neale lab   \n",
       "1                361194.0  Males and Females          None  2018  Neale lab   \n",
       "2                361194.0  Males and Females          None  2018  Neale lab   \n",
       "3                361194.0  Males and Females          None  2018  Neale lab   \n",
       "4                361194.0  Males and Females          None  2018  Neale lab   \n",
       "...                   ...                ...           ...   ...        ...   \n",
       "4961               3301.0  Males and Females          None  2018     Sun BB   \n",
       "4962               3301.0  Males and Females          None  2018     Sun BB   \n",
       "4963               3301.0  Males and Females          None  2018     Sun BB   \n",
       "4964               3301.0  Males and Females          None  2018     Sun BB   \n",
       "4965               3301.0  Males and Females          None  2018     Sun BB   \n",
       "\n",
       "     consortium   outcome.id outcome.sample_size   N_case outcome.year  \\\n",
       "0          None   ukb-b-3672            463010.0  14326.0       2018.0   \n",
       "1          None    ukb-d-D17            361194.0   4314.0       2018.0   \n",
       "2          None   prot-a-714              3301.0      NaN       2018.0   \n",
       "3          None    ukb-d-J45            361194.0   1693.0       2018.0   \n",
       "4          None   ukb-b-6445            221697.0  18171.0       2018.0   \n",
       "...         ...          ...                 ...      ...          ...   \n",
       "4961       None  prot-a-2189              3301.0      NaN       2018.0   \n",
       "4962       None   prot-a-310              3301.0      NaN       2018.0   \n",
       "4963       None  prot-a-2820              3301.0      NaN       2018.0   \n",
       "4964       None  prot-a-2247              3301.0      NaN       2018.0   \n",
       "4965       None  prot-a-1317              3301.0      NaN       2018.0   \n",
       "\n",
       "     outcome.nsnp       mr.pval      mr.b     mr.se mr.method  mr.moescore  \n",
       "0       9851867.0  1.086372e-12  0.353187  0.049611    FE IVW          1.0  \n",
       "1      11857594.0  2.784593e-10  0.204733  0.032444    FE IVW          1.0  \n",
       "2      10534735.0  7.432935e-10  5.031430  0.817243    FE IVW          1.0  \n",
       "3      10336532.0  2.094952e-11  0.270787  0.040421    FE IVW          1.0  \n",
       "4       9851867.0  1.599454e-09  1.150836  0.190725    FE IVW          1.0  \n",
       "...           ...           ...       ...       ...       ...          ...  \n",
       "4961   10534735.0  2.174772e-16  0.296702  0.036130    FE IVW          1.0  \n",
       "4962   10534735.0  1.030570e-10  0.244003  0.037757    FE IVW          1.0  \n",
       "4963   10534735.0  1.729263e-06 -0.052297  0.010935    FE IVW          1.0  \n",
       "4964   10534735.0  1.544343e-06 -0.101734  0.021171    FE IVW          1.0  \n",
       "4965   10534735.0  2.441953e-06  0.166903  0.035414    FE IVW          1.0  \n",
       "\n",
       "[4966 rows x 18 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ids = list(pd.read_csv(\"../other_text_files/potential_intem_traits.csv\")['x'])\n",
    "\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (exposure:Gwas)-[mr:MR_EVE_MR]->(outcome:Gwas)\n",
    "WHERE outcome.id in {ids} \n",
    "AND  exposure.id  in {ids}\n",
    "AND mr.pval < 1e-05\n",
    "with mr, exposure, outcome\n",
    "ORDER BY exposure.trait\n",
    "RETURN exposure.id, exposure.trait, exposure.sample_size, exposure.sex, exposure.note,\n",
    "toInteger(exposure.year) as year, exposure.author as author, exposure.consortium as consortium,\n",
    "        outcome.id, outcome.sample_size, toInteger(outcome.ncase) as N_case, outcome.year, outcome.nsnp,\n",
    "        mr.pval, mr.b, mr.se, mr.method, mr.moescore\n",
    "        \n",
    "\"\"\".format(ids = ids )\n",
    "\n",
    "df = query_to_df(session, query, True)\n",
    "\n",
    "\n",
    "df\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "df.to_csv(\"../query_results/bc_risk_factors_mr.tsv\", sep=\"\\t\", index=False)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Correlation "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "MATCH (trait:Gwas)-[gen_cor:GEN_COR]-(assoc_trait:Gwas)\n",
      "where assoc_trait.id in ['ukb-a-519']\n",
      "match (trait:Gwas)-[mr:MR_EVE_MR]->(assoc_trait:Gwas)\n",
      "//where mr.pval < 1e-03\n",
      "return distinct trait.trait, trait.id, gen_cor.rg, assoc_trait.trait, assoc_trait.id, mr.b, mr.pval\n",
      "order by gen_cor.rg desc\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>trait.trait</th>\n",
       "      <th>trait.id</th>\n",
       "      <th>gen_cor.rg</th>\n",
       "      <th>assoc_trait.trait</th>\n",
       "      <th>assoc_trait.id</th>\n",
       "      <th>mr.b</th>\n",
       "      <th>mr.pval</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Number of self-reported cancers</td>\n",
       "      <td>ukb-a-21</td>\n",
       "      <td>0.8279</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>0.077594</td>\n",
       "      <td>1.850559e-02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Had other major operations</td>\n",
       "      <td>ukb-a-326</td>\n",
       "      <td>0.2660</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>0.026946</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Breastfed as a baby</td>\n",
       "      <td>ukb-a-33</td>\n",
       "      <td>0.2471</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.012162</td>\n",
       "      <td>5.060810e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Headaches for 3+ months</td>\n",
       "      <td>ukb-a-354</td>\n",
       "      <td>0.1980</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.017729</td>\n",
       "      <td>3.182665e-29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Qualifications: NVQ or HND or HNC or equivalent</td>\n",
       "      <td>ukb-a-402</td>\n",
       "      <td>0.1885</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>0.026366</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>260</th>\n",
       "      <td>Reason for glasses/contact lenses: For 'astigm...</td>\n",
       "      <td>ukb-a-422</td>\n",
       "      <td>-0.1279</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.077385</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>261</th>\n",
       "      <td>Diagnoses - main ICD10: I21 Acute myocardial i...</td>\n",
       "      <td>ukb-a-533</td>\n",
       "      <td>-0.1304</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.057651</td>\n",
       "      <td>5.647018e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>262</th>\n",
       "      <td>Number of days/week of vigorous physical activ...</td>\n",
       "      <td>ukb-a-511</td>\n",
       "      <td>-0.1306</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.006864</td>\n",
       "      <td>3.821609e-02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263</th>\n",
       "      <td>Mineral and other dietary supplements: None of...</td>\n",
       "      <td>ukb-a-493</td>\n",
       "      <td>-0.1405</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.014608</td>\n",
       "      <td>6.539805e-01</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>264</th>\n",
       "      <td>Types of transport used (excluding work): Car/...</td>\n",
       "      <td>ukb-a-478</td>\n",
       "      <td>-0.1570</td>\n",
       "      <td>Diagnoses - main ICD10: C50 Malignant neoplasm...</td>\n",
       "      <td>ukb-a-519</td>\n",
       "      <td>-0.033081</td>\n",
       "      <td>5.000000e-01</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>265 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           trait.trait   trait.id  gen_cor.rg  \\\n",
       "0                      Number of self-reported cancers   ukb-a-21      0.8279   \n",
       "1                           Had other major operations  ukb-a-326      0.2660   \n",
       "2                                  Breastfed as a baby   ukb-a-33      0.2471   \n",
       "3                              Headaches for 3+ months  ukb-a-354      0.1980   \n",
       "4      Qualifications: NVQ or HND or HNC or equivalent  ukb-a-402      0.1885   \n",
       "..                                                 ...        ...         ...   \n",
       "260  Reason for glasses/contact lenses: For 'astigm...  ukb-a-422     -0.1279   \n",
       "261  Diagnoses - main ICD10: I21 Acute myocardial i...  ukb-a-533     -0.1304   \n",
       "262  Number of days/week of vigorous physical activ...  ukb-a-511     -0.1306   \n",
       "263  Mineral and other dietary supplements: None of...  ukb-a-493     -0.1405   \n",
       "264  Types of transport used (excluding work): Car/...  ukb-a-478     -0.1570   \n",
       "\n",
       "                                     assoc_trait.trait assoc_trait.id  \\\n",
       "0    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "1    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "2    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "3    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "4    Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "..                                                 ...            ...   \n",
       "260  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "261  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "262  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "263  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "264  Diagnoses - main ICD10: C50 Malignant neoplasm...      ukb-a-519   \n",
       "\n",
       "         mr.b       mr.pval  \n",
       "0    0.077594  1.850559e-02  \n",
       "1    0.026946  5.000000e-01  \n",
       "2   -0.012162  5.060810e-01  \n",
       "3   -0.017729  3.182665e-29  \n",
       "4    0.026366  5.000000e-01  \n",
       "..        ...           ...  \n",
       "260 -0.077385  5.000000e-01  \n",
       "261 -0.057651  5.647018e-01  \n",
       "262 -0.006864  3.821609e-02  \n",
       "263 -0.014608  6.539805e-01  \n",
       "264 -0.033081  5.000000e-01  \n",
       "\n",
       "[265 rows x 7 columns]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find which traits are highly correlated with UKB cancers\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (trait:Gwas)-[gen_cor:GEN_COR]-(assoc_trait:Gwas)\n",
    "where assoc_trait.id in ['ukb-a-519']\n",
    "match (trait:Gwas)-[mr:MR_EVE_MR]->(assoc_trait:Gwas)\n",
    "//where mr.pval < 1e-03\n",
    "return distinct trait.trait, trait.id, gen_cor.rg, assoc_trait.trait, assoc_trait.id, mr.b, mr.pval\n",
    "order by gen_cor.rg desc\n",
    "\"\"\"\n",
    "df = query_to_df(session, query)\n",
    "df\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
